[{"rid": 0, "reviewer": null, "report": {"main": "- Strengths: This paper tackles an interesting problem and provides a (to my knowledge) novel and reasonable way of learning and combining cognitive features with textual features for sentiment analysis and irony detection. The paper is  clearly written and organized, and the authors provided a lot of useful detail and informative example and plots. Most of the results are convincing, and the authors did a good job comparing their approach and results with previous work.\n- Weaknesses: 1. Just from the reading abstract, I expected that the authors' approach would significantly outperform previous methods, and that using both the eye-gaze and textual features consistently yields the best results. Upon reading the actual results section, however, it seems like the findings were more mixed. I think it would be helpful to update the abstract and introduction to reflect this. \n2. When evaluating the model on dataset 1 for sentiment analysis, were the sarcastic utterances included? Did the model do better on classifying the non-sarcastic utterances than the sarcastic ones? \n3. I understand why the eye-movement data would be useful for sarcasm detection, but it wasn't as obvious to me why it would be helpful for (non-sarcastic) sentiment classification beyond the textual features.  - General Discussion: This paper contains a lot of interesting content, and the approach seems solid and novel to me. The results were a little weaker than I had anticipated from the abstract, but I believe would still be interesting to the larger community and merits publication. "}, "scores": {"overall": "4", "SUBSTANCE": "4", "APPROPRIATENESS": "5", "PRESENTATION_FORMAT": "Oral Presentation", "SOUNDNESS_CORRECTNESS": "5"}, "meta": {"license": "No individual license attached", "REVIEWER_CONFIDENCE": "4", "sentences": {"main": [[0, 13], [13, 224], [224, 352], [352, 476], [476, 490], [490, 493], [493, 704], [704, 798], [798, 883], [883, 887], [887, 990], [990, 1083], [1083, 1087], [1087, 1294], [1294, 1295], [1295, 1317], [1317, 1413], [1413, 1577]]}}}, {"rid": 1, "reviewer": null, "report": {"main": "- Strengths: (1) A deep CNN framework is proposed to extract and combine cognitive features with textual features for sentiment analysis and sarcasm detection.  (2) The ideas is interesting and novelty.\n- Weaknesses: (1) Replicability would be an important concern. Researchers cannot replicate the system/method for improvement due to lack of data for feature extraction.  - General Discussion: Overall, this paper is well written and organized. The experiments are conducted carefully for comparison with previous work and the analysis is reasonable. I offer some comments as follows.\n(1)           Does this model be suitable on sarcastic/non-sarcastic utterances? \nThe authors should provide more details for further analysis.  (2)           Why the eye-movement data would be useful for sarcastic/non-sarcastic sentiment classification beyond the textual features? The authors should provide more explanations. "}, "scores": {"overall": "3", "SUBSTANCE": "4", "APPROPRIATENESS": "5", "PRESENTATION_FORMAT": "Oral Presentation", "SOUNDNESS_CORRECTNESS": "5"}, "meta": {"license": "No individual license attached", "REVIEWER_CONFIDENCE": "3", "sentences": {"main": [[0, 13], [13, 160], [160, 161], [161, 203], [203, 217], [217, 266], [266, 373], [373, 374], [374, 396], [396, 447], [447, 553], [553, 587], [587, 668], [668, 731], [731, 732], [732, 870], [870, 916]]}}}]