[{"rid": 0, "reviewer": null, "report": {"main": "The paper introduces a general method for improving NLP tasks using embeddings from language models. Context independent word representations have been very useful, and this paper proposes a nice extension by using context-dependent word representations obtained from the hidden states of neural language models. \nThey show significant improvements in tagging and chunking tasks from including embeddings from large language models. There is also interesting analysis which answers several natural questions.\nOverall this is a very good paper, but I have several suggestions: - Too many experiments are carried out on the test set. Please change Tables 5 and 6 to use development data - It would be really nice to see results on some more tasks - NER tagging and chunking don't have many interesting long range dependencies, and the language model might really help in those cases. I'd love to see results on SRL or CCG supertagging.\n- The paper claims that using a task specific RNN is necessary because a CRF on top of language model embeddings performs poorly. It wasn't clear to me if they were backpropagating into the language model in this experiment - but if not, it certainly seems like there is potential for that to make a task specific RNN unnecessary. "}, "scores": {"overall": "4", "SUBSTANCE": "4", "APPROPRIATENESS": "5", "PRESENTATION_FORMAT": "Oral Presentation", "SOUNDNESS_CORRECTNESS": "3"}, "meta": {"license": "No individual license attached", "REVIEWER_CONFIDENCE": "4", "sentences": {"main": [[0, 101], [101, 313], [313, 433], [433, 509], [509, 576], [576, 632], [632, 685], [685, 882], [882, 934], [934, 1064], [1064, 1265]]}}}, {"rid": 1, "reviewer": null, "report": {"main": "The paper proposes an approach where pre-trained word embeddings and pre-trained neural language model embeddings are leveraged (i.e., concatenated) to improve the performance in English chunking and NER on the respective CoNLL benchmarks, and on an out-of-domain English NER test set. The method records state-of-the-art scores for the two tasks.\n- Strengths: For the most part, the paper is well-written and easy to follow. The method is extensively documented. The discussion is broad and thorough.\n- Weaknesses: Sequence tagging does not equal chunking and NER. I am surprised not to see POS tagging included in the experiment, while more sequence tagging tasks would be welcome: grammatical error detection, supersense tagging, CCG supertagging, etc. This way, the paper is on chunking and NER for English, not for sequence tagging in general, as it lacks both the multilingual component and the breadth of tasks.\nWhile I welcomed the extensive description of the method, I do think that figures 1 and 2 overlap and that only one would have sufficed.\nRelated to that, the method itself is rather straightforward and simple. While this is by all means not a bad thing, it seems that this contribution could have been better suited for a short paper. Since I do enjoy the more extensive discussion section, I do not necessarily see it as a flaw, but the core of the method itself does not strike me as particularly exciting. It's more of a \"focused contribution\" (short paper description from the call) than \"substantial\" work (long paper).\n- General Discussion: Bottomline, the paper concatenates two embeddings, and sees improvements in English chunking and NER.\nAs such, does it warrant publication as an ACL long paper? I am ambivalent, so I will let my score reflect that, even if I slightly lean towards a negative answer. Why? Mainly because I would have preferred to see more breadth: a) more sequence tagging tasks and b) more languages.\nAlso, we do not know how well this method scales to low(er)-resource scenarios. \nWhat if the pre-trained embeddings are not available? What if they were not as sizeable as they are? The experiments do include a notion of that, but still far above the low-resource range. Could they not have been learned in a multi-task learning setup in your model? That would have been more substantial in my view.\nFor these reasons, I vote borderline, but with a low originality score. The idea of introducing context via the embeddings is nice in itself, but this particular instantiation of it leaves a lot to ask for. "}, "scores": {"overall": "3", "SUBSTANCE": "2", "APPROPRIATENESS": "5", "PRESENTATION_FORMAT": "Poster", "SOUNDNESS_CORRECTNESS": "3"}, "meta": {"license": "No individual license attached", "REVIEWER_CONFIDENCE": "4", "sentences": {"main": [[0, 286], [286, 348], [348, 361], [361, 426], [426, 464], [464, 502], [502, 516], [516, 566], [566, 756], [756, 919], [919, 1056], [1056, 1129], [1129, 1254], [1254, 1428], [1428, 1544], [1544, 1566], [1566, 1668], [1668, 1727], [1727, 1832], [1832, 1837], [1837, 1950], [1950, 2030], [2030, 2085], [2085, 2132], [2132, 2221], [2221, 2300], [2300, 2350], [2350, 2422], [2422, 2557]]}}}]