[{"rid": 0, "reviewer": null, "report": {"main": "This paper describes a rule based approach to time expression extraction. Its key insights are time expressions typically are short and contain at least 1 time token. It first recognizes the time token through a combination of dictionary lookup, regular expression match with POS tagging information. It then expands the time segment from either direction of the time token until it reaches based on a set of heuristic rules. Finally, it merges the time segments into a single time expression based on another set of rules. Evaluation of this approach with both rule based & ML based systems on 3 data sets show significant improvements.\n- Strengths: It's well written and clearly presented. The rules are motivated by empirical observations of the data, and seems to be well justified as evidenced by the evaluation.  - Weaknesses:  There are some underspecification in the paper that makes it difficult to reproduce the results. See below for details.\n- General Discussion: - Section 4.1: what are there 5 seasons? What about things such as Ramadan month or Holiday Season?\n- Section 5.1: \"two benchmark datasets\" => \"three datasets\"?\n- Section 5.2: an example without time token will be helpful.\n- Section 5.2: given this approach is close to the ceiling of performance since 93% expressions contain time token, and the system has achieved 92% recall, how do you plan to improve further?\n- Is there any plan to release the full set of rules/software used? "}, "scores": {"overall": "4", "SUBSTANCE": "4", "APPROPRIATENESS": "5", "PRESENTATION_FORMAT": "Oral Presentation", "SOUNDNESS_CORRECTNESS": "4"}, "meta": {"license": "No individual license attached", "REVIEWER_CONFIDENCE": "3", "sentences": {"main": [[0, 74], [74, 167], [167, 301], [301, 426], [426, 524], [524, 638], [638, 651], [651, 692], [692, 818], [818, 819], [819, 833], [833, 931], [931, 954], [954, 976], [976, 1017], [1017, 1076], [1076, 1137], [1137, 1199], [1199, 1391], [1391, 1459]]}}}, {"rid": 1, "reviewer": null, "report": {"main": "The paper proposes a method to recognize time expressions from text. It is a simple rule-based method, which is a strong advantage as an analysis tool since time expression recognition should be a basic process in applications. \nExperiments results show that the proposed method outperforms the state-of-the-art rule-based methods and machine learning based method for time expression recognition.  It is great, but my concern is generality of the method. The rules in the method were designed based on observations of corpora that are used for evaluation as well. Hence I’m afraid that the rules over-fit to these corpora. Similarly, domains of these corpora may have affected the rule design. \nThere is no statistic nor discussion to show overlaps in time expressions in the observed corpora. If it was shown that time expressions in these corpora are mostly overlap, the fact should have supported generality of the rules.  Anyway, it was better that the experiments have been conducted using a new corpus that was distinct from rule design process in order to show that the proposed method is widely effective. "}, "scores": {"overall": "3", "SUBSTANCE": "4", "APPROPRIATENESS": "4", "PRESENTATION_FORMAT": "Poster", "SOUNDNESS_CORRECTNESS": "4"}, "meta": {"license": "No individual license attached", "REVIEWER_CONFIDENCE": "4", "sentences": {"main": [[0, 69], [69, 228], [228, 398], [398, 399], [399, 456], [456, 565], [565, 624], [624, 695], [695, 795], [795, 926], [926, 927], [927, 1115]]}}}]