[{"rid": 0, "reviewer": null, "report": {"main": "Dear Authors thanks for replying to our review comments, which clarifies some detail questions. I appreciate your promise to publish the code, which will be very helpful to other researchers.  Based on this, i increased my overall score to 4.  Strengths: - well-written - extensive experiments - good results - Weaknesses: - nothing ground-breaking, application of existing technologies - code not available - results are as could be expected - General Discussion: - why didn't you use established audio features such as MFCCs?\n- Minor Details: - L155 and other places: a LSTM -> an LSTM - L160, L216 and other Places: why are there hyphens (-) after the text?\n- L205: explanation of convolution is not clear - Table1 should appear earlier, on page 2 already cited - L263: is 3D-CNN a standard approach in video processing? alternatives?\n- L375, 378: the ^ should probably positioned above the y - L380: \"to check overfitting\" -> did you mean \"to avoid\"?\n- L403, 408..: put names in \" \" or write them italic, to make it easier to recognize them - L420: a SVM -> an SVM - L448: Output ... are -> wrong numerus, either \"Outputs\", or use \"is\"  - L489: superflous whitespace after \"layer\" - L516, 519: \"concatenation\" should not be in a new line - L567: why don't you know the exact number of persons?\n- L626: remove comma after Since - L651: doesnt -> does not  - L777: insert \"hand, the\" after other - References: need some cleanup: L823 superflous whitespace, L831 Munich, L860 what is ACL(1)?, L888 superflous ), L894 Volume, L951 superflous new lines, L956 indent Linguistics properly "}, "scores": {"overall": "4", "SUBSTANCE": "4", "APPROPRIATENESS": "5", "PRESENTATION_FORMAT": "Oral Presentation", "SOUNDNESS_CORRECTNESS": "3"}, "meta": {"license": "No individual license attached", "REVIEWER_CONFIDENCE": "3", "sentences": {"main": [[0, 13], [13, 96], [96, 192], [192, 193], [193, 243], [243, 244], [244, 255], [255, 270], [270, 294], [294, 309], [309, 323], [323, 387], [387, 408], [408, 443], [443, 465], [465, 528], [528, 545], [545, 588], [588, 661], [661, 709], [709, 765], [765, 824], [824, 838], [838, 896], [896, 955], [955, 1045], [1045, 1069], [1069, 1141], [1141, 1185], [1185, 1242], [1242, 1298], [1298, 1331], [1331, 1359], [1359, 1398], [1398, 1494], [1494, 1586]]}}}]