[{"rid": 0, "reviewer": null, "report": {"main": "This paper proposes a method for building dialogue agents involved in a symmetric collaborative task, in which the agents need to strategically communicate to achieve a common goal.   I do like this paper.  I am very interested in how much data-driven techniques can be used for dialogue management.  However, I am concerned that the approach that this paper proposes, is actually not specific to symmetric collaborative tasks, but to tasks that can be represented as graph operations, such as finding an intersection between objects that the two people know about.\nIn Section 2.1, the authors introduce symmetric collaborative dialogue setting. \n However, such dialogs have been studied before, such as Clark and Wilkes-Gibbs explored (Cognition '86), and Walker's furniture layout task (Journal of Artificial Research '00).\nOn line 229, the authors say that this domain is too rich for slot-value semantics.  However, their domain is based on attribute value pairs, so their domain could use a semantics represenation based on attribute value-pairs, such as first order logic.\nSection 3.2 is hard to follow.        The authors often refer to Figure 2, but I didn't find this example that helpful.        For example, for section 3.1, at what point of the dialogue does this represent?  Is this the same after `anyone went to columbia?' "}, "scores": {"overall": "3", "SUBSTANCE": "3", "APPROPRIATENESS": "5", "PRESENTATION_FORMAT": "Oral Presentation", "SOUNDNESS_CORRECTNESS": "3"}, "meta": {"license": "No individual license attached", "REVIEWER_CONFIDENCE": "3", "sentences": {"main": [[0, 182], [182, 184], [184, 206], [206, 300], [300, 566], [566, 646], [646, 826], [826, 910], [910, 1079], [1079, 1110], [1110, 1199], [1199, 1287], [1287, 1338]]}}}, {"rid": 1, "reviewer": null, "report": {"main": "This paper presents a novel framework for modelling symmetric collaborative dialogue agents by dynamically extending knowledge graphs embeddings. The task is rather simple: two dialogue agents (bot-bot, human-human or human-bot) talk about their mutual friends. There is an underlying knowledge base for each party in the dialogue and an associated knowledge graph. Items in the knowledge graph have embeddings that are dynamically updated during the conversation and used to generate the answers.\n- Strengths: This model is very novel for both goal-directed and open ended dialogue. The presented evaluation metrics show clear advantage for the presented model.\n- Weaknesses: In terms of the presentation, mathematical details of how the embeddings are computed are not sufficiently clear. While the authors have done an extensive evaluation, they haven't actually compared the system with an RL-based dialogue manager which is current state-of-the-art in goal-oriented systems. Finally, it is not clear how this approach scales to more complex problems. The authors say that the KB is 3K, but actually what the agent operates is about 10 (judging from Table 6).\n- General Discussion: Overall, I think this is a good paper. Had the theoretical aspects of the paper been better presented I would give this paper an accept. "}, "scores": {"overall": "3", "SUBSTANCE": "4", "APPROPRIATENESS": "5", "PRESENTATION_FORMAT": "Poster", "SOUNDNESS_CORRECTNESS": "3"}, "meta": {"license": "No individual license attached", "REVIEWER_CONFIDENCE": "4", "sentences": {"main": [[0, 146], [146, 262], [262, 366], [366, 498], [498, 584], [584, 663], [663, 791], [791, 980], [980, 1056], [1056, 1164], [1164, 1225], [1225, 1323]]}}}]