[{"rid": 0, "reviewer": null, "report": {"main": "# Summary This paper presents an empirical study to identify a latent dimension of sentiment in word embeddings.\n# Strengths  S1) Tackles a challenging problem of unsupervised sentiment analysis.\n S2) Figure 2, in particular, is a nice visualisation.\n# Weaknesses  W1) The experiments, in particular, are very thin. I would recommend also measuring F1 performance and expanding the number of techniques compared.\n W2) The methodology description needs more organisation and elaboration. The ideas tested are itemised, but insufficiently justified.   W3) The results are quite weak in terms of the reported accuracy and depth of analysis. Perhaps this work needs more development, particularly with validating the central assumption that the Distributional Hypothesis implies that opposite words, although semantically similar, are separated well in the vector space? "}, "scores": {"overall": "1", "SUBSTANCE": "1", "APPROPRIATENESS": "5", "PRESENTATION_FORMAT": "Poster", "SOUNDNESS_CORRECTNESS": "3"}, "meta": {"license": "No individual license attached", "REVIEWER_CONFIDENCE": "2", "sentences": {"main": [[0, 10], [10, 113], [113, 125], [125, 196], [196, 251], [251, 264], [264, 316], [316, 413], [413, 487], [487, 548], [548, 549], [549, 638], [638, 867]]}}}, {"rid": 1, "reviewer": null, "report": {"main": "- Strengths This paper deals with the issue of finding word polarity orientation in an unsupervised manner, using word embeddings.\n- Weaknesses The paper presents an interesting and useful idea, however, at this moment, it is not applied to any test case. The ideas on which it is based are explained in an \"intuitive\" manner and not thoroughly justified.  - General Discussion This is definitely interesting work. The paper would benefit from more experiments being carried out, comparison with other methods (for example, the use of the Normalized Google Distance by authors such as (Balahur and Montoyo, 2008) - http://ieeexplore.ieee.org/abstract/document/4906796/) and the application of the knowledge obtained to a real sentiment analysis scenario. At this point, the work, although promising, is in its initial phase. "}, "scores": {"overall": "2", "SUBSTANCE": "2", "APPROPRIATENESS": "5", "PRESENTATION_FORMAT": "Poster", "SOUNDNESS_CORRECTNESS": "3"}, "meta": {"license": "No individual license attached", "REVIEWER_CONFIDENCE": "5", "sentences": {"main": [[0, 131], [131, 256], [256, 356], [356, 357], [357, 415], [415, 755], [755, 825]]}}}]