[{"rid": 0, "reviewer": null, "report": {"main": "- Strengths: - this article puts two fields together: text readability for humans and machine comprehension of texts - Weaknesses: - The goal of your paper is not entirely clear. I had to read the paper 4 times and I still do not understand what you are talking about!\n- The article is highly ambiguous what it talks about - machine comprehension or text readability for humans - you miss important work in the readability field - Section 2.2. has completely unrelated discussion of theoretical topics.\n- I have the feeling that this paper is trying to answer too many questions in the same time, by this making itself quite weak. Questions such as “does text readability have impact on RC datasets” should be analyzed separately from all these prerequisite skills.\n- General Discussion: - The title is a bit ambiguous, it would be good to clarify that you are referring to machine comprehension of text, and not human reading comprehension, because “reading comprehension” and “readability” usually mean that.\n- You say that your “dataset analysis suggested that the readability of RC datasets does not directly affect the question difficulty”, but this depends on the method/features used for answer detection, e.g. if you use POS/dependency parse features.\n- You need to proofread the English of your paper, there are some important omissions, like “the question is easy to solve simply look..” on page 1.\n- How do you annotate datasets with “metrics”??\n- Here you are mixing machine reading comprehension of texts and human reading comprehension of texts, which, although somewhat similar, are also quite different, and also large areas.\n- “readability of text” is not “difficulty of reading contents”. Check this: DuBay, W.H. 2004. The Principles of Readability. Costa Mesa, CA: Impact information.  - it would be good if you put more pointers distinguishing your work from readability of questions for humans, because this article is highly ambiguous. \nE.g. on page 1 “These two examples show that the readability of the text does not necessarily correlate with the difficulty of the questions” you should add “for machine comprehension” - Section 3.1. - Again: are you referring to such skills for humans or for machines? If for machines, why are you citing papers for humans, and how sure are you they are referring to machines too?\n- How many questions the annotators had to annotate? Were the annotators clear they annotate the questions keeping in mind machines and not people? "}, "scores": {"overall": "4", "SUBSTANCE": "4", "APPROPRIATENESS": "4", "PRESENTATION_FORMAT": "Oral Presentation", "SOUNDNESS_CORRECTNESS": "4"}, "meta": {"license": "No individual license attached", "REVIEWER_CONFIDENCE": "3", "sentences": {"main": [[0, 13], [13, 117], [117, 131], [131, 179], [179, 269], [269, 378], [378, 429], [429, 444], [444, 503], [503, 631], [631, 766], [766, 788], [788, 1011], [1011, 1260], [1260, 1409], [1409, 1457], [1457, 1642], [1642, 1707], [1707, 1737], [1737, 1768], [1768, 1804], [1804, 1805], [1805, 1958], [1958, 2144], [2144, 2161], [2161, 2229], [2229, 2341], [2341, 2394], [2394, 2489]]}}}]