[{"rid": 0, "reviewer": null, "report": {"main": "- General Discussion: This paper extends Zhou and Xu's ACL 2015 approach to semantic role labeling based on deep BiLSTMs. In addition to applying recent best practice techniques, leading to further quantitative improvements, the authors provide an insightful qualitative analysis of their results. The paper is well written and has a clear structure. The authors provide a comprehensive overview of related work and compare results to a representative set of other SRL models that hace been applied on the same data sets.\nI found the paper to be interesting and convincing. It is a welcome research contribution that not only shows that NNs work well, but also analyzes merits and shortcomings of an end-to-end learning approach.\n- Strengths: Strong model, insightful discussion/error analysis.\n- Weaknesses: Little to no insights regarding the SRL task itself. "}, "scores": {"overall": "4", "SUBSTANCE": "4", "APPROPRIATENESS": "5", "PRESENTATION_FORMAT": "Oral Presentation", "SOUNDNESS_CORRECTNESS": "3"}, "meta": {"license": "No individual license attached", "REVIEWER_CONFIDENCE": "5", "sentences": {"main": [[0, 22], [22, 122], [122, 298], [298, 351], [351, 522], [522, 574], [574, 730], [730, 743], [743, 795], [795, 809], [809, 862]]}}}, {"rid": 1, "reviewer": null, "report": {"main": "This paper presents a new state-of-the-art deep learning model for semantic role labeling (SRL) that is a natural extension of the previous state-of-the-art system (Zhou and Xu, 2015) with recent best practices for initialization and regularization in the deep learning literature. \nThe model gives a 10% relative error reduction which is a big gain on this task. The paper also gives in-depth empirical analyses to reveal the strengths and the remaining issues, that give a quite valuable information to the researchers in this field.  Even though I understand that the improvement of 3 point in F1 measure is a quite meaningful result from the engineering point of view, I think the main contribution of the paper is on the extensive analysis in the experiment section and a further in-depth investigation on analysis section. The detailed analyses shown in Section 4 are performed in a quite reasonable way and give both comparable results in SRL literature and novel information such as relation between accuracies in syntactic parsing and SRL. This type of analysis had often been omitted in recent papers. However, it is definitely important for further improvement.\nThe paper is well-written and well-structured. \nI really enjoyed the paper and would like to see it accepted. "}, "scores": {"overall": "4", "SUBSTANCE": "5", "APPROPRIATENESS": "5", "PRESENTATION_FORMAT": "Oral Presentation", "SOUNDNESS_CORRECTNESS": "3"}, "meta": {"license": "No individual license attached", "REVIEWER_CONFIDENCE": "5", "sentences": {"main": [[0, 282], [282, 364], [364, 536], [536, 537], [537, 829], [829, 1049], [1049, 1112], [1112, 1173], [1173, 1220], [1220, 1283]]}}}]