[{"rid": 0, "reviewer": null, "report": {"main": "- Strengths: Detailed guidelines and explicit illustrations.\n- Weaknesses: The document-independent crowdsourcing annotation is unreliable.  - General Discussion: This work creates a new benchmark corpus for concept-map-based MDS. It is well organized and written clearly. The supplement materials are sufficient. I have two questions here. \n1)              Is it necessary to treat concept map extraction as a separate task? \nOn the one hand, many generic summarization systems build a similar knowledge graph and then generate summaries accordingly. On the other hand, with the increase of the node number, the concept map becomes growing hard to distinguish. Thus, the general summaries should be more readable. \n2)              How can you determine the importance of a concept independent of the documents? The definition of summarization is to reserve the main concepts of documents. Therefore, the importance of a concept highly depends on the documents. For example, in the given topic of coal mining accidents, assume there are two concepts: A) an instance of coal mining accidents and B) a cause of coal mining accidents. Then, if the document describes a series of coal mining accidents, A is more important than B. In comparison, if the document explores why coal mining accidents happen, B is more significant than A. Therefore, just given the topic and two concepts A&B, it is impossible to judge their relative importance.\nI appreciate the great effort spent by authors to build this dataset. However, this dataset is more like a knowledge graph based on common sense rather than summary. "}, "scores": {"overall": "3", "SUBSTANCE": "3", "APPROPRIATENESS": "5", "PRESENTATION_FORMAT": "Poster", "SOUNDNESS_CORRECTNESS": "5"}, "meta": {"license": "No individual license attached", "REVIEWER_CONFIDENCE": "5", "sentences": {"main": [[0, 13], [13, 61], [61, 75], [75, 140], [140, 141], [141, 163], [163, 231], [231, 273], [273, 314], [314, 341], [341, 426], [426, 552], [552, 662], [662, 715], [715, 812], [812, 890], [890, 962], [962, 1132], [1132, 1438], [1438, 1508], [1508, 1604]]}}}, {"rid": 1, "reviewer": null, "report": {"main": "Strengths: This paper presents an approach to creating concept maps using crowdsourcing. \nThe general ideas are interesting and the main contribution lies in the collection of the dataset. As such, I imagine that the dataset will be a valuable resource for further research in this field. Clearly a lot of effort has gone into this work.\nWeaknesses: Overall I felt this paper a bit overstated in placed. As an example, the authors claim a new crowdsourcing scheme as one of their contributions. This claims is quite strong though and it reads more like the authors are applying best practice in crowdsourcing to their work. This isn’t a novel methods then, it’s rather a well thought and sound application of existing knowledge.\nSimilarly, the authors claim that they develop and present a new corpus. This seems true and I can see how a lot of effort was invested in its preparation, but then Section 4.1 reveals that actually this is based on an existing dataset.  This is more a criticism of the presentation than the work though.\nGeneral discussion: Where do the summary sentences come from for the crowdsource task? Aren’t they still quite subjective?\nWhere do the clusters come from? Are they part of the TAC2008b dataset?  In 4.6 expert annotators are used to create the gold standard concept maps. \nMore information is needed in this section I would say as it seems to be quite crucial. How were they trained, what made them experts? "}, "scores": {"overall": "3", "SUBSTANCE": "4", "APPROPRIATENESS": "5", "PRESENTATION_FORMAT": "Poster", "SOUNDNESS_CORRECTNESS": "5"}, "meta": {"license": "No individual license attached", "REVIEWER_CONFIDENCE": "2", "sentences": {"main": [[0, 11], [11, 89], [89, 189], [189, 289], [289, 338], [338, 350], [350, 404], [404, 495], [495, 624], [624, 729], [729, 802], [802, 966], [966, 967], [967, 1034], [1034, 1054], [1054, 1121], [1121, 1157], [1157, 1190], [1190, 1229], [1229, 1230], [1230, 1306], [1306, 1395], [1395, 1442]]}}}]