[{"rid": 0, "reviewer": null, "report": {"main": "The paper describes an idea to learn phrasal representation and facilitate them in RNN-based language models and neural machine translation -Strengths: The  idea to incorporate phrasal information into the task is interesting.\n- Weaknesses: - The description is hard to follow. Proof-reading by an English native speaker would benefit the understanding - The evaluation of the approach has several weaknesses - General discussion - In Equation 1 and 2 the authors mention a phrase representation give a fix-length word embedding vector. But this is not used in the model. The representation is generated based on an RNN. What the propose of this description?\n- Why are you using GRU for the Pyramid and LSTM for the sequential part? Is the combination of two architectures a reason for your improvements?\n- What is the simplified version of the GRU? Why is it performing better? How is it performing on the large data set?\n- What is the difference between RNNsearch (groundhog) and RNNsearch(baseline) in Table 4?\n-  What is the motivation for only using the ending phrases and e.g. not using the starting phrases?\n- Did you use only the pyramid encoder? How is it performing? That would be a more fair comparison since it normally helps to make the model more complex.\n- Why did you run RNNsearch several times, but PBNMT only once?\n- Section 5.2: What is the intent of this section "}, "scores": {"overall": "2", "SUBSTANCE": "4", "APPROPRIATENESS": "5", "PRESENTATION_FORMAT": "Poster", "SOUNDNESS_CORRECTNESS": "5"}, "meta": {"license": "No individual license attached", "REVIEWER_CONFIDENCE": "4", "sentences": {"main": [[0, 140], [140, 152], [152, 227], [227, 241], [241, 278], [278, 353], [353, 409], [409, 430], [430, 537], [537, 572], [572, 621], [621, 659], [659, 733], [733, 805], [805, 850], [850, 879], [879, 923], [923, 1014], [1014, 1115], [1115, 1155], [1155, 1177], [1177, 1270], [1270, 1334], [1334, 1384]]}}}, {"rid": 1, "reviewer": null, "report": {"main": "This paper proposed a new phrasal RNN architecture for sequence to sequence generation. They have evaluated their architecture based on (i) the language modelling test evaluated on PTB and FBIS and (ii) Chinese-English machine translation task on NIST MT02-08 evaluation sets. The phrasal RNN (pRNN) architecture is achieved by generating subnetworks of phrases.  Strengths ==== A new phrasal architecture.  Weaknesses ==== **Technical**:  It's unclear whether there is a limit set  on the phrase length of the pRNN. \nMaybe I've missed this in the paper, if there is, please be more explicit about it because it affects the model quite drastically if for every sentence the largest phrase length is the sentence length.   - It's because if the largest phrase length is the sentence length, then model can be simplified into a some sort of convolution RNN where the each state of the RNN goes through some convolution layer before a final softmax and attention.   - If there is a limit set on the phrase length of pRNN, then it makes the system more tractable. But that would also mean that the phrases are determined by token ngrams which produces a sliding window of the \"pyramid encoders\" for each sentence where there are instance where the parameter for these phrases will be set close to zero to disable the phrases and these phrases would be a good intrinsic evaluation of the pRNN in addition to evaluating it purely on perplexity and BLEU extrinsically.  The usage of attention mechanism without some sort of pruning might be problematic at the phrasal level. The author have opted for some sort of greedy pruning as described in the caption of figure 4. But I support given a fixed set of phrase pairs at train time, the attention mechanism at the phrasal level can be pre-computed but at inference (apply the attention on new data at test time), this might be kind of problematic when the architecture is scaled to a larger dataset.  **Empirical**:  One issue with the language modelling experiment is the choice of evaluation and train set. Possibly a dataset like common crawl or enwiki8 would be more appropriate for language modelling experiments.  The main issue of the paper is in the experiments and results reporting, it needs quite a bit of reworking.   - The evaluation on PTB (table 2) isn't a fair one since the model was trained on a larger corpus (FBIS) and then tested on PTB. The fact that the previous study reported a 126 perplexity baseline using LSTM and the LSTM's perplexity of 106.9 provided by the author showed that the FBIS gives an advantage to computing the language model's perplexity when tested on PTB.\n - Also, regarding section 3.3, please cite appropriate publications the \"previous work\" presented in the tables. And are the previous work using the same training set?  - Additionally, why isn't the the GRU version of pRNNv reported in the FBIS evaluation in Table 3?\nThe result section cannot be simply presenting a table without explanation:  - Still on the result sections, although it's clear that BLEU and perplexity are objective automatic measure to evaluate the new architecture. It's not really okay to put up the tables and show the perplexity and BLEU scores without some explanation. E.g. in Table 2, it's necessary to explain why the LSTM's perplexity from previous work is higher than the author's implementation. Same in Table 3.  The result presented in Table 4 don't match the description in Section 4.3:  - It's not true that the pRNN outperforms both PBSMT and Enc-Dec model. The authors should make it clear that on different evaluation sets, the scores differs. And it's the averaged test scores that pRNN performs better - Please also make it clear whether the \"Test Avg.\" is a micro-average (all testsets are concatenated and evaluated as one set) or macro-average (average taken across the scores of individual test sets) score.  For table 4, please also include the significance of the BLEU improvement made by the pRNN with respect to the the baseline, see https://github.com/jhclark/multeval General Discussion ==== As the main contribution of this work is on the phrasal effect of the new RNN architecture, it's rather important to show that the phrases are more coherent than the vanilla LSTM / RNN model. Thus the BLEU evaluation is insufficient. A closer look at evaluating the phrases in a subset of the evaluation set would be necessary to support the claims.  Does the baseline system (groundhog) contains the attention mechanism?   - If so, please be more specific in describing it in section 4.2 and Table 4.   - If not, please remove the attention layer after the encoder in figure 5. \nAlso, the lack of attention mechanism provides a disadvantage to the baseline enc-dec system and it's unclear whether the pRNN can outperform or be an additive feature to the enc-dec system with an attention mechanism. The unfair disadvantage is even more prevalent when the pRNN uses multiple phrasal attention layers within a single sentence while a simple enc-dec system without attention is used as a benchmark =( Question: Wouldn't a simpler way to get phrasal RNN is to put the \"pyramid\" RNNs of a phrase into some soft of a average pooling layer?\nMinor Issues  ==== Figure 2 is a little redundant, I think figure 1 is enough to compare it against the pRNN (figure3 and 4).\nAlso, possibly figure 3 can be combined into the pyramid part of figure 4. And more space can be freed up to further explain the results section.  Please don't abuse figure/table captions, whenever possible, please try to keep the description of the tables and figures in-text.   **Please put the verbose caption description in the main text for Figure 3, 4, 5 and Table 4** Spacing in between some of the equations can also be reduced (e.g. in latex use \\vspace{-5mm} ) "}, "scores": {"overall": "2", "SUBSTANCE": "2", "APPROPRIATENESS": "5", "PRESENTATION_FORMAT": "Poster", "SOUNDNESS_CORRECTNESS": "5"}, "meta": {"license": "No individual license attached", "REVIEWER_CONFIDENCE": "3", "sentences": {"main": [[0, 88], [88, 277], [277, 363], [363, 364], [364, 379], [379, 407], [407, 408], [408, 424], [424, 440], [440, 517], [517, 720], [720, 721], [721, 961], [961, 962], [962, 1060], [1060, 1462], [1462, 1463], [1463, 1568], [1568, 1663], [1663, 1943], [1943, 1944], [1944, 1960], [1960, 2052], [2052, 2162], [2162, 2163], [2163, 2271], [2271, 2272], [2272, 2402], [2402, 2644], [2644, 2758], [2758, 2813], [2813, 2814], [2814, 2913], [2913, 2989], [2989, 3133], [3133, 3241], [3241, 3373], [3373, 3390], [3390, 3391], [3391, 3467], [3467, 3540], [3540, 3628], [3628, 3688], [3688, 3740], [3740, 3898], [3898, 3899], [3899, 4064], [4064, 4088], [4088, 4280], [4280, 4322], [4322, 4438], [4438, 4439], [4439, 4510], [4510, 4511], [4511, 4590], [4590, 4591], [4591, 4667], [4667, 4887], [4887, 5086], [5086, 5222], [5222, 5241], [5241, 5348], [5348, 5423], [5423, 5494], [5494, 5495], [5495, 5626], [5626, 5628], [5628, 5723], [5723, 5819]]}}}]