[{"rid": 0, "reviewer": null, "report": {"main": "Thanks for the response. I look forward to reading about the effect of incentives and the ambiguity of the language in the domain.\nReview before author response: The paper proposes a way to build natural language interfaces by allowing a set of users to define new concepts and syntax. It's an (non-trivial) extension of S. I. Wang, P. Liang, and C. Manning. 2016. Learning language games through interaction Questions: - What is the size of the vocabulary used  - Is it possible to position this paper with respect to previous work on inverse reinforcement learning and imitation learning ?\nStrengths: - The paper is well written - It provides a compelling direction/solution to the problem of dealing with a large set of possible programs while learning natural language interfaces.  Weaknesses: - The authors should discuss the effect of the incentives on the final performance ? Were other alternatives considered ?  - While the paper claims that the method can be extended to more practical domains, it is not clear to me how straightforward it is going to be. How sensitive is the method to the size of the vocabulary required in a domain ? \nWould increased ambiguity in natural language create new problems ? These questions are not discussed in the current experiments.\n- A real-world application would definitely strengthen the paper even more. "}, "scores": {"overall": "4", "SUBSTANCE": "4", "APPROPRIATENESS": "5", "PRESENTATION_FORMAT": "Oral Presentation", "SOUNDNESS_CORRECTNESS": "3"}, "meta": {"license": "No individual license attached", "REVIEWER_CONFIDENCE": "4", "sentences": {"main": [[0, 25], [25, 131], [131, 286], [286, 359], [359, 365], [365, 409], [409, 420], [420, 463], [463, 592], [592, 603], [603, 631], [631, 785], [785, 786], [786, 798], [798, 883], [883, 920], [920, 921], [921, 1066], [1066, 1147], [1147, 1216], [1216, 1278], [1278, 1354]]}}}, {"rid": 1, "reviewer": null, "report": {"main": "- Strengths: This paper reports on an interesting project to enable people to design their own language for interacting with a computer program, in place of using a programming language. The specific construction that the authors focus on is the ability for people to make definitions. Very nicely, they can make recursive definitions to arrive at a very general way of giving a command. The example showing how the user could generate definitions to create a palm tree was motivating. The approach using learning of grammars to capture new cases seems like a good one.  - Weaknesses: This seems to be an extension of the ACL 2016 paper on a similar topic. It would be helpful to be more explicit about what is new in this paper over the old one.  There was not much comparison with previous work: no related work section.  The features for learning are interesting but it's not always clear how they would come into play. For example, it would be good to see an example of how the social features influenced the outcome. I did not otherwise see how people work together to create a language.  - General Discussion: "}, "scores": {"overall": "4", "SUBSTANCE": "4", "APPROPRIATENESS": "5", "PRESENTATION_FORMAT": "Oral Presentation", "SOUNDNESS_CORRECTNESS": "3"}, "meta": {"license": "No individual license attached", "REVIEWER_CONFIDENCE": "4", "sentences": {"main": [[0, 187], [187, 286], [286, 388], [388, 486], [486, 570], [570, 571], [571, 657], [657, 747], [747, 748], [748, 823], [823, 824], [824, 923], [923, 1022], [1022, 1093], [1093, 1094], [1094, 1116]]}}}, {"rid": 2, "reviewer": null, "report": {"main": "- Strengths: The ideas and the task addressed in this paper are beautiful and original. \nCombining indirect supervision (accepting the resulting parse) with direct supervision (giving a definition) makes it a particularly powerful way of interactively building a natural language interface to a programming language. \nThe proposed has a wide range of potential applications.  - Weaknesses: The paper has several typos and language errors and some text seems to be missing from the end of section 6. It could benefit from careful proofreading by a native English speaker.  - General Discussion: The paper presents a method for collaborative naturalization of a 'core' programming language by a community of users through incremental expansion of the syntax of the language. This expansion is performed interactively, whereby a user just types a command in the naturalized language, and then either selects through a list of candidate parses or provides a definition also in the natural language. The users give intuitive definitions using literals instead of variables (e.g. \"select orange\"), which makes this method applicable to non-programmers. \nA grammar is induced incrementally which is used to provide the candidate parses.\nI have read the authors' response. "}, "scores": {"overall": "4", "SUBSTANCE": "4", "APPROPRIATENESS": "5", "PRESENTATION_FORMAT": "Oral Presentation", "SOUNDNESS_CORRECTNESS": "3"}, "meta": {"license": "No individual license attached", "REVIEWER_CONFIDENCE": "3", "sentences": {"main": [[0, 13], [13, 88], [88, 317], [317, 375], [375, 376], [376, 390], [390, 499], [499, 571], [571, 572], [572, 594], [594, 773], [773, 995], [995, 1147], [1147, 1230], [1230, 1265]]}}}]