[{"rid": 0, "reviewer": null, "report": {"main": "- Strengths: Useful modeling contribution, and potentially useful annotated data, for an important problem -- event extraction for the relationships between countries as expressed in news text.\n- Weaknesses: Many points are not explained well in the paper.  - General Discussion: This work tackles an important and interesting event extraction problem -- identifying positive and negative interactions between pairs of countries in the world (or rather, between actors affiliated with countries).  The primary contribution is an application of supervised, structured neural network models for sentence-level event/relation extraction.  While previous work has examined tasks in the overall area, to my knowledge there has not been any publicly availble sentence-level annotated data for the problem -- the authors here make a contribution as well by annotating some data included with the submission; if it is released, it could be useful for future researchers in this area.\nThe proposed models -- which seem to be an application of various tree-structured recursive neural network models -- demonstrate a nice performance increase compared to a fairly convincing, broad set of baselines (if we are able to trust them; see below).  The paper also presents a manual evaluation of the inferred time series from a news corpus which is nice to see.\nI'm torn about this paper.  The problem is a terrific one and the application of the recursive models seems like a contribution to this problem. \nUnfortunately, many aspects of the models, experimentation, and evaluation are not explained very well.  The same work, with a more carefully written paper, could be really great.\nSome notes: - Baselines need more explanation.  For example, the sentiment lexicon is not explained for the SVM.                    The LSTM classifier is left highly unspecified (L407-409) -- there are multiple different architectures to use an LSTM for classification.  How was it trained?  Is there a reference for the approach? \nAre the authors using off-the-shelf code (in which case, please refer and cite, which would also make it easier for the reader to understand and replicate if necessary)?  It would be impossible to replicate based on the two-line explanation here.   - (The supplied code does not seem to include the baselines, just the recursive NN models.  It's great the authors supplied code for part of the system so I don't want to penalize them for missing it -- but this is relevant since the paper itself has so few details on the baselines that they could not really be replicated based on the explanation in the paper.)\n- How were the recursive NN models trained?\n- The visualization section is only a minor contribution; there isn't really any innovation or findings about what works or doesn't work here.\nLine by line: L97-99: Unclear. Why is this problem difficult?  Compared to what? ( also the sentence is somewhat ungrammatical...) L231 - the trees are binarized, but how?\nFootnote 2 -- \"the tensor version\" - needs citation to explain what's being referred to.\nL314: How are non-state verbs defined?                    Does the definition of \"event word\"s here come from any particular previous work that motivates it?                    Please refer to something appropriate or related.\nFootnote 4: of course the collapsed form doesn't work, because the authors aren't using dependency labels -- the point of stanford collapsed form is to remove prepositions from the dependeny path and instead incorporate them into the labels.\nL414: How are the CAMEO/TABARI categories mapped to positive and negative entries?  Is performance sensitive to this mapping?  It seems like a hard task (there are hundreds of those CAMEO categories....) Did the authors consider using the Goldstein scaling, which has been used in political science, as well as the cited work by O'Connor et al.?  Or is it bad to use for some reason?\nL400-401: what is the sentiment lexicon and why is it appropriate for the task?\nL439-440: Not clear.  \"We failed at finding an alpha meeting the requirements for the FT model.\"  What does that mean? What are the requirements? What did the authors do in their attempt to find it?\nL447,L470: \"precision and recall values are based on NEG and POS classes\". \nWhat does this mean?  So there's a 3x3 contingency table of gold and predicted (POS, NEU, NEG) classes, but this sentence leaves ambiguous how precision and recall are calculated from this information.\n5.1 aggregations: this seems fine though fairly ad-hoc.  Is this temporal smoothing function a standard one?  There's not much justification for it, especially given something simpler like a fixed window average could have been used.\n5.2 visualizations: this seems pretty ad-hoc without much justification for the choices.  The graph visualization shown does not seem to illustrate much. \nShould also discuss related work in 2d spatial visualization of country-country relationships by Peter Hoff and Michael Ward.\n5.3 L638-639: \"unions of countries\" isn't a well defined concept.  mMybe the authors mean \"international organizations\"?\nL646-648: how were these 5 strong and 5 weak peaks selected?  In particular, how were they chosen if there were more than 5 such peaks?\nL680-683: This needs more examples or explanation of what it means to judge the polarity of a peak.  What does it look like if the algorithm is wrong?                    How hard was this to assess?  What was agreement rate if that can be judged?\nL738-740: The authors claim Gerrish and O'Connor et al. have a different \"purpose and outputs\" than the authors' work.  That's not right.  Both those works try to do both (1) extract time series or other statistical information about the polarity of the relationships between countries, and *also* (2) extract topical keywords to explain aspects of the relationships.  The paper here is only concerned with #1 and less concerned with #2, but certainly the previous work addresses #1.  It's fine to not address #2 but this last sentence seems like a pretty odd statement.\nThat raises the question -- Gerrish and O'Connor both conduct evaluations with an external database of country relations developed in political science (\"MID\", military interstate disputes).              Why don't the authors of this work do this evaluation as well?  There are various weaknesses of the MID data, but the evaluation approach needs to be discussed or justified. "}, "scores": {"overall": "2", "SUBSTANCE": "4", "APPROPRIATENESS": "5", "PRESENTATION_FORMAT": "Poster", "SOUNDNESS_CORRECTNESS": "5"}, "meta": {"license": "No individual license attached", "REVIEWER_CONFIDENCE": "4", "sentences": {"main": [[0, 194], [194, 257], [257, 258], [258, 280], [280, 497], [497, 635], [635, 976], [976, 1232], [1232, 1346], [1346, 1373], [1373, 1491], [1491, 1596], [1596, 1672], [1672, 1684], [1684, 1719], [1719, 1785], [1785, 1943], [1943, 1964], [1964, 2004], [2004, 2175], [2175, 2252], [2252, 2254], [2254, 2345], [2345, 2618], [2618, 2662], [2662, 2805], [2805, 2819], [2819, 2836], [2836, 2867], [2867, 2888], [2888, 2936], [2936, 2977], [2977, 3066], [3066, 3105], [3105, 3224], [3224, 3293], [3293, 3535], [3535, 3618], [3618, 3661], [3661, 3881], [3881, 3919], [3919, 3999], [3999, 4020], [4020, 4096], [4096, 4118], [4118, 4145], [4145, 4198], [4198, 4273], [4273, 4295], [4295, 4476], [4476, 4532], [4532, 4585], [4585, 4710], [4710, 4799], [4799, 4864], [4864, 4991], [4991, 5057], [5057, 5112], [5112, 5173], [5173, 5248], [5248, 5348], [5348, 5399], [5399, 5447], [5447, 5495], [5495, 5614], [5614, 5633], [5633, 5863], [5863, 5979], [5979, 6066], [6066, 6257], [6257, 6333], [6333, 6444]]}}}]