{
  "name" : "COLING_2020_36_paper.pdf",
  "metadata" : {
    "source" : "CRF",
    "title" : "Deep Learning Framework for Measuring the Digital Strategy of Companies from Earnings Calls",
    "authors" : [ ],
    "emails" : [ ],
    "sections" : [ {
      "heading" : null,
      "text" : "Companies today are racing to leverage the latest digital technologies, such as artificial intelligence, blockchain, and cloud computing. However, many companies report that their strategies did not achieve the anticipated business results. This study is the first to apply stateof-the-art NLP models on unstructured data to understand the different clusters of digital strategy that companies are Adopting. We achieve this by analyzing earnings calls from Fortune 500 companies between 2015 and 2019. We use Transformer-based architecture for text classification which show a better understanding of the conversation context. We then investigate digital strategy patterns by applying clustering analysis. Our findings suggest that Fortune 500 companies use four distinct strategies which are product-led, customer experienceled, service-led, and efficiency-led. This work provides an empirical baseline for companies and researchers to enhance our understanding of the field."
    }, {
      "heading" : "1 Introduction",
      "text" : "The use of digital technologies is transforming the modern economy with significant implications for businesses. As a result, organizations are perceiving digital technologies to present both growth opportunities and existential threats (Sebastian et al., 2017). Despite efforts to adopt such technologies, research demonstrates that the success rate in improving business performance is very low due to the lack of a coherent digital strategy (World Economic Forum & Bain & Company, 2018). A positive research step to address this challenge is enhancing the understanding of current approaches to digital strategy.\nCorporate documents are increasingly being used to understand the performance of organizations for various purposes. Examples are, predicting expected returns from financial reports (Theil et al., 2019) and measuring compliance from sustainability reports (Smeuninx et al., 2020).\nIn the present study, we use earnings calls transcripts, as they provide rich insights into companies’ activities, specifically on their digital strategy. We quantify the approach taken by companies based on the progress made on the following three components related to the digital strategy (Vial, 2019): • Business value: the expressed value of using a specific digital solution (e.g., enhancing customer\nexperience and increasing operational efficiency) • Strategy management: the policies and practices in place to support the implementation of digital\nsolutions (e.g., setup of innovation lab, acquisition of startups, and use of agile methods) • Digital technology: the technology used as a part of the identified digital solution (e.g., artificial\nintelligence, Internet of things, and robotics) In this work, we offer two contributions. First, we set the baseline for using deep learning based NLP models to measure the digital strategy of companies from earnings calls transcripts. Second, we apply this framework to investigate the digital strategy of Fortune 500 companies."
    }, {
      "heading" : "2 Related Work",
      "text" : "There have been a few recommendations for the digital strategy to be customer focused, product focused (Sebastian et al., 2017), or business model focused (Vial, 2019). However, an empirical investigation of digital strategy archetypes is still needed (Tekic & Koroteev, 2019).\nA few NLP-driven publications have investigated the digital strategy of companies. This included network analytics of website tags (Stoehr et al., 2019), document clustering of companies’ description (Riasanow et al., 2020), and keyword analysis of financial reports (Pramanik et al., 2019). While all these studies revealed insights into the digital strategy of companies, they were exploratory in nature with limited quantitative evaluation of digital strategy components.\nEarnings calls transcripts are known to be rich data sources and even contain more information than company filing (Frankel et al., 1999). Moreover, they can be leveraged for text classification to identify decisions and activities that companies take (Keith & Stent, 2019). Therefore, we propose text classification of digital strategy related topics from earnings calls transcripts as detailed in Section 3."
    }, {
      "heading" : "3 Methodology",
      "text" : "There is no generic framework to measure company performance, as it can be topic specific. Measuring digital strategy retrospectively is accomplished by identifying the progress made on its components, also known as digital maturity (Gurbaxani & Dunkle, 2019). From an NLP perspective, this requires identifying topics of interest in the text, followed by assigning a maturity score to it. The closest text classification task to this is aspect-based sentiment analysis, which is proven to be effective for mining aspects related to customers’ opinions (Jiang et al., 2019). Therefore, we adapt this task to measure companies’ digital strategy and refer to it as Aspect-based Maturity Analysis (ABMA).\nIn this case, we propose Aspects that refer to 17 coarse-grained topics from the three components of digital strategy presented in the introduction (business value [4 aspects], strategy management [2 aspects], and digital technology [11 aspects]). We find multi-label classification suitable as the labels are not mutually exclusive. Maturity, on the other hand, refers to the progress made with a given aspect over four discrete steps, including (1) plan, (2) pilot, (3) release, and (4) pioneer (EY & Microsoft, 2019). We propose the use of multi-class classification given that maturity runs on a discrete scale. Model labels are shown in Table 1. See Appendix B for the list of labels definitions. The following is an example of the classification process from the earnings calls dataset: TEXT: “We’re putting most of our efforts right now—are continuing to—into our robotics program. We think it’s been a great addition to our fulfillment capacity.” {Aspects: [robotics, operations], Maturity: released (3)} Task Labels\nAspect\nBusiness Value: digital products, digital customer experience, digital operations, digital business model Strategy Management: strategy enablers, strategy practices Digital technologies: AI, analytics, Internet of things, blockchain, cloud computing, mobile, social media, robotics, augmented reality, virtual reality, 3D printing\nMaturity Plan, Pilot, Release, Pioneer"
    }, {
      "heading" : "4 Experiment Setup",
      "text" : "The objective of the experiment is to demonstrate the utility of ABMA in measuring the digital strategy of Fortune 500 companies using earnings calls transcripts. The process included pre-processing and structuring the text, filtering irrelevant content, classifying the text, and aggregating the results to the company level. We then clustered the results in Section 5 to identify common digital strategy patterns."
    }, {
      "heading" : "4.1 Data and Pre-processing",
      "text" : "We chose Fortune’s Global 500 companies as a suitable sample based on their diversity and scale of digital activities (Fortune.com, 2019). Our data consists of 4,911 earnings calls transcripts for 304 companies covering the five years between January 1, 2015 and December 31, 2019. 195 companies were excluded due to missing or inconsistent data from the source. The data was then tabularized with features, including company name, ticker symbol, date of call, and call transcript.\nTable 1: Labels description for Aspect and Maturity classification.\nPerforming sentence-level splitting resulted in approximately 3.2 million sentences. We conducted a keyword search to select relevant sentences and maintain a dense dataset. The keywords included 275 domain-specific terms1 from the 17 topics related to the three digital strategy components. This resulted in 46,277 sentences showing that around 1.46% of earning calls discussions are digital related. We also added previous and following sentences to capture sufficient context. We refer to each text block as a document."
    }, {
      "heading" : "4.2 Text Classification",
      "text" : "Based on the proposed approach, we designed two-stage text classification architectures. The first model is multi-label to detect the occurrence of an aspect in a document, whereas the second model assigns a maturity class to it2. As an experiment, we hand-annotated 1,300 examples from a random sample on aspects and their respective maturity levels as shown by the illustrative example in Section 3. We split the labeled data to 80/10/10 between training, validation, and testing respectively.\nGiven the absence of a benchmark, we compared the performance of several text classification models, including transformer architecture. We trained the transformer models by applying a discriminative learning rate to maximize the utilization of the language model pre-training (Howard & Ruder, 2018). We found that RoBERTa (Liu et al., 2019) performed best without language model fine-tuning, as shown in Table 2. The main difference was that RoBERTa was able to achieve higher accuracy on scarce labels. Moreover, we found RoBERTa to generalize better based on context with unseen terminologies. The qualitative evaluation of the output showed reasonable performance based on the training dataset size, in which errors were commonly attributed to imprecisely expressed sentences."
    }, {
      "heading" : "4.3 Processing Output",
      "text" : "Using the described text classification approach, we detected 61,872 aspect occurrences in 27,198 documents on 295 companies. This shows that 58.7% of the filtered dataset referred to a specific digital strategyrelated activity by the company.\nTo aggregate results from the documents to the company level, we applied several transformation steps. First, we one-hot encoded all the aspects to obtain a binary feature vector. Second, we multiplied each vector of a document with its respective maturity class (1–4).\nDifferentiating companies that exhibit multiple maturity levels of an aspect in the same year was important. Taking a weighted average was penalizing companies for simultaneous maturity levels. Therefore, we treat the maturity of an aspect as a checklist, in which the score is calculated by summing each identified maturity class within the same year for a given aspect. We then calculated the mean across the five years, which resulted in a maturity score between 0 and 10 for each aspect. As a result, the dataset was a matrix of 295 companies × 18 features (17 aspects-maturity scores + mean maturity)."
    }, {
      "heading" : "5 Clustering of Results",
      "text" : "Companies may adopt various digital strategies based on sector, digital maturity, and business scope. To identify the common digital strategy archetypes, we clustered the data. As k-means clustering assumes an equal mean and variance, we standardized the data by applying MinMax scaling and log transformation. There were few sparse features, so we chose 12 dense features (non-zero values > 40% of all"
    }, {
      "heading" : "1 Appendix A provides a list of the keyword terms for each label.",
      "text" : "2 Appendix B outlines the classification labels definitions, annotation process, and label frequency in the dataset.\ncompanies). We also applied t-SNE3 for dimensionality reduction, as it significantly improved clustering performance (Maaten & Hinton, 2008). Plotting the Silhouette score for clustering showed multiple peaks demonstrating inherent hierarchy in the data. Upon visual inspection, we found 10 clusters to be meaningful representation. The cluster map is illustrated in Figure 1 (a).\nInvestigating the cluster map revealed two main insights. First, clusters generally included companies in the same or a related sector. This indicates that the digital strategy can be sector specific. Second, we found a few conventionally asset-heavy companies from the industrials sector clustered with predominantly digital native companies from the technology sector. This indicates that some companies have made significant progress in digitally transforming their business.\nWe investigate the clusters by calculating the mean maturity value for each feature across the 10 clusters. We found four distinct digital strategies shared between eight clusters, whereas the remaining two had very limited digital maturity. The four digital strategy archetypes are product led (cluster 2), customer experience led (cluster 4), service led (clusters 0,7,8,9), and efficiency led (clusters 3,6), as illustrated by the radar charts in Figure 1 (b). We also found that while companies lead with a specific business value, such as customer experience, the vast majority demonstrate some level of progress across all areas. Therefore, focusing on a single area, as some authors argue, might not be practical due to the interdependencies between business functions (Sebastian et al., 2017; Westerman et al., 2014).\nOur findings have two main implications. First, managers can use the identified archetypes as a baseline for digital strategy formulation and as a tool to benchmark the progress made against relevant companies. Second, researchers can build on our findings to investigate digital strategy further."
    }, {
      "heading" : "6 Conclusion",
      "text" : "In this study, we present a deep learning framework for measuring the digital strategy of companies by using earnings calls transcripts. In the process, we demonstrate the practical value of state-of-the-art NLP models beyond inference. The results from our experiment enhance the understanding of digital strategy by identifying four distinct digital strategy archetypes. Our findings may serve as a baseline for companies attempting to formulate or benchmark their digital strategy as well as an empirical foundation for further research. For future studies, we recommend investigating the causal relationship between aspect maturity and financial performance."
    } ],
    "references" : [ {
      "title" : "An empirical examination of corporate websites as a voluntary disclosure medium",
      "author" : [ "R. Frankel", "M. Johnson", "D. Skinner" ],
      "venue" : "Journal of Accounting Research,",
      "citeRegEx" : "Frankel et al\\.,? \\Q1999\\E",
      "shortCiteRegEx" : "Frankel et al\\.",
      "year" : 1999
    }, {
      "title" : "Gearing up for successful digital transformation",
      "author" : [ "V. Gurbaxani", "D. Dunkle" ],
      "venue" : "MIS Quarterly Executive,",
      "citeRegEx" : "Gurbaxani and Dunkle,? \\Q2019\\E",
      "shortCiteRegEx" : "Gurbaxani and Dunkle",
      "year" : 2019
    }, {
      "title" : "Universal Language Model Fine-tuning for Text Classification",
      "author" : [ "J. Howard", "S. Ruder" ],
      "venue" : "56th Annual Meeting Ofthe Association for Computational Linguistics,",
      "citeRegEx" : "Howard and Ruder,? \\Q2018\\E",
      "shortCiteRegEx" : "Howard and Ruder",
      "year" : 2018
    }, {
      "title" : "A Challenge Dataset and Effective Models for AspectBased Sentiment Analysis",
      "author" : [ "Q. Jiang", "L. Chen", "R. Xu", "X. Ao", "M. Yang" ],
      "venue" : "Proceedings Ofthe 2019 Conference on Empirical Methods in Natural Language Processing and the 9th International Joint Conference on Natural Language Processing,",
      "citeRegEx" : "Jiang et al\\.,? \\Q2019\\E",
      "shortCiteRegEx" : "Jiang et al\\.",
      "year" : 2019
    }, {
      "title" : "Modeling Financial Analysts’ Decision Making via the Pragmatics and Semantics of Earnings Calls",
      "author" : [ "K. Keith", "A. Stent" ],
      "venue" : "57th Annual Meeting of the Association for Computational Linguistics,",
      "citeRegEx" : "Keith and Stent,? \\Q2019\\E",
      "shortCiteRegEx" : "Keith and Stent",
      "year" : 2019
    }, {
      "title" : "Text mining for patent analysis to forecast emerging technologies in wireless power transfer",
      "author" : [ "K.H. Kim", "Y.J. Han", "S. Lee", "S.W. Cho", "C. Lee" ],
      "venue" : "Sustainability (Switzerland),",
      "citeRegEx" : "Kim et al\\.,? \\Q2019\\E",
      "shortCiteRegEx" : "Kim et al\\.",
      "year" : 2019
    }, {
      "title" : "RoBERTa: A Robustly Optimized BERT Pretraining Approach",
      "author" : [ "Y. Liu", "M. Ott", "N. Goyal", "J. Du", "M. Joshi", "D. Chen", "O. Levy", "M. Lewis", "L. Zettlemoyer", "V. Stoyanov" ],
      "venue" : "ArXiv Preprint,",
      "citeRegEx" : "Liu et al\\.,? \\Q2019\\E",
      "shortCiteRegEx" : "Liu et al\\.",
      "year" : 2019
    }, {
      "title" : "Visualizing Data using t-SNE",
      "author" : [ "L. Maaten", "G. Hinton" ],
      "venue" : "Journal of Machine Learning Research,",
      "citeRegEx" : "Maaten and Hinton,? \\Q2008\\E",
      "shortCiteRegEx" : "Maaten and Hinton",
      "year" : 2008
    }, {
      "title" : "Essence of digital transformation—Manifestations at large financial institutions from North America",
      "author" : [ "H.S. Pramanik", "M. Kirtania", "A.K. Pani" ],
      "venue" : "Future Generation Computer Systems,",
      "citeRegEx" : "Pramanik et al\\.,? \\Q2019\\E",
      "shortCiteRegEx" : "Pramanik et al\\.",
      "year" : 2019
    }, {
      "title" : "Core, intertwined, and ecosystemspecific clusters in platform ecosystems: analyzing similarities in the digital transformation of the automotive, blockchain, financial, insurance and IIoT industry",
      "author" : [ "T. Riasanow", "L. Jäntgen", "S. Hermes", "M. Böhm", "H. Krcmar" ],
      "venue" : "Electronic Markets,",
      "citeRegEx" : "Riasanow et al\\.,? \\Q2020\\E",
      "shortCiteRegEx" : "Riasanow et al\\.",
      "year" : 2020
    }, {
      "title" : "How Big Old Companies Navigate Digital Transformation",
      "author" : [ "I. Sebastian", "M. Mocker", "J. Ross", "K. Moloney", "C. Beath", "N. Fonstad" ],
      "venue" : "MIS Quarterly Executive,",
      "citeRegEx" : "Sebastian et al\\.,? \\Q2017\\E",
      "shortCiteRegEx" : "Sebastian et al\\.",
      "year" : 2017
    }, {
      "title" : "Measuring the Readability of Sustainability Reports: A Corpus-Based Analysis Through Standard Formulae and NLP",
      "author" : [ "N. Smeuninx", "B. De Clerck", "W. Aerts" ],
      "venue" : "International Journal of Business Communication,",
      "citeRegEx" : "Smeuninx et al\\.,? \\Q2020\\E",
      "shortCiteRegEx" : "Smeuninx et al\\.",
      "year" : 2020
    }, {
      "title" : "Mining the Automotive Industry: A Network Analysis of Corporate Positioning and Technological Trends",
      "author" : [ "N. Stoehr", "F. Braesemann", "M. Frommelt", "S. Zhou" ],
      "venue" : null,
      "citeRegEx" : "Stoehr et al\\.,? \\Q2019\\E",
      "shortCiteRegEx" : "Stoehr et al\\.",
      "year" : 2019
    }, {
      "title" : "From disruptively digital to proudly analog : A holistic typology of digital transformation strategies",
      "author" : [ "Z. Tekic", "D. Koroteev" ],
      "venue" : "Business Horizons,",
      "citeRegEx" : "Tekic and Koroteev,? \\Q2019\\E",
      "shortCiteRegEx" : "Tekic and Koroteev",
      "year" : 2019
    }, {
      "title" : "Profet: Predicting the risk of firms from event transcripts",
      "author" : [ "C.K. Theil", "S. Broscheit", "H. Stuckenschmidt" ],
      "venue" : "IJCAI International Joint Conference on Artificial Intelligence,",
      "citeRegEx" : "Theil et al\\.,? \\Q2019\\E",
      "shortCiteRegEx" : "Theil et al\\.",
      "year" : 2019
    }, {
      "title" : "Understanding digital transformation: A review and a research agenda",
      "author" : [ "G. Vial" ],
      "venue" : "Journal of Strategic Information Systems,",
      "citeRegEx" : "Vial,? \\Q2019\\E",
      "shortCiteRegEx" : "Vial",
      "year" : 2019
    }, {
      "title" : "Leading Digital: Turning Technology Into Business Transformation",
      "author" : [ "G. Westerman", "D. Bonnet", "A. McAfee" ],
      "venue" : null,
      "citeRegEx" : "Westerman et al\\.,? \\Q2014\\E",
      "shortCiteRegEx" : "Westerman et al\\.",
      "year" : 2014
    } ],
    "referenceMentions" : [ {
      "referenceID" : 10,
      "context" : "As a result, organizations are perceiving digital technologies to present both growth opportunities and existential threats (Sebastian et al., 2017).",
      "startOffset" : 124,
      "endOffset" : 148
    }, {
      "referenceID" : 14,
      "context" : "Examples are, predicting expected returns from financial reports (Theil et al., 2019) and measuring compliance from sustainability reports (Smeuninx et al.",
      "startOffset" : 65,
      "endOffset" : 85
    }, {
      "referenceID" : 11,
      "context" : ", 2019) and measuring compliance from sustainability reports (Smeuninx et al., 2020).",
      "startOffset" : 61,
      "endOffset" : 84
    }, {
      "referenceID" : 15,
      "context" : "We quantify the approach taken by companies based on the progress made on the following three components related to the digital strategy (Vial, 2019): • Business value: the expressed value of using a specific digital solution (e.",
      "startOffset" : 137,
      "endOffset" : 149
    }, {
      "referenceID" : 10,
      "context" : "There have been a few recommendations for the digital strategy to be customer focused, product focused (Sebastian et al., 2017), or business model focused (Vial, 2019).",
      "startOffset" : 103,
      "endOffset" : 127
    }, {
      "referenceID" : 15,
      "context" : ", 2017), or business model focused (Vial, 2019).",
      "startOffset" : 35,
      "endOffset" : 47
    }, {
      "referenceID" : 12,
      "context" : "This included network analytics of website tags (Stoehr et al., 2019), document clustering of companies’ description (Riasanow et al.",
      "startOffset" : 48,
      "endOffset" : 69
    }, {
      "referenceID" : 9,
      "context" : ", 2019), document clustering of companies’ description (Riasanow et al., 2020), and keyword analysis of financial reports (Pramanik et al.",
      "startOffset" : 55,
      "endOffset" : 78
    }, {
      "referenceID" : 8,
      "context" : ", 2020), and keyword analysis of financial reports (Pramanik et al., 2019).",
      "startOffset" : 51,
      "endOffset" : 74
    }, {
      "referenceID" : 0,
      "context" : "Earnings calls transcripts are known to be rich data sources and even contain more information than company filing (Frankel et al., 1999).",
      "startOffset" : 115,
      "endOffset" : 137
    }, {
      "referenceID" : 3,
      "context" : "The closest text classification task to this is aspect-based sentiment analysis, which is proven to be effective for mining aspects related to customers’ opinions (Jiang et al., 2019).",
      "startOffset" : 163,
      "endOffset" : 183
    }, {
      "referenceID" : 6,
      "context" : "We found that RoBERTa (Liu et al., 2019) performed best without language model fine-tuning, as shown in Table 2.",
      "startOffset" : 22,
      "endOffset" : 40
    }, {
      "referenceID" : 10,
      "context" : "Therefore, focusing on a single area, as some authors argue, might not be practical due to the interdependencies between business functions (Sebastian et al., 2017; Westerman et al., 2014).",
      "startOffset" : 140,
      "endOffset" : 188
    }, {
      "referenceID" : 16,
      "context" : "Therefore, focusing on a single area, as some authors argue, might not be practical due to the interdependencies between business functions (Sebastian et al., 2017; Westerman et al., 2014).",
      "startOffset" : 140,
      "endOffset" : 188
    } ],
    "year" : 2020,
    "abstractText" : "Companies today are racing to leverage the latest digital technologies, such as artificial intelligence, blockchain, and cloud computing. However, many companies report that their strategies did not achieve the anticipated business results. This study is the first to apply stateof-the-art NLP models on unstructured data to understand the different clusters of digital strategy that companies are Adopting. We achieve this by analyzing earnings calls from Fortune 500 companies between 2015 and 2019. We use Transformer-based architecture for text classification which show a better understanding of the conversation context. We then investigate digital strategy patterns by applying clustering analysis. Our findings suggest that Fortune 500 companies use four distinct strategies which are product-led, customer experienceled, service-led, and efficiency-led. This work provides an empirical baseline for companies and researchers to enhance our understanding of the field.",
    "creator" : "Word"
  }
}