{
  "name" : "COLING_2020_35_paper.pdf",
  "metadata" : {
    "source" : "CRF",
    "title" : "Tree Representations in Transition System for RST Parsing",
    "authors" : [ ],
    "emails" : [ ],
    "sections" : [ {
      "heading" : "1 Introduction",
      "text" : "It is expected that a document consists of text units that are logically connected within the context through discourse relations. Text-level discoursing parsing plays a significant role in many NLP downstream task, such as question-answering (Jansen et al., 2014), sentiment analysis (Mukherjee and Bhattacharyya, 2012) and abstractive summarization (Koto et al., 2019).\nThe Rhetorical Structure Theory (RST)(Mann and Thompson, 1988) is one of the widely explored text-level discourse parsing theory, which parses a document into a hierarchical discourse tree. The discourse tree is built over its smallest parsing unit, namely, elementary discourse unit (EDU), placed in the leaf nodes. The tree’s non-terminal nodes bear the information of span, nuclearity and relation. The span represents the cover range of a sequence of EDUs; while the nuclearity status is the semantic role in a relation (i.e., nucleus or satellite). A text tagged by nucleus is more essential than the satellite. Conventionally, there are three nuclearity types including Nucleus-Satellite (NS), Satellite-Nucleus (SN) and Nucleus-Nucleus (NN). As for relation, there are mainly two types of relations: the mono-nuclear relation, such as “Attribution” or “Summary”, with the the nuclearity type being either “NS” or “SN”; and the multi-nuclear relation, such as “Contrast” or “Same-Unit”, with the nuclearity types of “NN”.\nAmong all the parsing systems dedicated to RST parsing, the transition-based systems obtain comparative performance with the CYK-like system. The transition-based algorithms are first explored in (Marcu, 1999), which adopt a sequence of shift-reduce action to construct rhetorical structures of texts. The study of Wang et al. (2017) achieves the best performance among all the transition-based systems, by parsing the discourse tree in two stages, namely, parsing a naked discourse tree (identifying span and nuclearity) in the first stage and assigning relation in the second stage. The researchers use only one classifier for the joint action of shift-reduce and nuclear types (e.g., Reduce-NS) to parse the tree. In this study, we explore whether two separate classifiers for shift-reduce action and nuclear type respectively (i.e., identifying span first, and then nuclearity comes later) is more effective in the RST parsing task.\nPrevious transition systems do not differentiate the nuclear type between multi-nuclear relations and\nbinary-nuclear relations. In addition, they represent RST by the right-heavy binary trees, which inevitably create the redundant nonexistent node in the original RST tree. To solve these problems, we come up with a new nuclear type “N̂” for the multi-nuclear relation, and a new action “R̂” to construct a multi-branch tree. Experimental results tell us that the newly designed nuclear type and action labels are capable of capturing multi-nuclear relations.\nIn sum, our paper mainly make the following contributions:\n• We propose a new nuclear type (N̂) to distinguish the multi-nuclear types from the binary-nuclear types. • We come up with a new action: the Flat Reduce (R̂) to construct a multi-branch tree. • We examine that the joint action of shift-reduce and nuclear type is more suitable in the transition-\nbased system comparing to the separate one."
    }, {
      "heading" : "2 Our Approach",
      "text" : "We construct two tree structures: the binary tree and multi-branch tree structures, with a new nuclear type and a new action, respectively. To enrich the features for the less training examples of the new labels, we add the extra dependency features generated by the Bi-Affine model (Dozat and Manning, 2016), along with the features extracted by (Wang et al., 2017). We also examine the performance of two approaches in our transition-based system: to identify span and nuclearity concurrently with one classifier vs to identify them separately using different classifiers."
    }, {
      "heading" : "2.1 Binary Tree Structure",
      "text" : "In the previous studies, researchers annotate the multi-nuclear type with a notion of “NN”, and parse the RST tree into a right-heavy binary tree (as shown in Figure 1a). Such annotation cannot differentiate the multi-nuclear types from the binary-nuclear ones. Since the multi-nuclear relations have different tree structure in the original RST tree, we propose a new nuclear type of “N̂” for the multi-nuclear nodes (as shown in Figure 1b), corresponding to the nuclear type of “NN” for the binary-nuclear nodes. With the annotation of “N̂”, the nuclear types of the binary-nuclear relations (e.g., Explanation and Contrast) and the multi-nuclear relations (e.g., List and Same-Unit) are distinguishable. We present the example in Table 1."
    }, {
      "heading" : "2.2 Multi-branches Tree Structure",
      "text" : "In order to capture the distinct tree structure of the multi-nuclear relations, we keep the original RST tree structure by using a new action of Flat Reduce R̂. As shown in Table 1, the action of R̂(list, N̂)1 forms a sub tree ê2e3. However, instead of forming a binary sub tree, action R̂(list, N̂)2 flattens the tree structure so that EDU1, EDU2 and EDU3 are in the same depth in a tree. A corresponding tree structure is shown in Figure 1c.\nAfter proposing the new form and action labels, the frequency of the new joint-action R-N̂ and R̂-N̂ is relatively low comparing to the others. In order to better fit for the sparse train examples, we enrich our feature by introducing the dependency feature explained in the following section."
    }, {
      "heading" : "2.3 Refined Dependency Feature",
      "text" : "We refine dependency feature generated by the deep Biaffine Attention model (Dozat and Manning, 2016), and obtain the representations of head, dependent and arc-label for each EDU.\nThe Bi-Affine model is composed of several components including (1) a BLSTM layer extracting the representation of a sentence rn; (2) two MLP layer obtaining hidden states of head h (arc−head) i , dependent h(arc−dep)i , respectively; (3) a Bi-Affine layer to extract the arc-label s (arc) i,j . After achieving the head, dependent and arc-label hidden states, we obtain the vector for an EDU De by concatenating them. The vector of the merged span Dei:j is the average vector from Dei to Dej .\nrn = BLSTM(xn)\nh (arc−dep) i = MLP (arc−dep)(ri)\nh (arc−head) j = MLP (arc−head)(rj)\ns (arc) i,j = Bi−Affine(h (arc−dep) i , h (arc−head) j )\nDe = [H (arc−dep);H(arc−head);S(arc)] Dei:j = ave( j∑\nk=i Dek)\n(1)"
    }, {
      "heading" : "2.4 A Separate Classifier for Nuclear Type",
      "text" : "Previous studies propose the information-rich actions (e.g., Reduce-NS-Contrast) to identify span, nuclearity and relation in the same stage, while (Wang et al., 2017) separate the relation from the actions and assign relation in a second stage, which obtains great success. In our study, we further explore whether separating the nuclearity from the action is more suitable.\nWe adopt all the features used by (Wang et al., 2017) including the Status, Position, Structural, Dependency(which is different from ours), N-gram and Nucleus for the action classifier, and an additional nuclearity classifier; while Dependency, N-gram, Nucleus, Refined Structural and Tree features are used for the relation classifier."
    }, {
      "heading" : "3 Experimental Setup",
      "text" : "We use the default 385 documents (347 and 38 documents in training and test dataset respectively) from the Wall Street Journal (RST-DT) (Mann and Thompson, 1988). The 18 coarse-grained relations are evaluated in our experiment such as the binary-nuclear relation of “Contrast” and the multi-nuclear relation of “Joint” (Sagae and Lavie, 2005). We report the Micro-averaged F1 scores of RST-Parseval (Marcu, 2000) and labelled attachment decisions (LAS) with respect to span, nuclearity and relation."
    }, {
      "heading" : "4 Results",
      "text" : "We only compare our results with the state-of-the-art transition-based system: two-stages system (Wang et al., 2017). As shown in Table 2, the additional refined dependency feature improve the performance in span, nuclearity and relation, measured in the two scores. The poor performance of Separate†implies that the joint action of shift-reduce and nuclear type is more suitable in the transition-based system. The reason might be the feature of Nucleus are essential for the span and relation identification. While the binary tree with the new nuclear type of N̂ outperforms our baseline by around 2% in all three aspects. Our final model: multi-branch structure achieves the state-of-the-art performance in transition-based systems, for the reason that it reduces the redundant nodes in the RST parsing tree.\nTo further examine whether our approach improve the performance of the multi-nuclear relations, we present the scores of Joint, Same-Unit and Topic-Change in Table 3. Compared to the two-stage system, the F1-score of these relations using our methods improves. Specifically, the binary tree structure is more capable of capturing the relation of Joint and Same-Unit, and the multi-branch tree structure is more capable of capturing Topic-Change relation."
    }, {
      "heading" : "5 Conclusions",
      "text" : "In this paper, we come up with a new nuclear type “N̂” for the multi-nuclear relation, and a new action “R̂” to construct a multi-branch tree, with the additional refined dependency feature for the texts. We find that “N̂” is effective in distinguishing from the binary-nuclear type, resulting a better performance on the multi-nuclear relations identifications. The newly designed action R̂, remaining the original tree structure, helps to prevent from creating the redundant nodes in the right-heavy binary tree, thus achieving the art-of-the-state performance.\nWe find that the F1-score of Topic-Change is extremely low in comparison with to the other multinuclear relations, due to its sparsity; on the other hand, Topic-Change is a relation which benefits from global information. Therefore, we plan to design a top-down manner system to capture more global information in the future. We also find that the joint action of shift-reduce and nuclear type is more suitable in the transition-based system, and an analysis of which feature is essential in identifying the spans, nuclearity and relations is worth exploring in the future."
    }, {
      "heading" : "19443 3276 1053 11702 3065",
      "text" : ""
    } ],
    "references" : [ {
      "title" : "Deep biaffine attention for neural dependency parsing",
      "author" : [ "Timothy Dozat", "Christopher D Manning." ],
      "venue" : "arXiv preprint arXiv:1611.01734.",
      "citeRegEx" : "Dozat and Manning.,? 2016",
      "shortCiteRegEx" : "Dozat and Manning.",
      "year" : 2016
    }, {
      "title" : "Discourse complements lexical semantics for non-factoid answer reranking",
      "author" : [ "Peter Jansen", "Mihai Surdeanu", "Peter Clark." ],
      "venue" : "Proceedings of the 52nd Annual Meeting of the Association for Computational Linguistics (Volume 1: Long Papers), pages 977–986.",
      "citeRegEx" : "Jansen et al\\.,? 2014",
      "shortCiteRegEx" : "Jansen et al\\.",
      "year" : 2014
    }, {
      "title" : "Improved document modelling with a neural discourse parser",
      "author" : [ "Fajri Koto", "Jey Han Lau", "Timothy Baldwin." ],
      "venue" : "arXiv preprint arXiv:1911.06919.",
      "citeRegEx" : "Koto et al\\.,? 2019",
      "shortCiteRegEx" : "Koto et al\\.",
      "year" : 2019
    }, {
      "title" : "Rhetorical structure theory: Toward a functional theory of text organization",
      "author" : [ "William C Mann", "Sandra A Thompson." ],
      "venue" : "Text, 8(3):243–281.",
      "citeRegEx" : "Mann and Thompson.,? 1988",
      "shortCiteRegEx" : "Mann and Thompson.",
      "year" : 1988
    }, {
      "title" : "A decision-based approach to rhetorical parsing",
      "author" : [ "Daniel Marcu." ],
      "venue" : "Proceedings of the 37th Annual Meeting of the Association for Computational Linguistics, pages 365–372.",
      "citeRegEx" : "Marcu.,? 1999",
      "shortCiteRegEx" : "Marcu.",
      "year" : 1999
    }, {
      "title" : "The theory and practice of discourse parsing and summarization",
      "author" : [ "Daniel Marcu." ],
      "venue" : "MIT press.",
      "citeRegEx" : "Marcu.,? 2000",
      "shortCiteRegEx" : "Marcu.",
      "year" : 2000
    }, {
      "title" : "Sentiment analysis in twitter with lightweight discourse analysis",
      "author" : [ "Subhabrata Mukherjee", "Pushpak Bhattacharyya." ],
      "venue" : "Proceedings of COLING 2012, pages 1847–1864.",
      "citeRegEx" : "Mukherjee and Bhattacharyya.,? 2012",
      "shortCiteRegEx" : "Mukherjee and Bhattacharyya.",
      "year" : 2012
    }, {
      "title" : "A classifier-based parser with linear run-time complexity",
      "author" : [ "Kenji Sagae", "Alon Lavie." ],
      "venue" : "Proceedings of the Ninth International Workshop on Parsing Technology, pages 125–132.",
      "citeRegEx" : "Sagae and Lavie.,? 2005",
      "shortCiteRegEx" : "Sagae and Lavie.",
      "year" : 2005
    }, {
      "title" : "A two-stage parsing method for text-level discourse analysis",
      "author" : [ "Yizhong Wang", "Sujian Li", "Houfeng Wang." ],
      "venue" : "Proceedings of the 55th Annual Meeting of the Association for Computational Linguistics (Volume 2: Short Papers), pages 184–188.",
      "citeRegEx" : "Wang et al\\.,? 2017",
      "shortCiteRegEx" : "Wang et al\\.",
      "year" : 2017
    } ],
    "referenceMentions" : [ {
      "referenceID" : 1,
      "context" : "Text-level discoursing parsing plays a significant role in many NLP downstream task, such as question-answering (Jansen et al., 2014), sentiment analysis (Mukherjee and Bhattacharyya, 2012) and abstractive summarization (Koto et al.",
      "startOffset" : 112,
      "endOffset" : 133
    }, {
      "referenceID" : 6,
      "context" : ", 2014), sentiment analysis (Mukherjee and Bhattacharyya, 2012) and abstractive summarization (Koto et al.",
      "startOffset" : 28,
      "endOffset" : 63
    }, {
      "referenceID" : 2,
      "context" : ", 2014), sentiment analysis (Mukherjee and Bhattacharyya, 2012) and abstractive summarization (Koto et al., 2019).",
      "startOffset" : 94,
      "endOffset" : 113
    }, {
      "referenceID" : 3,
      "context" : "The Rhetorical Structure Theory (RST)(Mann and Thompson, 1988) is one of the widely explored text-level discourse parsing theory, which parses a document into a hierarchical discourse tree.",
      "startOffset" : 37,
      "endOffset" : 62
    }, {
      "referenceID" : 4,
      "context" : "The transition-based algorithms are first explored in (Marcu, 1999), which adopt a sequence of shift-reduce action to construct rhetorical structures of texts.",
      "startOffset" : 54,
      "endOffset" : 67
    }, {
      "referenceID" : 0,
      "context" : "To enrich the features for the less training examples of the new labels, we add the extra dependency features generated by the Bi-Affine model (Dozat and Manning, 2016), along with the features extracted by (Wang et al.",
      "startOffset" : 143,
      "endOffset" : 168
    }, {
      "referenceID" : 8,
      "context" : "To enrich the features for the less training examples of the new labels, we add the extra dependency features generated by the Bi-Affine model (Dozat and Manning, 2016), along with the features extracted by (Wang et al., 2017).",
      "startOffset" : 207,
      "endOffset" : 226
    }, {
      "referenceID" : 0,
      "context" : "3 Refined Dependency Feature We refine dependency feature generated by the deep Biaffine Attention model (Dozat and Manning, 2016), and obtain the representations of head, dependent and arc-label for each EDU.",
      "startOffset" : 105,
      "endOffset" : 130
    }, {
      "referenceID" : 8,
      "context" : ", Reduce-NS-Contrast) to identify span, nuclearity and relation in the same stage, while (Wang et al., 2017) separate the relation from the actions and assign relation in a second stage, which obtains great success.",
      "startOffset" : 89,
      "endOffset" : 108
    }, {
      "referenceID" : 8,
      "context" : "We adopt all the features used by (Wang et al., 2017) including the Status, Position, Structural, Dependency(which is different from ours), N-gram and Nucleus for the action classifier, and an additional nuclearity classifier; while Dependency, N-gram, Nucleus, Refined Structural and Tree features are used for the relation classifier.",
      "startOffset" : 34,
      "endOffset" : 53
    }, {
      "referenceID" : 3,
      "context" : "We use the default 385 documents (347 and 38 documents in training and test dataset respectively) from the Wall Street Journal (RST-DT) (Mann and Thompson, 1988).",
      "startOffset" : 136,
      "endOffset" : 161
    }, {
      "referenceID" : 7,
      "context" : "The 18 coarse-grained relations are evaluated in our experiment such as the binary-nuclear relation of “Contrast” and the multi-nuclear relation of “Joint” (Sagae and Lavie, 2005).",
      "startOffset" : 156,
      "endOffset" : 179
    }, {
      "referenceID" : 5,
      "context" : "We report the Micro-averaged F1 scores of RST-Parseval (Marcu, 2000) and labelled attachment decisions (LAS) with respect to span, nuclearity and relation.",
      "startOffset" : 55,
      "endOffset" : 68
    }, {
      "referenceID" : 8,
      "context" : "4 Results We only compare our results with the state-of-the-art transition-based system: two-stages system (Wang et al., 2017).",
      "startOffset" : 107,
      "endOffset" : 126
    }, {
      "referenceID" : 8,
      "context" : "Model RST-Parseval LAS Span Nucliearity Relation Span Nucliearity Relation Two Stages(Wang et al., 2017) 86 72.",
      "startOffset" : 85,
      "endOffset" : 104
    }, {
      "referenceID" : 8,
      "context" : "Model Joint Same-Unit Topic-Change Two Stages(Wang et al., 2017) 38.",
      "startOffset" : 45,
      "endOffset" : 64
    } ],
    "year" : 2020,
    "abstractText" : "The transition-based systems in the past studies propose a series of actions, to build a rightheavy binarized tree for the RST parsing. However, the nodes of the binary-nuclear relations (e.g., Contrast) have the same nuclear type with those of the multi-nuclear relations (e.g., Joint) in the binary tree structure. In addition, the reduce action only construct binary trees instead of multi-branch trees, which is the original RST tree structure. In our paper, we design a new nuclear type for the multi-nuclear relations, and a new action to construct a multi-branch tree. We enrich the feature set by extracting additional refined dependency feature of texts from the Bi-Affine model. We also compare the performance of two approaches for RST parsing in the transition-based system: a joint action of reduce-shift and nuclear type (i.e., Reduce-SN) vs a separate one that applies Reduce action first and then assigns nuclear type. We find that the new devised nuclear type and action are more capable of capturing the multi-nuclear relation and the joint action is more suitable than the separate one. Our multi-branch tree structure obtains the state-of-the-art performance for all the 18 coarse relations.",
    "creator" : "TeX"
  }
}