{
  "name" : "COLING_2020_71_paper.pdf",
  "metadata" : {
    "source" : "CRF",
    "title" : "RuSemShift: a dataset of historical lexical semantic changes in Russian",
    "authors" : [ ],
    "emails" : [ ],
    "sections" : [ {
      "heading" : "1 Introduction",
      "text" : "Language is a constantly changing system by nature as it is also a method of communication and if we consider language as a social instrument, it should meet the needs of its speakers and it changes according to changes in society and the ever-changing world. As language units, words also evolve over time, undergoing diachronic (or temporal) semantic shifts which influence the relations between their forms and meanings (Traugott and Dasher, 2001).\nTracing semantic shifts can be important either as an independent linguistic research or for subsequent practical applications, for example, in socio-linguistic research. Manual analysis of such changes require a lot of time and labor for specialists even after the appearance of large representative corpora as it is needed to look through a lot of examples and lexicographic resources which often do not record current lexical changes in language due to limited resources. Thus, researchers are trying to model these processes using advanced computational approaches often based on distributional semantics and dense word embeddings (Kutuzov et al., 2018; Tang, 2018).\nHowever, this research is still mostly conducted for English: often simply because manually annotated test data is not available for a particular language. Recently, consistently annotated lexical semantic change test sets for other languages started to appear; see, for example, (Schlechtweg et al., 2020). In this paper, we continue this vein of work by presenting RuSemShift. RuSemShift is the first historical semantic change dataset for Russian annotated in the DURel framework (Schlechtweg et al., 2018) using a large crowd-sourcing platform, instead of personal intuitions of particular researchers. It allows to evaluate semantic change detection systems by their ability to estimate the lexical shifts which occurred to Russian words either after 1917 (the fall of the Russian Empire) or after 1990 (the fall of the Soviet Union).\nThe rest of the paper is organized as follows: in Section 2 we put our research in the context of the related work. In Section 3 we explain the process of choosing words for annotation and the corpora that were used as sources of contexts. Section 4 describes the annotation itself. In Section 5 we evaluate several semantic change detection algorithms (based on static and contextualized embeddings) on RuSemShift to check its sanity. Section 6 summarizes our contributions and outlines future research."
    }, {
      "heading" : "2 Related work",
      "text" : "To our knowledge, the first Russian test set to evaluate lexical semantic change detection systems was created by Kutuzov and Kuzmenko (2018). They used prior linguistic work to manually collect Rus-\nsian words which changed their meaning from the pre-Soviet times through the Soviet times. Kutuzov and Kuzmenko (2018) also employed static word embedding models trained on the corresponding Russian diachronic corpora to automatically estimate the degree of semantic change for the words from the dataset. They concluded that Kendall’s τ (Kendall, 1948) and Jaccard similarity (Jaccard, 1901) between nearest neighbors list worked best in scoring changes. More recent work by Fomin et al. (2019) extended this research to more granular time bins (periods of 1 year): they analyzed sequential pairs of word embedding models trained on yearly corpora of Russian news from 2000 up to 2014. To evaluate their system, they created a test set which contained human judgements about how much the meaning of a word has shifted over the given years. Using this ground truth, Fomin et al. (2019) evaluated 5 algorithms for semantic change detection and provided solid baselines for future research in in this direction for Russian.\nHowever, the datasets mentioned above have two serious issues. First, they are either produced by a single person (Kutuzov and Kuzmenko, 2018) or annotated by the paper authors themselves (Fomin et al., 2019). This makes them inherently biased and subjective. Second, each of this datasets is created and annotated in a different manner, making them inconsistent and not comparable nor to themselves neither to similar efforts made for other languages. In addition, the test set from (Kutuzov and Kuzmenko, 2018) features only binary labels (shifted or stable), making it useless for research in graded semantic change detection.\nThe RuSemShift test set we present in this paper makes partial use of these prior test sets, but they are re-annotated from scratch. In it, we adhered to the language-agnostic semantic change annotation methodology Diachronic Usage Relatedness (DURel) proposed in (Schlechtweg et al., 2018). The intended use of the DURel framework is the creation of consistently and robustly annotated test sets containing words labeled with the degrees of their diachronic lexical semantic change. Schlechtweg et al. (2018) presented a test set for German annotated this way. In addition, English, German, Latin and Swedish test sets used in the SemEval-2020 shared task on unsupervised lexical semantic change detection (Schlechtweg et al., 2020) also were created following the same approach. Thus, we deem DURel to be the current de-facto standard for the annotation of semantic change datasets.\nDURel employs the idea of usage relatedness borrowed from synchronic research on word sense disambiguation task (Brown, 2008). The idea behind using such judgments is to measure the strength of semantic change as a function of mean relatedness across context pairs of word’s usage in different time periods. The annotators are not required to know anything about diachronic change: they are presented with two sentences (both containing a target word) and asked to estimate how similar are the senses in which the target word is used. They should choose a score from the 4-point scale described below in section 4.\nTarget word usage pairs from the first time period t1 form the so called EARLIER group and the usage pairs from later time period t2 form the LATER group. To cover the cases that cannot be tracked by comparing mean relatedness of two time periods, Schlechtweg et al. (2018) directly compare ‘old’ and ‘new’ meanings by supplementing the COMPARE group with the pairs that include sentences from both earlier and later time periods (see Figure 1). Overall, Schlechtweg et al. (2018) measure each target word’s w change and sort them by applying two measures:\n1. ∆LATER which is the difference between mean relatedness of the EARLIER group and the LATER group: ∆LATER(w) = Meanlater(w)−Meanearlier(w);\n2. COMPARE, which is the mean relatedness within the COMPARE group: COMPARE(w) = Meancompare(w)."
    }, {
      "heading" : "3 Data Sources",
      "text" : "In this section, we describe our data sources. It can be looked at as the beginning of data statement (Bender and Friedman, 2018) for RuSemShift. We first present the corpus we employ and its historical sub-corpora, and then move on to the process of preliminary target word selection. The data statement continues in the next section 4 with the description of our annotators and the whole annotation workflow."
    }, {
      "heading" : "3.1 Corpora",
      "text" : "RuSemShift covers 3 time periods of Russian language history, following (Kutuzov and Kuzmenko, 2018):\n1. Texts produced from 1682 to 1916: the period of Russian monarchy before the revolution of 1917; further dubbed pre-Soviet.\n2. Texts produced from 1918 to 1990: the period of the existence of the Soviet Union; further dubbed Soviet.\n3. Texts produced from 1991 to 2017: the period after the fall of the Soviet Union: further dubbed post-Soviet.\nThe wide coverage of these periods (several decades each) makes it more likely that shifts in word usage will be caused by linguistic factors, and not only by extra-linguistic events. Note however, that such division is still strongly influenced by cultural factors. The boundaries between time bins are determined by collapses and appearances of political regimes, and some semantic shifts are inevitably related to that.\nOur annotation framework requires diachronic corpora with Russian texts corresponding to the time periods listed above. As a source of such texts, we used texts the Russian National Corpus (RNC).1 RNC is well balanced and contains Russian texts of diverse genres produced from the middle of the XVIII up to the beginning of the XXI century. At the time of writing, RNC is open for web search, but not for direct downloading. However, there is an ongoing effort to make it available publicly under some terms.\nThe main RNC corpus size is about 256 million word tokens. Since all the texts are annotated with the date of their creation, it is straightforward to separate the corpus into time-specific sub-corpora:\n• 85 million tokens in the pre-Soviet sub-corpus;\n• 75 million tokens in the Soviet sub-corpus;\n• 96 million tokens in the post-Soviet sub-corpus."
    }, {
      "heading" : "3.2 Preliminary word lists",
      "text" : "To construct word lists for further annotation, we used handpicked words that presumably undergone lexical semantic changes in Soviet period compared to pre-Soviet period or in post-Soviet compared to Soviet period. For each of these word lists we also randomly sampled ‘filler’ or ‘distractor’ semantically stable words, trying to reproduce the part of speech and frequency percentile distributions of the target words as closely as possible. The purpose of fillers is to evaluate the precision of semantic change detection systems: they are supposed to predict low change score for these words (or no change at all).\n3.2.1 Pre-Soviet to Soviet (RuSemShift1) The original target word list for the first pair of time bins was created in (Kutuzov and Kuzmenko, 2018). It consists of 43 words that have undergone semantic changes through the period from pre-Soviet to Soviet times. The words were collected from theoretical linguistic research on lexical semantic change (Daniel and Dobrushina, 2016; Ozhegov, 1953), 38 of them are nouns and 5 are adjectives. After the procedure of filler generation, the total number of words for annotation was 72. We emphasize again that only the changed word list was taken from (Kutuzov and Kuzmenko, 2018), the fillers and annotations were recreated from scratch by us.\n1http://ruscorpora.ru\n3.2.2 Soviet to Post-Soviet (RuSemShift2) The second test set is entirely our own contribution. It also contains manually chosen target words (35 nouns and 7 adjectives), primarily from the ‘New Words and Meanings’ dictionary (Burtseva et al., 2009). The dictionary includes words with new meanings that became common in Russian in the 1990s (such words are specifically marked). Important changes surely could have occurred in the period from 2000 to 2017 as well, but we are not aware of similar Russian lexicographical resources for the XXI century. After the generation of fillers, the test set consists of 70 words."
    }, {
      "heading" : "4 Annotation",
      "text" : "The annotation procedure was carried out on the Yandex.Toloka crowd-sourcing platform2, which is more or less equivalent to the global Mechanical Turk or CrowdFlower platforms. Note that in the DURel dataset (Schlechtweg et al., 2018), all five annotators were students of linguistics and two of them had historical background, which cannot be enforced when using crowd-sourcing platforms. However, Yandex.Toloka allowed us to improve the quality of annotation by applying various filters to limit who can annotate. We chose 10-30% of the best annotators across the whole platform, keeping only native speakers of Russian more than 30 years old and with higher education. We do not have any knowledge about the annotators’ gender distribution.\nUsers who completed the tasks too fast were automatically filtered out. Furthermore, there were several control tasks, consisting of sentence pairs manually annotated by ourselves (only 1 or 4 scores, thus only obvious cases). The users who grade such pairs incorrectly were blocked as well. Also, we accepted the task lists marked by one annotator only after checking few lists to make sure that they understood the task. We considered only those words’ meanings that can be confirmed by looking in the dictionaries. For example, word ‘дума’ [duma] may occur in the meaning ‘thought’ or ‘authority’ (Gosudarstvennaya duma), or word ‘насаждение’ [nasazhdenie] that can denote ‘groups of planted plants’ or ‘implantation of certain views’.\nFor each word from our pre-constructed word lists, we extracted all unique sentence contexts from two corpora (pre-Soviet/Soviet or Soviet/post-Soviet) and randomly sampled 60 sentence pairs, 20 for each group (EARLIER, LATER and COMPARE). For the words that occurred less than 30 times in one of the corpora we decreased the number of its sentence pairs to the closest value, divisible by 3 without a remainder. Final tables for the annotation contained 4214 + 3632 = 7846 pairs for 72 + 70 = 142 words. Each sentence pair was scored by no less than 5 annotators who used the 4-point scale presented in Table 1. The annotator interface of Yandex.Toloka is shown in Figure 2. For the cases when one sentence context was not enough to capture the meaning of a target word, we implemented an option to show extended contexts from the same corpora. Annotators were provided with detailed guidelines explaining the task and giving examples for each judgement.\nAfter all pairs of sentences were annotated, we measured inter-rater agreement as Krippendorff’s Alpha (Krippendorff, 2012) with ordinal scale, excluding 0-judgements. ForRuSemShift1 the agreement coefficient was 0.505, and for RuSemShift2 its value was 0.53. Considering that the task is inherently ambiguous and complex, and also that all five annotators were different for each pair, we believe that this score is high enough. However, we also provide the filtered versions of both test sets, where\n2https://toloka.yandex.ru/\ntoo controversial words that were annotated inconsistently (inter-rater agreement less than 0.2), are excluded. This resulted in test sets of sizes 48 and 51 words respectively (24 words were filtered out from RuSemShift1 and 19 from the second RuSemShift2). We use these filtered test sets for evaluation in section 5."
    }, {
      "heading" : "4.1 Analysis",
      "text" : "As stated in (Schlechtweg et al., 2018), the ∆LATER metric can miss semantic changes if a word loses old sense and gains a new one within one time period, while the COMPARE metric tends to mix up polysemy with semantic change because of random choice of samples. ∆LATER naturally captures the type of meaning change: innovative shifts (negative values) or reductive shifts (positive values), but this is true only for high absolute ∆LATER scores. Overall, Schlechtweg et al. (2018) claim the COMPARE metric to be more suitable for indicating the degree of semantic change.\n1.78), we can see that judgements are quite diverse in the EARLIER group\nand 1-judgement (‘unrelated senses’) is prevalent, but in the LATER group, 4-judgement (‘identical senses’) is significantly more frequent, while the COMPARE group also captures strong change, since the number of 1-judgements is higher than the number of 4-judgements. Almost all context pairs from the EARLIER group (that is, Soviet time period) shown in Table 2 are related to the literal meaning of провал – ‘a place where the surface collapsed inward’ or the figurative meaning ‘loss of consciousness’ used frequently in the set expression провальный сон (‘deep dream’). In all the contexts from the LATER group (post-Soviet time period), провальный is used in the ‘failed’ sense which is more common in modern Russian. Thus, we can observe the expansion of this sense. As for the COMPARE group, sentences in pairs from each period support the same observation: there are only two usages from the earlier period that can be interpreted with the ‘failed’ sense. The word провальный did not lose its literal meaning, it just had become much less frequent, and the old figurative meaning (as in ‘deep dream’) is almost completely lost3. Consequently, we can observe the word losing an old sense and gaining a new one at the same time.\nFor the word инкубатор (the value of−1.05), the distributions are the opposite. 4-judgment is prevalent in the EARLIER group and there is diversity in the LATER group. Indeed, in the EARLIER group, инкубатор is used mostly in its literal meaning, while in the LATER group there are many occurrences used in a figurative sense, for example, in бизнес-инкубатор ‘business incubator’. Thereby, the word инкубатор is undergoing an innovative meaning change in the post-Soviet times, as its figurative sense is becoming more and more widespread."
    }, {
      "heading" : "5 Evaluation",
      "text" : "RuSemShift is intended to be used by other researchers in the field of lexical semantic change detection for Russian. However, below we report the performance of basic change detection methods on our datasets, to set the baseline. We solved the task of ranking: that is, given a list of target words and two timespecific corpora, a system should predict semantic change scores which would position the target words in an order as similar to the gold one as possible. First we employed static distributional embeddings\n3But is kept in the related word провал (провал в памяти/‘lapse of memory’).\ntrained with the CBOW algorithm (Mikolov et al., 2013). After that, we tried several variations of contextualized embeddings, namely ELMo (Peters et al., 2018)."
    }, {
      "heading" : "5.1 Static embeddings",
      "text" : "In Table 3, we report the performance of the method based on static embeddings. We also use a very simple frequency-based baseline, where the degree of semantic change is estimated by the difference of target word absolute frequencies between two time periods. The ‘word2vec Procrustes’ is the classic method of calculating cosine similarity between target word vectors in two CBOW embedding models trained on different time periods (we used the same splits of Russian National Corpus as during the creation of RuSemShift). Prior to that, the models were aligned using Orthogonal Procrustes as described in (Hamilton et al., 2016).\nWe report the correlations between the predictions of these methods and the COMPARE and ∆LATER values from RuSemShift1 and RuSemShift2. Note that we used absolute values of ∆LATER, leaving the distinguishing of innovative versus reductive semantic change for future work. This means that an ideal system will produce perfectly positive correlations with ∆LATER and perfectly negative correlations with COMPARE (or vice versa, depending on the exact method), since the former is increases as the degree of semantic change grows, while the latter increases as word usages become more similar.\nAs expected, comparing cosine distance of Procrustes-aligned word embeddings far outperforms simply measuring frequency changes (this latter method produces predictions close to random in most cases). It can also be observed that RuSemShift2 is more difficult than RuSemShift1. A possible explanation is that Soviet and post-Soviet texts are on average less distant in time from each other than Soviet and pre-Soviet texts: the former pair of time bins lies entirely within 100 years, while the latter covers the time span of about 250 years. Because of that, semantic differences from RuSemShift1 (between Soviet and pre-Soviet lexical meanings) are manifested more clearly in the corpora. Finally, ∆LATER rankings are more difficult to reproduce than those for COMPARE; no method managed to achieve a statistically significant correlation in this case. This arguably stems from the nature of this measure: even though we used its absolute values, it is still focused rather on the nature of semantic shifts than on their degree, and this is not something which can be easily approximated by cosine similarity between Procrustes-aligned word embeddings. More advanced methods are required to better predict ∆LATER values from data."
    }, {
      "heading" : "5.2 Contextualized embeddings",
      "text" : "We trained ELMo (Peters et al., 2018) models on RNC to produce contextualized word representations in each time period. ELMo embeddings are inferred from bidirectional language models trained using two-layer long short-term memory network (LSTM) for next word predictions in both directions. Every token is represented as a linear combination of hidden layers and depends on a context sentence in which the token appears.\nAll corpora were segmented into sentences, tokenized and lemmatized with Universal Dependencies (UD) model trained on SynTagRus (Droganova et al., 2018) using UDPipe 1.2 (Straka and Straková, 2017). It is not yet well known whether contextualized embedding models should be trained on lemmatized or non-lemmatized texts, but Kutuzov and Kuzmenko (2019) showed that for Russian language including lemmatization into the pre-processing pipeline improves the results on word sense disam-\nbiguation task and it excludes word forms bias as we want to trace semantic shifts in lexemes rather than specific forms.\nWe trained 6 ELMo models in 3 variants:\n1. a single model trained on the whole RNC corpus with texts from all time periods (differentiation by time periods is made at the inference stage when token embeddings are produced);\n2. 3 models trained separately on each sub-corpus: pre-Soviet model, Soviet model and post-Soviet model;\n3. 2 models trained incrementally (initialized from the checkpoint of the model trained on texts from the previous time period): Soviet incremental model and post-Soviet incremental model.\nWe extract ELMo token embeddings for each word’s usage in two adjacent time periods and estimate semantic change score for this word using the measures described below. Extracted contextualized embeddings of each target word from two time periods are represented as two time-specific matrices. We explored two semantic change detection measures: cosine similarity between averaged token embeddings4 and Jensen-Shannon divergence which requires prior application of the clustering algorithm.\n1. Cosine similarity. We compute average vectors from usage matrices, which gives us representations which resemble static type embeddings. Then we compute cosine similarity between these average embeddings as a measure of semantic change. The lower is the cosine similarity, the higher is the degree of semantic change.\n2. Jensen-Shannon divergence (JSD). In this measure, influenced by (Martinc et al., 2020) and (Giulianelli et al., 2020), word usage matrices from two time periods are first stacked into one matrix with indexing that indicates time period. Then, we standardize the vectors and obtain word usage clusters of token embeddings using the Affinity Propagation clustering algorithm (Frey and Dueck, 2007). After obtaining clusters for each word we calculate usage type (sense) probability distributions for each time period by normalizing counts of word usages in the clusters. Then we compute the JSD score:\nJSD =\n√ D(p ‖ m) +D(q ‖ m)\n2 (1)\nwhere D is the Kullback-Leibler divergence, p and q are sense distributions and m is the pointwise mean of p and q. Higher JSD score indicates more intense change in the proportions of clustered word usage types across time periods.\nTable 4 shows that incremental and separate ELMo models do not yield significant correlations with human judgments. As for the single model, it consistently outperforms the static embeddings on RuSemShift2 (both metrics), and RuSemShift1 (∆LATER): thus, in 3 out of 4 cases. As already\n4This was not used with separately trained models, because it does not make sense to directly measure it between vectors from two different spaces.\nobserved, COMPARE metrics is easier to approximate than ∆LATER. Also, cosine similarity generally is better than JSD, despite the latter being much heavier computationally. Negative correlations with ∆LATER are normal and caused by the nature of this metrics: higher values indicate stronger change."
    }, {
      "heading" : "6 Conclusion",
      "text" : "We presented RuSemShift, which consists of two publicly available test sets of Russian words manually annotated with the degrees of diachronic semantic change they experienced (the degree is a continuous score). Annotation process was based on theoretically sound DURel framework (Schlechtweg et al., 2018). One of the datasets is produced from re-annotated list of target words from prior work and another is completely new. The datasets allow to evaluate methods for lexical semantic change detection in Russian: either graded or binary (with any desired binarization threshold). They provide data on 3 large time periods: pre-Soviet (1682-1916), Soviet (1918-1990) and post-Soviet (1991-2017).\nThis is the first semantic change detection dataset for Russian created in a large-scale crowd-sourcing annotation effort. It is also important that RuSemShift is fully compatible with semantic change datasets developed for other languages, for example those presented for the corresponding SemEval-2020 shared task (Schlechtweg et al., 2020).\nAs a sanity check (and to establish the baseline performance boundaries), we evaluated several semantic change modeling systems on RuSemShift. We managed to achieve significant correlation with human judgments both with static and with contextualized word embeddings, with the latter consistently outperforming the former. At the same time, simple frequency-based baseline failed to achieve any meaningful results, which is a good sign.\nRuSemShift is limited to nouns and a few adjectives. One of the possible future research directions is to extend the dataset with other parts of speech. Another drawback of the dataset is that it does not distinguish between different types of semantic change (e.g. narrowing, widening, metaphorization etc.). Nevertheless, we hope that in its current state, RuSemShift will already be of help to the researchers interested in tracing diachronic semantic shifts in Russian.\nThe dataset itself and the accompanying code will be made available online under a permissive licence upon acceptance of the paper."
    } ],
    "references" : [ {
      "title" : "Data statements for natural language processing: Toward mitigating system bias and enabling better science",
      "author" : [ "Emily M. Bender", "Batya Friedman." ],
      "venue" : "Transactions of the Association for Computational Linguistics, 6:587– 604.",
      "citeRegEx" : "Bender and Friedman.,? 2018",
      "shortCiteRegEx" : "Bender and Friedman.",
      "year" : 2018
    }, {
      "title" : "Choosing Sense Distinctions for WSD: Psycholinguistic Evidence",
      "author" : [ "Susan Windisch Brown." ],
      "venue" : "Proceedings of ACL-08: HLT, Short Papers, pages 249–252, Columbus, Ohio, June. Association for Computational Linguistics.",
      "citeRegEx" : "Brown.,? 2008",
      "shortCiteRegEx" : "Brown.",
      "year" : 2008
    }, {
      "title" : "Novye slova i znacheniya",
      "author" : [ "Tatiana Burtseva", "Evgeniy Levashov", "Yuri Denisenko." ],
      "venue" : "Slovar’-spravochnik po materialam pressy i literatury 90-h godov XX veka: V 2 tomah [New words and meanings. Reference dictionary by the materials of the press and literature in the 90’s of the XX century: in 2 volumes]. Institute for Linguistic Studies of the Russian Academy of Sciences.",
      "citeRegEx" : "Burtseva et al\\.,? 2009",
      "shortCiteRegEx" : "Burtseva et al\\.",
      "year" : 2009
    }, {
      "title" : "Dva veka v dvadtsati slovax [Two centuries in twenty words",
      "author" : [ "Mihael Daniel", "Nina Dobrushina." ],
      "venue" : "Izdatelskij dom NIU VSHE.",
      "citeRegEx" : "Daniel and Dobrushina.,? 2016",
      "shortCiteRegEx" : "Daniel and Dobrushina.",
      "year" : 2016
    }, {
      "title" : "Data Conversion and Consistency of Monolingual Corpora: Russian UD Treebanks",
      "author" : [ "Kira Droganova", "Olga Lyashevskaya", "Daniel Zeman." ],
      "venue" : "Proceedings of the 17th international workshop on treebanks and linguistic theories, pages 52–65, Oslo University, Norway.",
      "citeRegEx" : "Droganova et al\\.,? 2018",
      "shortCiteRegEx" : "Droganova et al\\.",
      "year" : 2018
    }, {
      "title" : "Tracing cultural diachronic semantic shifts in Russian using word embeddings: test sets and baselines",
      "author" : [ "Vadim Fomin", "Daria Bakshandaeva", "Julia Rodina", "Andrey Kutuzov." ],
      "venue" : "Komp’yuternaya Lingvistika i Intellektual’nye Tekhnologii: Dialog conference, pages 203–218, Moscow, Russia.",
      "citeRegEx" : "Fomin et al\\.,? 2019",
      "shortCiteRegEx" : "Fomin et al\\.",
      "year" : 2019
    }, {
      "title" : "Clustering by passing messages between data points",
      "author" : [ "Brendan Frey", "Delbert Dueck." ],
      "venue" : "Science, 315(5814):972–976.",
      "citeRegEx" : "Frey and Dueck.,? 2007",
      "shortCiteRegEx" : "Frey and Dueck.",
      "year" : 2007
    }, {
      "title" : "Analysing lexical semantic change with contextualised word representations",
      "author" : [ "Mario Giulianelli", "Marco Del Tredici", "Raquel Fernández." ],
      "venue" : "Proceedings of the 58th Annual Meeting of the Association for Computational Linguistics, pages 3960–3973, Online, July. Association for Computational Linguistics.",
      "citeRegEx" : "Giulianelli et al\\.,? 2020",
      "shortCiteRegEx" : "Giulianelli et al\\.",
      "year" : 2020
    }, {
      "title" : "Cultural Shift or Linguistic Drift? Comparing two computational measures of semantic change",
      "author" : [ "William Hamilton", "Jure Leskovec", "Dan Jurafsky." ],
      "venue" : "Proceedings of the 2016 Conference on Empirical Methods in Natural Language Processing, pages 2116–2121, Austin, Texas. Association for Computational Linguistics.",
      "citeRegEx" : "Hamilton et al\\.,? 2016",
      "shortCiteRegEx" : "Hamilton et al\\.",
      "year" : 2016
    }, {
      "title" : "Distribution de la Flore Alpine: dans le Bassin des dranses et dans quelques régions voisines",
      "author" : [ "Paul Jaccard." ],
      "venue" : "Rouge.",
      "citeRegEx" : "Jaccard.,? 1901",
      "shortCiteRegEx" : "Jaccard.",
      "year" : 1901
    }, {
      "title" : "Rank correlation methods",
      "author" : [ "Maurice George Kendall." ],
      "venue" : "Griffin.",
      "citeRegEx" : "Kendall.,? 1948",
      "shortCiteRegEx" : "Kendall.",
      "year" : 1948
    }, {
      "title" : "Content analysis: An introduction to its methodology",
      "author" : [ "K. Krippendorff." ],
      "venue" : "Sage.",
      "citeRegEx" : "Krippendorff.,? 2012",
      "shortCiteRegEx" : "Krippendorff.",
      "year" : 2012
    }, {
      "title" : "Two centuries in two thousand words: Neural embedding models in detecting diachronic lexical changes",
      "author" : [ "Andrey Kutuzov", "Elizaveta Kuzmenko." ],
      "venue" : "Quantitative Approaches to the Russian Language, pages 95–112.",
      "citeRegEx" : "Kutuzov and Kuzmenko.,? 2018",
      "shortCiteRegEx" : "Kutuzov and Kuzmenko.",
      "year" : 2018
    }, {
      "title" : "To Lemmatize or Not to Lemmatize: How Word Normalisation Affects ELMo Performance in Word Sense Disambiguation",
      "author" : [ "Andrey Kutuzov", "Elizaveta Kuzmenko." ],
      "venue" : "Proceedings of the First NLPL Workshop on Deep Learning for Natural Language Processing, pages 22–28, Turku, Finland.",
      "citeRegEx" : "Kutuzov and Kuzmenko.,? 2019",
      "shortCiteRegEx" : "Kutuzov and Kuzmenko.",
      "year" : 2019
    }, {
      "title" : "Diachronic word embeddings and semantic shifts: a survey",
      "author" : [ "Andrey Kutuzov", "Lilja Øvrelid", "Terrence Szymanski", "Erik Velldal." ],
      "venue" : "Proceedings of the 27th International Conference on Computational Linguistics, pages 1384–1397. Association for Computational Linguistics.",
      "citeRegEx" : "Kutuzov et al\\.,? 2018",
      "shortCiteRegEx" : "Kutuzov et al\\.",
      "year" : 2018
    }, {
      "title" : "Capturing evolution in word usage: Just add more clusters",
      "author" : [ "Matej Martinc", "Syrielle Montariol", "Elaine Zosa", "Lidia Pivovarova" ],
      "venue" : "In Companion Proceedings of the International World Wide Web Conference,",
      "citeRegEx" : "Martinc et al\\.,? \\Q2020\\E",
      "shortCiteRegEx" : "Martinc et al\\.",
      "year" : 2020
    }, {
      "title" : "Distributed representations of words and phrases and their compositionality",
      "author" : [ "Tomas Mikolov", "Ilya Sutskever", "Kai Chen", "Greg S Corrado", "Jeff Dean." ],
      "venue" : "Advances in Neural Information Processing Systems 26, pages 3111–3119.",
      "citeRegEx" : "Mikolov et al\\.,? 2013",
      "shortCiteRegEx" : "Mikolov et al\\.",
      "year" : 2013
    }, {
      "title" : "K voprosu ob izmenenijax russkogo iazyka v sovetskuju epoxu [About changes in russian language in the soviet era",
      "author" : [ "Sergey Ozhegov." ],
      "venue" : "Voprosy yazykoznanija, 2:71–82.",
      "citeRegEx" : "Ozhegov.,? 1953",
      "shortCiteRegEx" : "Ozhegov.",
      "year" : 1953
    }, {
      "title" : "Deep Contextualized Word Representations",
      "author" : [ "Matthew Peters", "Mark Neumann", "Mohit Iyyer", "Matt Gardner", "Christopher Clark", "Kenton Lee", "Luke Zettlemoyer." ],
      "venue" : "Proceedings of the 2018 Conference of the North American Chapter of the Association for Computational Linguistics: Human Language Technologies, Volume 1 (Long Papers), pages 2227–2237, New Orleans, Louisiana. Association for Computational Linguistics.",
      "citeRegEx" : "Peters et al\\.,? 2018",
      "shortCiteRegEx" : "Peters et al\\.",
      "year" : 2018
    }, {
      "title" : "Diachronic Usage Relatedness (DURel): A Framework for the Annotation of Lexical Semantic Change",
      "author" : [ "Dominik Schlechtweg", "Sabine Schulte im Walde", "Stefanie Eckmann." ],
      "venue" : "Proceedings of the 2018 Conference of the North American Chapter of the Association for Computational Linguistics: Human Language Technologies, Volume 2 (Short Papers), pages 169–174, New Orleans, Louisiana, June. Association for Computational Linguistics.",
      "citeRegEx" : "Schlechtweg et al\\.,? 2018",
      "shortCiteRegEx" : "Schlechtweg et al\\.",
      "year" : 2018
    }, {
      "title" : "SemEval-2020 Task 1: Unsupervised Lexical Semantic Change Detection",
      "author" : [ "Dominik Schlechtweg", "Barbara McGillivray", "Simon Hengchen", "Haim Dubossarsky", "Nina Tahmasebi." ],
      "venue" : "To appear in Proceedings of the 14th International Workshop on Semantic Evaluation, Barcelona, Spain. Association for Computational Linguistics.",
      "citeRegEx" : "Schlechtweg et al\\.,? 2020",
      "shortCiteRegEx" : "Schlechtweg et al\\.",
      "year" : 2020
    }, {
      "title" : "Tokenizing, POS Tagging, Lemmatizing and Parsing UD 2.0 with UDPipe",
      "author" : [ "Milan Straka", "Jana Straková" ],
      "venue" : "In Proceedings of the CoNLL",
      "citeRegEx" : "Straka and Straková.,? \\Q2017\\E",
      "shortCiteRegEx" : "Straka and Straková.",
      "year" : 2017
    }, {
      "title" : "A state-of-the-art of semantic change computation",
      "author" : [ "Xuri Tang." ],
      "venue" : "Natural Language Engineering, 24(5):649–676.",
      "citeRegEx" : "Tang.,? 2018",
      "shortCiteRegEx" : "Tang.",
      "year" : 2018
    }, {
      "title" : "Regularity in semantic change",
      "author" : [ "Elizabeth Traugott", "Richard Dasher." ],
      "venue" : "Cambridge University Press.",
      "citeRegEx" : "Traugott and Dasher.,? 2001",
      "shortCiteRegEx" : "Traugott and Dasher.",
      "year" : 2001
    } ],
    "referenceMentions" : [ {
      "referenceID" : 23,
      "context" : "As language units, words also evolve over time, undergoing diachronic (or temporal) semantic shifts which influence the relations between their forms and meanings (Traugott and Dasher, 2001).",
      "startOffset" : 163,
      "endOffset" : 190
    }, {
      "referenceID" : 14,
      "context" : "Thus, researchers are trying to model these processes using advanced computational approaches often based on distributional semantics and dense word embeddings (Kutuzov et al., 2018; Tang, 2018).",
      "startOffset" : 160,
      "endOffset" : 194
    }, {
      "referenceID" : 22,
      "context" : "Thus, researchers are trying to model these processes using advanced computational approaches often based on distributional semantics and dense word embeddings (Kutuzov et al., 2018; Tang, 2018).",
      "startOffset" : 160,
      "endOffset" : 194
    }, {
      "referenceID" : 20,
      "context" : "Recently, consistently annotated lexical semantic change test sets for other languages started to appear; see, for example, (Schlechtweg et al., 2020).",
      "startOffset" : 124,
      "endOffset" : 150
    }, {
      "referenceID" : 19,
      "context" : "RuSemShift is the first historical semantic change dataset for Russian annotated in the DURel framework (Schlechtweg et al., 2018) using a large crowd-sourcing platform, instead of personal intuitions of particular researchers.",
      "startOffset" : 104,
      "endOffset" : 130
    }, {
      "referenceID" : 10,
      "context" : "They concluded that Kendall’s τ (Kendall, 1948) and Jaccard similarity (Jaccard, 1901) between nearest neighbors list worked best in scoring changes.",
      "startOffset" : 32,
      "endOffset" : 47
    }, {
      "referenceID" : 9,
      "context" : "They concluded that Kendall’s τ (Kendall, 1948) and Jaccard similarity (Jaccard, 1901) between nearest neighbors list worked best in scoring changes.",
      "startOffset" : 71,
      "endOffset" : 86
    }, {
      "referenceID" : 12,
      "context" : "First, they are either produced by a single person (Kutuzov and Kuzmenko, 2018) or annotated by the paper authors themselves (Fomin et al.",
      "startOffset" : 51,
      "endOffset" : 79
    }, {
      "referenceID" : 5,
      "context" : "First, they are either produced by a single person (Kutuzov and Kuzmenko, 2018) or annotated by the paper authors themselves (Fomin et al., 2019).",
      "startOffset" : 125,
      "endOffset" : 145
    }, {
      "referenceID" : 12,
      "context" : "In addition, the test set from (Kutuzov and Kuzmenko, 2018) features only binary labels (shifted or stable), making it useless for research in graded semantic change detection.",
      "startOffset" : 31,
      "endOffset" : 59
    }, {
      "referenceID" : 19,
      "context" : "In it, we adhered to the language-agnostic semantic change annotation methodology Diachronic Usage Relatedness (DURel) proposed in (Schlechtweg et al., 2018).",
      "startOffset" : 131,
      "endOffset" : 157
    }, {
      "referenceID" : 20,
      "context" : "In addition, English, German, Latin and Swedish test sets used in the SemEval-2020 shared task on unsupervised lexical semantic change detection (Schlechtweg et al., 2020) also were created following the same approach.",
      "startOffset" : 145,
      "endOffset" : 171
    }, {
      "referenceID" : 1,
      "context" : "DURel employs the idea of usage relatedness borrowed from synchronic research on word sense disambiguation task (Brown, 2008).",
      "startOffset" : 112,
      "endOffset" : 125
    }, {
      "referenceID" : 0,
      "context" : "It can be looked at as the beginning of data statement (Bender and Friedman, 2018) for RuSemShift.",
      "startOffset" : 55,
      "endOffset" : 82
    }, {
      "referenceID" : 12,
      "context" : "RuSemShift covers 3 time periods of Russian language history, following (Kutuzov and Kuzmenko, 2018):",
      "startOffset" : 72,
      "endOffset" : 100
    }, {
      "referenceID" : 12,
      "context" : "The original target word list for the first pair of time bins was created in (Kutuzov and Kuzmenko, 2018).",
      "startOffset" : 77,
      "endOffset" : 105
    }, {
      "referenceID" : 3,
      "context" : "The words were collected from theoretical linguistic research on lexical semantic change (Daniel and Dobrushina, 2016; Ozhegov, 1953), 38 of them are nouns and 5 are adjectives.",
      "startOffset" : 89,
      "endOffset" : 133
    }, {
      "referenceID" : 17,
      "context" : "The words were collected from theoretical linguistic research on lexical semantic change (Daniel and Dobrushina, 2016; Ozhegov, 1953), 38 of them are nouns and 5 are adjectives.",
      "startOffset" : 89,
      "endOffset" : 133
    }, {
      "referenceID" : 12,
      "context" : "We emphasize again that only the changed word list was taken from (Kutuzov and Kuzmenko, 2018), the fillers and annotations were recreated from scratch by us.",
      "startOffset" : 66,
      "endOffset" : 94
    }, {
      "referenceID" : 19,
      "context" : "value English judgments from (Schlechtweg et al., 2018) Judgments translated into Russian",
      "startOffset" : 29,
      "endOffset" : 55
    }, {
      "referenceID" : 2,
      "context" : "It also contains manually chosen target words (35 nouns and 7 adjectives), primarily from the ‘New Words and Meanings’ dictionary (Burtseva et al., 2009).",
      "startOffset" : 130,
      "endOffset" : 153
    }, {
      "referenceID" : 19,
      "context" : "Note that in the DURel dataset (Schlechtweg et al., 2018), all five annotators were students of linguistics and two of them had historical background, which cannot be enforced when using crowd-sourcing platforms.",
      "startOffset" : 31,
      "endOffset" : 57
    }, {
      "referenceID" : 11,
      "context" : "After all pairs of sentences were annotated, we measured inter-rater agreement as Krippendorff’s Alpha (Krippendorff, 2012) with ordinal scale, excluding 0-judgements.",
      "startOffset" : 103,
      "endOffset" : 123
    }, {
      "referenceID" : 19,
      "context" : "As stated in (Schlechtweg et al., 2018), the ∆LATER metric can miss semantic changes if a word loses old sense and gains a new one within one time period, while the COMPARE metric tends to mix up polysemy with semantic change because of random choice of samples.",
      "startOffset" : 13,
      "endOffset" : 39
    }, {
      "referenceID" : 18,
      "context" : "After that, we tried several variations of contextualized embeddings, namely ELMo (Peters et al., 2018).",
      "startOffset" : 82,
      "endOffset" : 103
    }, {
      "referenceID" : 8,
      "context" : "Prior to that, the models were aligned using Orthogonal Procrustes as described in (Hamilton et al., 2016).",
      "startOffset" : 83,
      "endOffset" : 106
    }, {
      "referenceID" : 18,
      "context" : "We trained ELMo (Peters et al., 2018) models on RNC to produce contextualized word representations in each time period.",
      "startOffset" : 16,
      "endOffset" : 37
    }, {
      "referenceID" : 4,
      "context" : "All corpora were segmented into sentences, tokenized and lemmatized with Universal Dependencies (UD) model trained on SynTagRus (Droganova et al., 2018) using UDPipe 1.",
      "startOffset" : 128,
      "endOffset" : 152
    }, {
      "referenceID" : 15,
      "context" : "In this measure, influenced by (Martinc et al., 2020) and (Giulianelli et al.",
      "startOffset" : 31,
      "endOffset" : 53
    }, {
      "referenceID" : 7,
      "context" : ", 2020) and (Giulianelli et al., 2020), word usage matrices from two time periods are first stacked into one matrix with indexing that indicates time period.",
      "startOffset" : 12,
      "endOffset" : 38
    }, {
      "referenceID" : 6,
      "context" : "Then, we standardize the vectors and obtain word usage clusters of token embeddings using the Affinity Propagation clustering algorithm (Frey and Dueck, 2007).",
      "startOffset" : 136,
      "endOffset" : 158
    }, {
      "referenceID" : 19,
      "context" : "Annotation process was based on theoretically sound DURel framework (Schlechtweg et al., 2018).",
      "startOffset" : 68,
      "endOffset" : 94
    }, {
      "referenceID" : 20,
      "context" : "It is also important that RuSemShift is fully compatible with semantic change datasets developed for other languages, for example those presented for the corresponding SemEval-2020 shared task (Schlechtweg et al., 2020).",
      "startOffset" : 193,
      "endOffset" : 219
    } ],
    "year" : 2020,
    "abstractText" : "We present RuSemShift: a large-scale manually annotated test set for the task of semantic change modeling in Russian for two long-term time period pairs: from the pre-Soviet through the Soviet times and from the Soviet through the post-Soviet times. Target words were annotated by multiple crowd-source workers. The annotation process was organized following the DURel framework and was based on sentence contexts extracted from Russian National Corpus. We also report the performance of several distributional approaches on RuSemShift, achieving promising results, which at the same time leave room for future researchers to improve them.",
    "creator" : "LaTeX with hyperref"
  }
}