[{"rid": "089fa4b7f0e4265532d65b1eea05ac48c8b82e01358b15feea59cf8855580971154b1b47fe6ad58eed10e64e8b2d89d6aa582d55e183b9fe28b3b25ec81b4fa8", "reviewer": "Abhik Jana", "report": {"paper_summary": "In this work, the authors introduced a multi-lingual benchmark for the development and testing of bias-mitigation models or algorithms for legal text, namely FairLex. They have dealt with four datasets covering four jurisdictions, five languages, and various sensitive attributes.  They have provided competitive baselines implemented with state-of-the-art transformer-based models. As per the experimental results, we cannot identify a single algorithm that performs better across datasets. ", "summary_of_strengths": "This work deals with an interesting problem of fairness in legal text processing. The proposed benchmark would be very useful in this direction of research.  Choosing the datasets covering four different jurisdictions and five different languages could motivate to build generalized models as well. Overall, the paper is nicely written, easy to follow. ", "summary_of_weaknesses": "Nothing as such!! ", "comments,_suggestions_and_typos": "Nothing as such!! "}, "scores": {"overall": "4 = Strong: This paper is of significant interest (for broad or narrow sub-communities), and warrants acceptance in a top-tier *ACL venue if space allows.", "best_paper": "No", "replicability": "5 = They could easily reproduce the results.", "datasets": "5 = Enabling: The newly released datasets should affect other people's choice of research or development projects to undertake.", "software": "5 = Enabling: The newly released software should affect other people's choice of research or development projects to undertake."}, "meta": {"license": "Copyright © 2021 administered by the Association for Computational Linguistics (ACL)\n                                on behalf of ACL content contributors: Abhik Jana, and other contributors who wish to remain anonymous.\n                                Content is made available under a Creative Commons Attribution 4.0 International Public License.", "author_identity_guess": "1 = I do not have even an educated guess about author identity.", "confidence": "2 =  Willing to defend my evaluation, but it is fairly likely that I missed some details, didn't understand some central points, or can't be sure about the novelty of the work.", "sentences": {"paper_summary": [[0, 167], [167, 281], [281, 383], [383, 492]], "summary_of_strengths": [[0, 82], [82, 157], [157, 299], [299, 353]], "summary_of_weaknesses": [[0, 18]], "comments,_suggestions_and_typos": [[0, 18]]}}}]