[{"rid": "934822c7b982ef5cfe17e7d1a2c33eafa60d1ef26762879d7a09251d7b327197a9e94d1a9c3709b4dbf11194a20aba20b0b3425f336f4d6e1e81b2096cb47ed1", "reviewer": null, "report": {"paper_summary": "This paper tries to answer the question: `what kinds of synthetic data contributes to BT performance? ` The authors identify two factors that affect the performance: quality and importance. The authors propose a simple yet effective method to generate synthetic data for better translation performance. ", "summary_of_strengths": "The authors analyzed the BT data both theoretically and practically. \nDefined two important factors: quality, importance, from a theoretical perspective, to better understand the BT performance. \nProposed a simple yet effective method to improve BT performance. ", "summary_of_weaknesses": "1. It's not intuitive that the `importance` and `quality` are mutually exclusive. I assume the `importance` somehow related to the diversity of BT data, and improve the robustness of MT model to noisy input. \n2. About the experiments, I realized that all experiments are carried out on xx to en directions, while en to xx directions are missing, which makes the results less convincing. \n3. Line 254. The authors utilize GPT to estimate the importance of x, which is reasonable. In such scenario, comparing with a GPT-based (pretrained) translation baseline would be more fair since additional information was introduced. ", "comments,_suggestions_and_typos": "See weaknesses "}, "scores": {"overall": "3 = Good: This paper makes a reasonable contribution, and might be of interest for some (broad or narrow) sub-communities, possibly with minor revisions.", "best_paper": "No", "datasets": "1 = No usable datasets submitted.", "software": "1 = No usable software released."}, "meta": {"license": "Copyright © 2021 administered by the Association for Computational Linguistics (ACL)\n                                on behalf of ACL content contributors: None, and other contributors who wish to remain anonymous.\n                                Content is made available under a Creative Commons Attribution 4.0 International Public License.", "author_identity_guess": "1 = I do not have even an educated guess about author identity.", "confidence": "5 = Positive that my evaluation is correct. I read the paper very carefully and am familiar with related work.", "sentences": {"paper_summary": [[0, 102], [102, 190], [190, 303]], "summary_of_strengths": [[0, 69], [69, 195], [195, 262]], "summary_of_weaknesses": [[0, 3], [3, 82], [82, 208], [208, 212], [212, 387], [387, 391], [391, 401], [401, 479], [479, 622]], "comments,_suggestions_and_typos": [[0, 15]]}}}]