[{"rid": "7e2200824612618fbf0a558af825af392cd8713b22b910256bbc865b254ddebb2f3e41e0ceb81dccf49fb193be3ff8ce8cf46121c365b4bd8a37f9a76c6358b0", "reviewer": null, "report": {"paper_summary": "This paper introduces an approach to improve code language models so that the code they produce is compilable. The approach involves two techniques: 1) it uses policy gradients with KL-control _alla_ Ziegler et al. (2018) by translating the compiler's output into a +1/-1 reward. 2) it uses the generated sequences to train a discriminator that learns to detect whether a sequence compiles or not. Interestingly, the generator backpropagates into the generators' representation, possibly allowing it to learn to encode features that inform a sequence's compilability and which are useful to the generator. ", "summary_of_strengths": "1. While the RL approach is the same as in Ziegler et al. (2018), the joint training of the discriminator with the generator looks rather novel and even an exciting development. \n2. The evaluation takes care to evaluate not only compilability but also the generalization of the model and its general fluency. \n3. The results look strong (but lookout for some caveats below) ", "summary_of_weaknesses": "1. There is no associated code that could guarantee the reproducibility of these results. \n2. The evaluation is done on (as far as I can see) no standard splits of the datasets. Without making these splits available, future work will not be able to compare to these results. \n3. The compared methods are not on equal grounds. The proposed approach does a beam search (with k=5) using the discriminator output to select compilable sequences. For the comparison to be fairer, the authors could consider extracting k=5 samples from the other models and filter for the ones that compile (+ use the model probabilities to break ties) or, almost equivalently, doing rejection sampling on the distribution P(c)*1[compiler(c)]. One can argue that this gives an advantage to the baselines because they have access to the compiler, but on the other hand, it would be possible to train an independent discriminator that predicts whether a sequence compiles or not, as it was done for the proposed model, and no access to the compiler would be needed. Alternatively, IR metrics such as MAP or Prec@k could be used. \n4. The claim that this is the first work to integrate the compiler feedback to improve compilability is not correct. Korbak et al. (2021) cited at the end of the related work section also learn from the compiler feedback signal. While this could be easily amended, it would be better if this paper would compare their approach to this earlier work for the task studied in this other study, namely, the code completion task. ", "comments,_suggestions_and_typos": "Other comments: 1. Levenshtein is a distance metric (lower is better), not a similarity (higher is better) one afaik. It would be good if the authors explained how the authors convert Levenshtein distance into similarity (I have checked the cited paper, and it does not provide any clue neither). \n2. L337: It's not clear why the authors chose to use 41k pairs and not the full dataset.\nTypos/grammar/etc (not exhaustive): (in general) \"code\" is uncountable in English. I believe you cannot say \"codes\". \nL101: comprehensive experiment -> comprehensive experiments L231: This fine-tuning process incorporates a (..) discriminator will... -> which will L240: We hope the generator will have more perceiving to -> more perception power? \nL298: same as above Eq. 8: c in the summation is not used anywhere in the terms. Does it expand into t and s? Please, clarify. "}, "scores": {"overall": "2.5 ", "best_paper": "No", "replicability": "2 = They would be hard pressed to reproduce the results: The contribution depends on data that are simply not available outside the author's institution or consortium and/or not enough details are provided.", "datasets": "1 = No usable datasets submitted.", "software": "1 = No usable software released."}, "meta": {"license": "Copyright © 2021 administered by the Association for Computational Linguistics (ACL)\n                                on behalf of ACL content contributors: None, and other contributors who wish to remain anonymous.\n                                Content is made available under a Creative Commons Attribution 4.0 International Public License.", "author_identity_guess": "1 = I do not have even an educated guess about author identity.", "confidence": "4 = Quite sure. I tried to check the important points carefully. It's unlikely, though conceivable, that I missed something that should affect my ratings.", "sentences": {"paper_summary": [[0, 111], [111, 280], [280, 398], [398, 606]], "summary_of_strengths": [[0, 3], [3, 178], [178, 182], [182, 309], [309, 313], [313, 374]], "summary_of_weaknesses": [[0, 3], [3, 90], [90, 94], [94, 178], [178, 275], [275, 279], [279, 326], [326, 441], [441, 720], [720, 1040], [1040, 1103], [1103, 1107], [1107, 1221], [1221, 1333], [1333, 1528]], "comments,_suggestions_and_typos": [[0, 19], [19, 118], [118, 297], [297, 301], [301, 387], [387, 423], [423, 470], [470, 504], [504, 735], [735, 817], [817, 846], [846, 863]]}}}]