[{"rid": "4825eb030d8afb393c246a33e9d8a1f793b90ea88cb57ce09e675891f7d509d82c4b6cc50d7f8dc386a279b6854b3692285cbe651def3090bb02344787ef1b3f", "reviewer": "Chaojun Xiao", "report": {"paper_summary": "The authors focus on adversarial attacks on dialog systems. The authors first present a method that generates universal adversarial triggers with language model loss or selection criteria. The proposed attack method can generate natural-looking attacks. Furthermore, the authors propose a defense model, which can improve the robustness of conversational models. ", "summary_of_strengths": "1. The authors present a method to generate natural-looking attacks for dialog systems, with satisfactory coherency and relevancy. \n2. The proposed defender is effective for both adversarial agents and regular users. ", "summary_of_weaknesses": "1. The attack effectiveness of the proposed models seems to be limited, with no more than 50%. \n2. The authors only compare the proposed model with UAT. It would be more convincing if the authors can compare the proposed method with other competitive baselines. ", "comments,_suggestions_and_typos": "Please refer to the weaknesses. "}, "scores": {"overall": "3.5 ", "best_paper": "No", "datasets": "4 = Useful: I would recommend the new datasets to other researchers or developers for their ongoing work.", "software": "3 = Potentially useful: Someone might find the new software useful for their work."}, "meta": {"license": "Copyright © 2021 administered by the Association for Computational Linguistics (ACL)\n                                on behalf of ACL content contributors: Chaojun Xiao, and other contributors who wish to remain anonymous.\n                                Content is made available under a Creative Commons Attribution 4.0 International Public License.", "author_identity_guess": "1 = I do not have even an educated guess about author identity.", "confidence": "2 =  Willing to defend my evaluation, but it is fairly likely that I missed some details, didn't understand some central points, or can't be sure about the novelty of the work.", "sentences": {"paper_summary": [[0, 60], [60, 189], [189, 254], [254, 363]], "summary_of_strengths": [[0, 3], [3, 131], [131, 135], [135, 217]], "summary_of_weaknesses": [[0, 3], [3, 95], [95, 99], [99, 153], [153, 262]], "comments,_suggestions_and_typos": [[0, 32]]}}}]