[{"rid": "b534225047f18bbdcccd60249fa30bedb5b51bb7a1afc32075873c3a1d3be5b2821444eb29f42e68ea2f10fccd98a61f4f601df9f9be57ea6adea3f3d9267a3b", "reviewer": "Monjoy Saha", "report": {"paper_summary": "The authors proposed a Locally Aggregated Feature Attribution method and claimed that this is a novel gradient-based feature attribution method for NLP models. ", "summary_of_strengths": "The authors proposed a Locally Aggregated Feature Attribution method ", "summary_of_weaknesses": "Results are varying so much on two different datasets ", "comments,_suggestions_and_typos": "Did you use an attention mechanism? If yes, what are the significant changes you observed between the two approaches? If not, could you please check a performance comparison with any attention mechanism? \n Why are the results varying so much on two different datasets? Is your model biased on a particular data? Did you check the disparity and fairness of data? "}, "scores": {"overall": "4 = This paper represents solid work, and is of significant interest for the (broad or narrow) sub-communities that might build on it.", "best_paper": "Maybe", "datasets": "4 = Useful: I would recommend the new datasets to other researchers or developers for their ongoing work.", "software": "4 = Useful: I would recommend the new software to other researchers or developers for their ongoing work."}, "meta": {"license": "Copyright © 2021 administered by the Association for Computational Linguistics (ACL)\n                                on behalf of ACL content contributors: Monjoy Saha, and other contributors who wish to remain anonymous.\n                                Content is made available under a Creative Commons Attribution 4.0 International Public License.", "author_identity_guess": "1 = I do not have even an educated guess about author identity.", "confidence": "4 = Quite sure. I tried to check the important points carefully. It's unlikely, though conceivable, that I missed something that should affect my ratings.", "sentences": {"paper_summary": [[0, 160]], "summary_of_strengths": [[0, 69]], "summary_of_weaknesses": [[0, 54]], "comments,_suggestions_and_typos": [[0, 36], [36, 118], [118, 204], [204, 269], [269, 312], [312, 362]]}}}]