[{"rid": "1a43bd325a6abdae5c2b659964ce8941e40e52eaf9c58d5539eba732d5e7bacd90e16deb5536475f6af2b7dc195ba84db49e51c82b91b852ac249b3c4fb6a31c", "reviewer": "Yunfang Wu", "report": {"paper_summary": "This paper claims the Distinct’s bias that tends to pose higher penalties over longer sequences, and then fixes the bias by calculating the expectation of distinct tokens of a random text with the same length, and divide the origin Distinct value by it. They provide theoretical evidence to the formula, and do experiments on the dialog generation task to prove that the newDistinct correlates better with human evaluations. ", "summary_of_strengths": "1. As the paper mentioned, the idea is inspired by psychological linguistics, making it more convincing. \n2. This paper gives math analysis and derivation of the formula, making it more solid. \n3. The experiments prove the efficiency of the new Distinct. ", "summary_of_weaknesses": "1. In the results in Table 2, there is a large score gap between the newdistinct and original distinct for the system of AdaLab, please give more explanations. \n2. In Page 7, line 517~523, C can’t be so large that the limitation method can get a good enough result. Perhaps you need more accurate math to show that when C is not so big, for example, when C is only 5x or 10x of V, the derivative of NewDistinct is still bigger than the original Distinct. Besides, the conclusion “the bigger C is, the slower the original Distinct increases” is also right for NewDistinct. ", "comments,_suggestions_and_typos": "This paper is well written and is elegant. "}, "scores": {"overall": "4 = Strong: This paper is of significant interest (for broad or narrow sub-communities), and warrants acceptance in a top-tier *ACL venue if space allows.", "best_paper": "No", "replicability": "4 = They could mostly reproduce the results, but there may be some variation because of sample variance or minor variations in their interpretation of the protocol or method.", "datasets": "1 = No usable datasets submitted.", "software": "4 = Useful: I would recommend the new software to other researchers or developers for their ongoing work."}, "meta": {"license": "Copyright © 2021 administered by the Association for Computational Linguistics (ACL)\n                                on behalf of ACL content contributors: Yunfang Wu, and other contributors who wish to remain anonymous.\n                                Content is made available under a Creative Commons Attribution 4.0 International Public License.", "author_identity_guess": "1 = I do not have even an educated guess about author identity.", "confidence": "3 =  Pretty sure, but there's a chance I missed something. Although I have a good feel for this area in general, I did not carefully check the paper's details, e.g., the math or experimental design.", "sentences": {"paper_summary": [[0, 254], [254, 425]], "summary_of_strengths": [[0, 3], [3, 105], [105, 109], [109, 193], [193, 197], [197, 255]], "summary_of_weaknesses": [[0, 3], [3, 160], [160, 164], [164, 266], [266, 455], [455, 572]], "comments,_suggestions_and_typos": [[0, 43]]}}}]