[{"rid": "0a002bffe97e066700662691d4501cc2891b11564c66fd6ad3579891499dd7f10958eabf422336201db439e4d9f952535019dbeba172ed0258ec1cb3eed73f25", "reviewer": "Yao Zhang", "report": {"paper_summary": "This work focuses on video-grounded dialogue tasks. It points out that Neural module networks (NMN) have been widely used for image-grounded tasks, but has been neglected in video-grounded tasks. Therefore, this work adopts the NMN and proposes VGNMN which decomposes the task into a pipeline. This pipeline first decomposes the question and extracts video features, then assigns temporal video steps to the decomposed question, and finally generates a response. The experimental results demonstrate the effectiveness, interpretability and robustness of the proposed VGNMN.\nI have carefully reviewed the new version paper, the response, the previous paper, and the review. I am pleased to see the improvements the authors have made in reorganizing the paper, adding experimental results and analyses, etc. Nearly all of the concerns I and other reviewers raised were addressed. Therefore, I decide to raise the assessment score from the previous 3.5 to 4.\nThe contribution (or novelty) of this paper is convincing to me personally. In my opinion, the central contribution is the application of NMN to delicately deconstruct complex questions, rather than simply introducing NMNs. Moreover, the authors conduct a comprehensive experiment. The results are plausible given the authors’ explanations.\nIn addition, there are some minor concerns that could be addressed to further enhance this work: 1. \tThe experiment for inference time comparison should be added. \n2. \tMore detailed analysis of the cascading errors is necessary. \n3. \tThere exist more complex question types, e.g., compare, count. It would be valuable to explore the scalability of this work for these complex question types. ", "summary_of_strengths": "See the { Summary } part. ", "summary_of_weaknesses": "See the { Summary } part. ", "comments,_suggestions_and_typos": "See the { Summary } part. "}, "scores": {"overall": "4 = This paper represents solid work, and is of significant interest for the (broad or narrow) sub-communities that might build on it.", "best_paper": "No", "datasets": "1 = No usable datasets submitted.", "software": "1 = No usable software released."}, "meta": {"license": "Copyright © 2021 administered by the Association for Computational Linguistics (ACL)\n                                on behalf of ACL content contributors: Yao Zhang, and other contributors who wish to remain anonymous.\n                                Content is made available under a Creative Commons Attribution 4.0 International Public License.", "author_identity_guess": "1 = I do not have even an educated guess about author identity.", "confidence": "3 =  Pretty sure, but there's a chance I missed something. Although I have a good feel for this area in general, I did not carefully check the paper's details, e.g., the math or experimental design.", "sentences": {"paper_summary": [[0, 52], [52, 196], [196, 294], [294, 463], [463, 574], [574, 673], [673, 806], [806, 878], [878, 956], [956, 1032], [1032, 1180], [1180, 1238], [1238, 1297], [1297, 1394], [1394, 1397], [1397, 1460], [1460, 1464], [1464, 1526], [1526, 1530], [1530, 1594], [1594, 1689]], "summary_of_strengths": [[0, 26]], "summary_of_weaknesses": [[0, 26]], "comments,_suggestions_and_typos": [[0, 26]]}}}]