[{"rid": "de80fb5dcb7742d5deac72ad17f784d4f2402d16ce8127f954e5aed45500453a2562ebf5590b2fd934a95b4a4a38458099f90408c9bf145080d1a3131b9088bd", "reviewer": null, "report": {"paper_summary": "The paper described a set of approaches from unsupervised to weakly supervised to segment sentences into words and morphemes under an extremely low-resource setting. The approaches are tested on two languages currently (still) being documented.\nIt would be very interesting to follow the developments, should a system such as the presented one be implemented and used in actual fieldwork. Two of the points I can think of are the feedback from fieldworkers as well as the (hopefully) incremental precision of the system. It would also be extremely interesting to test how much input is needed to reach acceptable levels of automated segmentation. ", "summary_of_strengths": "The authors work in a low-resource setting, and their work is very valuable and could greatly help linguistic fieldworkers with (semi-)automatic segmentation of either recorded speech or transcripts.  The authors convincingly show that the chosen approach outperforms two not-so-simple baselines (SentencePiece and Morfessor).\nOverall, the language is mostly clear and the structure logical.\nIn response to one of the earlier reviews, the authors have added experiments with Morfessor, which is also highly laudable. ", "summary_of_weaknesses": "Unfortunately, the paper is very difficult to follow in parts particularly because of the extensive use of abbreviations.\nRegarding word vs morpheme, what exactly is the conclusion reached? It is not entirely clear, yet it seems to be one of the main questions in the paper.\nThe final sentence in the paper claims that the proposed algorithm may help speed up annotation processes, and as such must run fast. That holds only true if the algorithm is run on-the-fly, and if human annotators are used to incrementally teach the algorithm. Otherwise the algorithm can be run independently of the annotators; one could pre-segment all data automatically and then present it to annotators for correction. ", "comments,_suggestions_and_typos": "In line 165, you don't explain \"DP\", although it is recoverable through the context. "}, "scores": {"overall": "3.5 ", "best_paper": "No", "replicability": "4 = They could mostly reproduce the results, but there may be some variation because of sample variance or minor variations in their interpretation of the protocol or method.", "datasets": "1 = No usable datasets submitted.", "software": "3 = Potentially useful: Someone might find the new software useful for their work."}, "meta": {"license": "Copyright © 2021 administered by the Association for Computational Linguistics (ACL)\n                                on behalf of ACL content contributors: None, and other contributors who wish to remain anonymous.\n                                Content is made available under a Creative Commons Attribution 4.0 International Public License.", "author_identity_guess": "3 = From the contents of the submission itself, I know/can guess at least one author's name.", "confidence": "4 = Quite sure. I tried to check the important points carefully. It's unlikely, though conceivable, that I missed something that should affect my ratings.", "sentences": {"paper_summary": [[0, 166], [166, 245], [245, 389], [389, 521], [521, 647]], "summary_of_strengths": [[0, 200], [200, 201], [201, 327], [327, 392], [392, 517]], "summary_of_weaknesses": [[0, 122], [122, 190], [190, 275], [275, 409], [409, 537], [537, 700]], "comments,_suggestions_and_typos": [[0, 85]]}}}, {"rid": "7da87fbc09ca432853534fb954509bcfbb281e0157b3ab972a94cdc4b2de1506c33db6536c593c05371e635debb736d32c56dcfc075e48ed779db633476fefbf", "reviewer": null, "report": {"paper_summary": "This paper takes advantage of data (utterances, annotations) that is produced as part of language documentation to use for automatic linguistic segmentation, mainly at the word level. The authors worked with two languages that are still being documented Mboshi and Japhug. Both languages have data available but at different levels of granularity. They used Bayesian non-parametric approaches with different variations of the n-gram models and data used in addition to an incremental data training approach. The evaluation is reported in terms of F1 on three different segmentation levels (morphological boundary level, token level, and type-level). The discussion points out that the weakly supervised performs better than fully supervised and of course better than unsupervised. On the other hand, morpheme-based segmentation benefits more from underserviced training. ", "summary_of_strengths": "- The paper is well written and easy to follow.\n- The languages that were targeted are still being documented and they resemble a real low-resource setting.\n- The core approach is easy to follow and replicate. It lends itself to being easily explainable in terms of behavior and performance.\n- This effort can be helpful as an enabling technology for the language documentation process. ", "summary_of_weaknesses": "There are no major weaknesses in this version of the paper. \nThe weaknesses mentioned in the previous review have been addressed in the current version for the most part. ", "comments,_suggestions_and_typos": "I appreciate the authors taking the time to improve upon the paper. I believe this work would definitely facilitate the documentation process whether in progress or as a post-processing step. It would be really useful for a future version of this work to include a use case study on using this process and reporting how useful it was. This would definitely increase the value of this work among both NLP and language documentation communities. "}, "scores": {"overall": "4 = Strong: This paper is of significant interest (for broad or narrow sub-communities), and warrants acceptance in a top-tier *ACL venue if space allows.", "best_paper": "No", "replicability": "4 = They could mostly reproduce the results, but there may be some variation because of sample variance or minor variations in their interpretation of the protocol or method.", "datasets": "5 = Enabling: The newly released datasets should affect other people's choice of research or development projects to undertake.", "software": "5 = Enabling: The newly released software should affect other people's choice of research or development projects to undertake."}, "meta": {"license": "Copyright © 2021 administered by the Association for Computational Linguistics (ACL)\n                                on behalf of ACL content contributors: None, and other contributors who wish to remain anonymous.\n                                Content is made available under a Creative Commons Attribution 4.0 International Public License.", "author_identity_guess": "1 = I do not have even an educated guess about author identity.", "confidence": "4 = Quite sure. I tried to check the important points carefully. It's unlikely, though conceivable, that I missed something that should affect my ratings.", "sentences": {"paper_summary": [[0, 184], [184, 273], [273, 348], [348, 508], [508, 650], [650, 781], [781, 871]], "summary_of_strengths": [[0, 48], [48, 157], [157, 210], [210, 292], [292, 387]], "summary_of_weaknesses": [[0, 60], [60, 171]], "comments,_suggestions_and_typos": [[0, 68], [68, 192], [192, 335], [335, 444]]}}}, {"rid": "4b71ef5ed6c8af64772bcb6d6274a4af5fce058df82ca4593e4825002ce1701218b9be982e81fee4742e9ec63a3dc1da828bf095a8211e0f20b690ab084366fb", "reviewer": null, "report": {"paper_summary": "NOTE: This is my re-review of this submission. For that reason, this review will be much shorter and will focus on the resubmission with respect to my previous review. For my summary of the work, please see the initial review.\nThis version of the paper shows some small improvements over the previous submission, and my positive view of this paper remains positive. ", "summary_of_strengths": "The strengths of this paper remain the same as in my previous review, with the addition of a comparison to Morfessor as an important baseline for unsupervised word segmentation. Thanks for adding this - I was happy to see the results. ", "summary_of_weaknesses": "The authors have addressed 1.5 of the 2 weaknesses listed in my previous review. The remaining issue is perhaps one of personal preference, but I still feel some earlier discussion of the need for low-compute approaches to linguistic analysis would be appropriate.  Otherwise, thanks for addressing the concerns noted in the previous review. ", "comments,_suggestions_and_typos": "Nothing to note here. ", "ethical_concerns": "No ethical concerns "}, "scores": {"overall": "4 = Strong: This paper is of significant interest (for broad or narrow sub-communities), and warrants acceptance in a top-tier *ACL venue if space allows.", "best_paper": "No", "replicability": "4 = They could mostly reproduce the results, but there may be some variation because of sample variance or minor variations in their interpretation of the protocol or method.", "datasets": "1 = No usable datasets submitted.", "software": "4 = Useful: I would recommend the new software to other researchers or developers for their ongoing work."}, "meta": {"license": "Copyright © 2021 administered by the Association for Computational Linguistics (ACL)\n                                on behalf of ACL content contributors: None, and other contributors who wish to remain anonymous.\n                                Content is made available under a Creative Commons Attribution 4.0 International Public License.", "author_identity_guess": "3 = From the contents of the submission itself, I know/can guess at least one author's name.", "confidence": "4 = Quite sure. I tried to check the important points carefully. It's unlikely, though conceivable, that I missed something that should affect my ratings.", "sentences": {"paper_summary": [[0, 47], [47, 168], [168, 227], [227, 366]], "summary_of_strengths": [[0, 178], [178, 235]], "summary_of_weaknesses": [[0, 81], [81, 265], [265, 266], [266, 342]], "comments,_suggestions_and_typos": [[0, 22]], "ethical_concerns": [[0, 20]]}}}]