[{"rid": "f2b2affe077eb681cf80d31c0928c3fd120cbb3e4d7089b6d9ae44197032113b76920cf2938e7c2321aca5782db4fcfe1116f3bedd4f1803df19f50fd34fa94e", "reviewer": null, "report": {"paper_summary": "This paper proposes a text-to-SQL parser that can better utilize given alignments between text and SQL queries. Empirically, the proposed parser achieves the new state-of-the-art performance on the SQUALL dataset. ", "summary_of_strengths": "The usage of alignments as contexts is creative and coupled well with BERT-based encoding. The training method of noisy alignment augmentation is also interesting, and the way I view this is that it's an efficient way of \"marginalizing\" over all possible noisy alignments. ", "summary_of_weaknesses": "My main complaints are 1) the presentation of this work is a bit misleading to me, 2) I'm not convinced by the main arguments of this work.\nFor 1), it's not completely clear from early sections that this work focus on the setting where the gold alignments are given. I don't think this setting is the default text-to-SQL in the current literature, so it'd be better to clarify this as early as possible.  For 2), the main arguments of the proposed system are that attention cannot capture alignments well because it's at the token level. But isn't the sequence tagging model used is also at the token level?  The second argument is that attention is prone to overfitting. I'm not convinced that we should attribute the overfitting of current parsers to attention mechanisms, and this paper does not provide any justification.  Maybe the authors should emphasize their way of incorporating alignments (alignments as context, and alignment augmentation), which I think are the main contribution of this work. ", "comments,_suggestions_and_typos": "The two-stage process is very related to [1]. In general, the paper perhaps should also mention the line of work that treat alignments as latent variables, e.g., [2, 3] - [1] Compositional Generalization via Semantic Tagging - [2] Span-based semantic parsing for compositional generalization - [3] Learning semantic parsers from denotations with latent structured alignments and abstract programs "}, "scores": {"overall": "3.5 ", "best_paper": "No", "replicability": "4 = They could mostly reproduce the results, but there may be some variation because of sample variance or minor variations in their interpretation of the protocol or method.", "datasets": "1 = No usable datasets submitted.", "software": "3 = Potentially useful: Someone might find the new software useful for their work."}, "meta": {"license": "Copyright © 2021 administered by the Association for Computational Linguistics (ACL)\n                                on behalf of ACL content contributors: None, and other contributors who wish to remain anonymous.\n                                Content is made available under a Creative Commons Attribution 4.0 International Public License.", "author_identity_guess": "1 = I do not have even an educated guess about author identity.", "confidence": "4 = Quite sure. I tried to check the important points carefully. It's unlikely, though conceivable, that I missed something that should affect my ratings.", "sentences": {"paper_summary": [[0, 112], [112, 214]], "summary_of_strengths": [[0, 91], [91, 273]], "summary_of_weaknesses": [[0, 140], [140, 267], [267, 404], [404, 405], [405, 538], [538, 608], [608, 672], [672, 826], [826, 827], [827, 1007]], "comments,_suggestions_and_typos": [[0, 46], [46, 169], [169, 225], [225, 292], [292, 397]]}}}]