[{"rid": "42ae5ac0b6ebf8dbeb0aacafa17347e79484894bf3755dc74179c72dc37a6c50f1ec70fcebe4c3d99626a87a96b3c794fad2694e04ff203897c71a6b4e97a96e", "reviewer": null, "report": {"paper_summary": "This paper investigates the effectiveness of an early stopping method that is designed to be effective in scenarios where there is a limited amount of labelled data where the prediction accuracy fluctuates highly during training. The early stopping method being presented is based on two considerations: the probabilities of the predicted class label, and the similarity of the output class distribution to the true class distribution.\nExperiments are presented involving 5  document classification datasets that show the extent to which the method being proposed is effective. Three of the datasets concern sentiment analysis and the other two involve classification on the basis of topic. ", "summary_of_strengths": "The scenario that this paper applies to (i.e. a situation where there is a limited quantity of labelled data) is an important one that arises frequently in many practical applications of NLP.\nThe overall method being proposed is sensible and the method is instantiated in a way that addresses a number of the complexities that arise.\nTwo types of document classification are considered: classification based on sentiment, and classification based on topic.\nThe paper is generally well written. ", "summary_of_weaknesses": "The major weakness of this paper is the fact that the proposed method does not appear to out-perform pre-existing methods by a particularly significant margin. Indeed, there is no discussion of the statistical significance of the differences that are observed. ", "comments,_suggestions_and_typos": "Some of the LaTeX could be improved in the mathematical formulas. In particular, situations where the names of functions involve multiple characters. "}, "scores": {"overall": "3.5 ", "best_paper": "No", "replicability": "4 = They could mostly reproduce the results, but there may be some variation because of sample variance or minor variations in their interpretation of the protocol or method.", "datasets": "1 = No usable datasets submitted.", "software": "3 = Potentially useful: Someone might find the new software useful for their work."}, "meta": {"license": "Copyright © 2021 administered by the Association for Computational Linguistics (ACL)\n                                on behalf of ACL content contributors: None, and other contributors who wish to remain anonymous.\n                                Content is made available under a Creative Commons Attribution 4.0 International Public License.", "author_identity_guess": "1 = I do not have even an educated guess about author identity.", "confidence": "3 =  Pretty sure, but there's a chance I missed something. Although I have a good feel for this area in general, I did not carefully check the paper's details, e.g., the math or experimental design.", "sentences": {"paper_summary": [[0, 230], [230, 436], [436, 578], [578, 691]], "summary_of_strengths": [[0, 192], [192, 334], [334, 457], [457, 494]], "summary_of_weaknesses": [[0, 160], [160, 261]], "comments,_suggestions_and_typos": [[0, 66], [66, 150]]}}}]