[{"rid": "1616a1ec4c7080f25f27005712c7704d81e7a036d1982351322335d808a52b1105b12530dc00a9a6d0bdcf3c7f8b6c4cb3b0ab93f29f156600bc35e07cb100a0", "reviewer": null, "report": {"paper_summary": "The paper looks at distilling models for abstractive summarization. The paper makes the claim that the most obvious way to do knowledge distillation with seq2seq models (just using the generated output from the teacher model as a target output for the student; also called pseudo-labeling), is problematic. The problems with pseudo-labeling relate to known but important to restate problems with current abstractive summarization models in general: they generally copy from the target document, and they generally only copy the leading line of the target document. The paper attributes the causes for both of these problems being at least in part due to the attention distribution for the teacher models being too sharp, often focusing most of its weight on the next available word. In order to counteract these effects, the paper proposes to raise the temperature for the attention soft max in order to smooth the attention distribution of the teacher model. The temperature scaling modifications are evaluated on three standard datasets (CNN/DM, XSum, and NYT), with slight improvements in distillation performance found across all three datasets. ", "summary_of_strengths": "- The paper is easy to read and follow - A lot of detail has been provided in the paper, making it quite easy for someone to be able to reproduce.  - Evaluations are done on reasonable datasets, against reasonable baselines, and shows promising results. Human evaluations are also provided - Abalations and additional comparisons with obvious baselines (like just using sampling in the teach model for generating pseudo labels) are done. ", "summary_of_weaknesses": "- There is unfortunately not a whole lot of new content in this paper. The proposed method really just boils down to playing with the temperature settings for the attention of the teacher model; something that is usually just considered a hyperparameter. While I have no problem with what is currently in the paper, I am just not sure that this is enough to form a long paper proposing a new method. I think if this paper couched itself as more of a 'analysis/experimental' type of paper, expanding its analysis even further (and maybe expanding its scope to other tasks besides just abstractive summarization), it could be solid contribution. Unfortunately, the paper is presented more as a 'methods' paper, with the new method being proposed simply being a change in hyperparameters. ", "comments,_suggestions_and_typos": "- What hypothesis test are you using for computing the significance in table 2 and 3?\n- Are there other tasks where temperature smoothing could be beneficial? ", "ethical_concerns": "None "}, "scores": {"overall": "2.5 ", "best_paper": "No", "replicability": "5 = They could easily reproduce the results.", "datasets": "1 = No usable datasets submitted.", "software": "1 = No usable software released."}, "meta": {"license": "Copyright © 2021 administered by the Association for Computational Linguistics (ACL)\n                                on behalf of ACL content contributors: None, and other contributors who wish to remain anonymous.\n                                Content is made available under a Creative Commons Attribution 4.0 International Public License.", "author_identity_guess": "1 = I do not have even an educated guess about author identity.", "confidence": "2 =  Willing to defend my evaluation, but it is fairly likely that I missed some details, didn't understand some central points, or can't be sure about the novelty of the work.", "sentences": {"paper_summary": [[0, 68], [68, 307], [307, 565], [565, 783], [783, 960], [960, 1150]], "summary_of_strengths": [[0, 39], [39, 147], [147, 148], [148, 254], [254, 290], [290, 438]], "summary_of_weaknesses": [[0, 71], [71, 255], [255, 400], [400, 644], [644, 786]], "comments,_suggestions_and_typos": [[0, 86], [86, 159]], "ethical_concerns": [[0, 5]]}}}, {"rid": "b1fb88206c3832e9f87e6f8115045f3478d45617776f8397f37664d4de722806db84bff9744f31328a47ad99443cf3b52355d950d9e6fa09b9747dbb3b9f4f21", "reviewer": "Sheng Shen", "report": {"paper_summary": "This paper proposes an extension of the pseudo-labeling method named PLATE for summarization distillation, extensive experiments on three datasets suggest the effectiveness of the proposed method versus vanilla sequence distillation. Ablation studies and empirical analysis reveal the performance gain may come from the diverse cross-attention distribution of the teacher model and concise and abstractive summaries generated from the teacher model. ", "summary_of_strengths": "The paper is well-motivated and clearly presented;  The authors extensively study the effect of Pseudo-labeling with Larger Attention TEmperature on various summarization tasks. Substantial ablation studies and empirical analyses are also provided for revealing the performance gain over baseline methods, which may help future studies understand how to conduct effective summarization distillation. \nThe findings of the diverse cross attention pattern, the conciseness, and abstractiveness of produced summarization pseudo-labels as well as the attention focus of the teacher model help future studies develop better summarization models. ", "summary_of_weaknesses": "From Table 6, the difference of attention pattern results in a great difference in novel-n-grams ratios and length in the generated teacher summarization, but this does not necessarily translate to a better student summarization system in Table 2, further explanation or better ablation studies might be needed to understand how the length, novel-n-grams ratio, the different dataset will affect the distillation effects.  Given that this paper focuses on sequence distillation, wondering how the beam size, length penalty of the teacher model will affect the sequence distillation results? ", "comments,_suggestions_and_typos": "It may be good to know if a better teacher model (BART-large, PEGASUS-large) produces better pseudo-labels for summarization distillation. "}, "scores": {"overall": "3.5 ", "best_paper": "No", "replicability": "4 = They could mostly reproduce the results, but there may be some variation because of sample variance or minor variations in their interpretation of the protocol or method.", "datasets": "1 = No usable datasets submitted.", "software": "4 = Useful: I would recommend the new software to other researchers or developers for their ongoing work."}, "meta": {"license": "Copyright © 2021 administered by the Association for Computational Linguistics (ACL)\n                                on behalf of ACL content contributors: Sheng Shen, and other contributors who wish to remain anonymous.\n                                Content is made available under a Creative Commons Attribution 4.0 International Public License.", "author_identity_guess": "4 = From an allowed pre-existing preprint or workshop paper, I know/can guess at least one author's name.", "confidence": "4 = Quite sure. I tried to check the important points carefully. It's unlikely, though conceivable, that I missed something that should affect my ratings.", "sentences": {"paper_summary": [[0, 234], [234, 450]], "summary_of_strengths": [[0, 178], [178, 400], [400, 640]], "summary_of_weaknesses": [[0, 422], [422, 423], [423, 591]], "comments,_suggestions_and_typos": [[0, 139]]}}}]