[{"rid": "6b76cb35bc2bd13024fa5031e7733115a1278893aa5eae6d2154a3330e74e75d15dc13b52c93f40283b13ef2fbe9cb7d7d1a390d1edecdf353e789a8db9ffa24", "reviewer": null, "report": {"paper_summary": "The paper creates a corpus of verbal negations and adapts QA-SRL to collect questions and answers regarding the arguments of the affirmative counterpart of a negated predicate, and manipulate them to generate the affirmative interpretation. They use the curated dataset to pose two challenges - classifying entailment and neutral relationship between the negation and its affirmative counterpart, and generating the affirmative interpretation directly. Experiments show that current models are unable to perform reasonably on the generation task, which is the more realistic setting. ", "summary_of_strengths": "The authors adapt a question answering approach to create an annotation scheme to create a corpus of verbal negations and their affirmative interpretations. The paper describes the full annotation process clearly, and the authors are careful to manually verify significant random samples of the corpus. The annotation process is designed to guide annotators to fill in template questions before answering them factually. These answers are used to create the affirmative interpretations. Further, they only retain the records where annotators are confident about their judgment. The authors perform well-designed experiments to establish benchmarks for the tasks they propose on their corpus. These experiments show that standard models are unable to perform the generation task as well as humans do. ", "summary_of_weaknesses": "1. While it is fair to say that two annotators might have different answers to the same question and both might be correct, it would be better to verify that the answers provided are all valid. The authors manually validate a small subset of the dataset but, for a high quality dataset, it would be better to validate all of it. \n2. The paper should include automatic metrics for the generation task. While the metrics have their own problems, it would be a good way to compare systems without expensive human evaluation. ", "comments,_suggestions_and_typos": "1. It would be good if you expand on the importance of the order of wh-words used for question generation. \n2. Line 112: Consider the ‘second’ example actually refers to the first example in Figure 1. \n3. I agree with the authors about the framing of the classification task, that it isn’t a realistic one. Maybe the paper would be better without it. "}, "scores": {"overall": "4 = Strong: This paper is of significant interest (for broad or narrow sub-communities), and warrants acceptance in a top-tier *ACL venue if space allows.", "best_paper": "No", "replicability": "4 = They could mostly reproduce the results, but there may be some variation because of sample variance or minor variations in their interpretation of the protocol or method.", "datasets": "3 = Potentially useful: Someone might find the new datasets useful for their work.", "software": "4 = Useful: I would recommend the new software to other researchers or developers for their ongoing work."}, "meta": {"license": "Copyright © 2021 administered by the Association for Computational Linguistics (ACL)\n                                on behalf of ACL content contributors: None, and other contributors who wish to remain anonymous.\n                                Content is made available under a Creative Commons Attribution 4.0 International Public License.", "author_identity_guess": "1 = I do not have even an educated guess about author identity.", "confidence": "4 = Quite sure. I tried to check the important points carefully. It's unlikely, though conceivable, that I missed something that should affect my ratings.", "sentences": {"paper_summary": [[0, 241], [241, 453], [453, 584]], "summary_of_strengths": [[0, 157], [157, 303], [303, 421], [421, 487], [487, 578], [578, 692], [692, 800]], "summary_of_weaknesses": [[0, 3], [3, 194], [194, 329], [329, 333], [333, 401], [401, 522]], "comments,_suggestions_and_typos": [[0, 3], [3, 107], [107, 111], [111, 201], [201, 205], [205, 307], [307, 351]]}}}]