[{"rid": "e1272fb808dce19b87e53d9978fc22d89103c6067847e3bb24f5010baed38676fc34e894621686463eceb89666c05f06e925bc83838c6c4ed54263fb3041ce9d", "reviewer": null, "report": {"paper_summary": "This paper proposes a new pre-trained variational encoder-decoder dialog model which has continuous latent variables to deal with the one-to-many mapping problem in dialogue response generation. \nThis paper conducts empirical experiments on 3 datasets to show their proposed model has better performances both on relevance and diversity than previous state-of-the-art dialog systems. \nThey also conducted additional analysis to show the impact of latent variable sizes, different decoding strategies and position embeddings for their proposed model. \nHowever, in the model evaluation part, the paper does not show how their model can generate diverse responses given the same context. ", "summary_of_strengths": "1. This paper proposes a new variational encoder-decoder dialog model for open-domain dialogue generation tasks, which shows better performance in terms of relevancy and diversity than previous state-of-the-art models. The new model leverages several techniques to better alleviate the one-to-many mapping problem in dialogue response generation, including conditional variational autoencoder, n-stream self-attention, memory scheme, masked language modeling, free bits and bag-of-words loss for reducing KL-vanishing, and position embeddings for Transformers. \n2. This paper conducts empirical experiments on three benchmark datasets to validate the effectiveness of the proposed model. The proposed model achieves better performances than previous baselines (e.g. PLATO) in both automatic metrics (e.g. BLEU-1/2, Distinct-1/2) and human evaluation (fluency, coherence, informativeness, overall). \n3. This paper analyzes the effect of latent variable sizes, sizes of K in top-k sampling and different combinations of position embeddings, which are helpful empirical observations for training Transformer-based variational encoder-decoders. ", "summary_of_weaknesses": "1. This paper lacks a discussion on its novelty, e.g., why continuous latent variables are better than discrete latent variables for solving the one-to-many mapping problem. Though empirically the proposed DialogVED performs better than PLATO, DialogVED incorporates more other techniques (e.g. n-stream self-attention, memory scheme, masked language modeling, free bits) than PLATO. It is not very clear to me why we should choose those techniques to train a continuous variational encoder-decoder. Maybe some ablation studies on the training objective and model architecture can help explain it. \n2. The model evaluation does not show the model's superiority in solving the one-to-many mapping problem in open-domain dialogue response generation. Distinct-1/2 are corpus-level metrics and are not showing the diversity of generated responses given the same context. To verify their claim, the authors may consider using self-bleu and the ratio of unique generated sentences to better evaluate the diversity. ", "comments,_suggestions_and_typos": "1. It is unclear to me what's the input to the prior network. Fig 1 suggests the [CLS] token is at the end of the context, but line234 says the [CLS] token is at the beginning of the context. "}, "scores": {"overall": "3 = Good: This paper is of interest to the *ACL audience and could be published, but might not be appropriate for a top-tier publication venue. It would likely be a strong paper in a suitable workshop.", "best_paper": "No", "replicability": "4 = They could mostly reproduce the results, but there may be some variation because of sample variance or minor variations in their interpretation of the protocol or method.", "datasets": "1 = No usable datasets submitted.", "software": "3 = Potentially useful: Someone might find the new software useful for their work."}, "meta": {"license": "Copyright © 2021 administered by the Association for Computational Linguistics (ACL)\n                                on behalf of ACL content contributors: None, and other contributors who wish to remain anonymous.\n                                Content is made available under a Creative Commons Attribution 4.0 International Public License.", "author_identity_guess": "1 = I do not have even an educated guess about author identity.", "confidence": "4 = Quite sure. I tried to check the important points carefully. It's unlikely, though conceivable, that I missed something that should affect my ratings.", "sentences": {"paper_summary": [[0, 195], [195, 384], [384, 550], [550, 685]], "summary_of_strengths": [[0, 3], [3, 219], [219, 561], [561, 565], [565, 688], [688, 898], [898, 902], [902, 1141]], "summary_of_weaknesses": [[0, 3], [3, 174], [174, 384], [384, 500], [500, 598], [598, 602], [602, 749], [749, 868], [868, 1010]], "comments,_suggestions_and_typos": [[0, 3], [3, 62], [62, 192]]}}}]