[{"rid": "418040bcb27410fc18ce88e2a6808ab07f2aa7910448eeccfd9f3a3b0f785f5c95cb439fe1e6a3a8d9e7c639b9079c52d2ef53e05312e0a3508fdf9ddc78a86e", "reviewer": null, "report": {"paper_summary": "In this resubmitted paper, the authors propose a framework that generates tables of contents for long documents based on different personas. The authors start with dataset introduction. And then the authors present the details of the framework, including aspect detection, persona mapping, intelligent navigation via question generation. The authors also demonstrate the experiments on different subtasks in the framework. The authors also present the human evaluation that demonstrates the successful performance of the pipeline. ", "summary_of_strengths": "In comparison with the previous version, the authors successfully improved the paper. \n1. With regard to novelty: Although the paper generally describes the same framework as the one proposed in the previous version, I think the authors clearly highlight their contribution in the improvement of TOC generation, including algorithmic results and human assessment. \n2. With regard to details and organization: The authors re-organized the paper, and clearly stated the details in the proposed framework and dataset. \n3. With regard to experiments: In this version, the authors provide detailed analysis of the proposed framework, Figure 4 & 5 clearly show the some examples from results of different aspect detection methods ", "summary_of_weaknesses": "I am still a little concerned about the Figure 2. This still requires a high-res display and zoom-in. I suggest the authors use supplementary pages or materials to show a clearer and detailed version of the table. ", "comments,_suggestions_and_typos": "No questions. \nI think the authors have polished the paper and achieved a good status. ", "ethical_concerns": "No. No concerns. "}, "scores": {"overall": "3.5 ", "best_paper": "No", "datasets": "4 = Useful: I would recommend the new datasets to other researchers or developers for their ongoing work.", "software": "1 = No usable software released."}, "meta": {"license": "Copyright © 2021 administered by the Association for Computational Linguistics (ACL)\n                                on behalf of ACL content contributors: None, and other contributors who wish to remain anonymous.\n                                Content is made available under a Creative Commons Attribution 4.0 International Public License.", "author_identity_guess": "1 = I do not have even an educated guess about author identity.", "confidence": "4 = Quite sure. I tried to check the important points carefully. It's unlikely, though conceivable, that I missed something that should affect my ratings.", "sentences": {"paper_summary": [[0, 141], [141, 186], [186, 338], [338, 423], [423, 531]], "summary_of_strengths": [[0, 86], [86, 90], [90, 364], [364, 368], [368, 515], [515, 519], [519, 724]], "summary_of_weaknesses": [[0, 50], [50, 102], [102, 214]], "comments,_suggestions_and_typos": [[0, 14], [14, 87]], "ethical_concerns": [[0, 17]]}}}, {"rid": "77e7e68c6c9f8fbce55b0eb66fb152a61bd30edfc4608610b1a81bf965cb14cb3e7abf535e50e5e438081ac30b0aaa57dc69032663b4588f4f73a6c948ebce2c", "reviewer": "Md Tahmid Rahman Laskar", "report": {"paper_summary": "A dynamic table of content-based navigator called DYNAMICTOC has been proposed for persona-based document consumption that highlights sections of interest. DYNAMICTOC is also augmented with short questions generated using deep reinforcement learning techniques to assist the users in understanding the underlying content of persona-clustered paragraphs. In addition to automatic evaluations, human evaluation is also conducted to demonstrate the effectiveness of DYNAMICTOC. ", "summary_of_strengths": "1. A novel dynamic table of content-based navigator has been proposed. \n2. Good amount of experiments were conducted to validate the effectiveness of the proposed model. \n3. The paper is Well-written. ", "summary_of_weaknesses": "1. Does not evaluate the performance of the end-to-end model using any automatic metrics. \n2. Only a small human evaluation has been conducted. \n3. Should use more baseline models to investigate the effectiveness of various techniques. ", "comments,_suggestions_and_typos": "1. Figure 2 should be presented better. \n2. The performance difference between the clusters in Figure 4 (a) and Figure 4 (b) should be demonstrated better. "}, "scores": {"overall": "3.5 ", "best_paper": "No", "datasets": "1 = No usable datasets submitted.", "software": "1 = No usable software released."}, "meta": {"license": "Copyright © 2021 administered by the Association for Computational Linguistics (ACL)\n                                on behalf of ACL content contributors: Md Tahmid Rahman Laskar, and other contributors who wish to remain anonymous.\n                                Content is made available under a Creative Commons Attribution 4.0 International Public License.", "author_identity_guess": "1 = I do not have even an educated guess about author identity.", "confidence": "4 = Quite sure. I tried to check the important points carefully. It's unlikely, though conceivable, that I missed something that should affect my ratings.", "sentences": {"paper_summary": [[0, 156], [156, 354], [354, 475]], "summary_of_strengths": [[0, 3], [3, 71], [71, 75], [75, 170], [170, 174], [174, 201]], "summary_of_weaknesses": [[0, 3], [3, 90], [90, 94], [94, 144], [144, 148], [148, 236]], "comments,_suggestions_and_typos": [[0, 3], [3, 40], [40, 44], [44, 156]]}}}]