[{"rid": "99d64669158590f9f3d0b28e3c563bcfac559cd34c4356ddc25b5ea7f25e8701c8824d1c85b3007de9e768e7fbf6bc8067d634e31bd768c285db8576172dac30", "reviewer": null, "report": {"paper_summary": "This paper introduces the first Thai Nested NER dataset, with a large size (largest non-English dataset) and high inter agreement. Along with introducing how they annotate the dataset, they also train three English SOTA models on the dataset to set a baseline performance for future works. ", "summary_of_strengths": "- The dataset could be very useful for future works. It's large with high quality.  - Experiments are good. Different models have been evaluated. ", "summary_of_weaknesses": "- The writing is really poor. Many places are very confusing. The figures are not clearly separated from the text, and it is confusing that where I should look at. Many sentences use the past tense, while other sentences use the present tense. The only reason that I would like this paper to be accepted is because of the dataset. The writing itself is far from a solid paper, and I suggest authors go over the writing again.\n- This dataset is the first Thai N-NER dataset, and N-NER in Thai is a new task for the community, so it could be very insightful to know what specific challenges are in Thai, and what errors the models make. The paper provides an error analysis, but not deep enough. It would be insightful if the authors could list error patterns at a finer granularity. ", "comments,_suggestions_and_typos": "It is also unclear to me that why syllable segmentation could be useful for the annotation. Many of the readers do not know Thai, so I think more explanation is necessary.\nFor the writing part, for example, Section 3 is mixed with the past tense and present tense. Figure 2 is hidden in the text. I suggest the authors put all the tables and figures at the top of the pages. "}, "scores": {"overall": "3 = Good: This paper is of interest to the *ACL audience and could be published, but might not be appropriate for a top-tier publication venue. It would likely be a strong paper in a suitable workshop.", "best_paper": "No", "replicability": "4 = They could mostly reproduce the results, but there may be some variation because of sample variance or minor variations in their interpretation of the protocol or method.", "datasets": "5 = Enabling: The newly released datasets should affect other people's choice of research or development projects to undertake.", "software": "4 = Useful: I would recommend the new software to other researchers or developers for their ongoing work."}, "meta": {"license": "Copyright © 2021 administered by the Association for Computational Linguistics (ACL)\n                                on behalf of ACL content contributors: None, and other contributors who wish to remain anonymous.\n                                Content is made available under a Creative Commons Attribution 4.0 International Public License.", "author_identity_guess": "1 = I do not have even an educated guess about author identity.", "confidence": "3 =  Pretty sure, but there's a chance I missed something. Although I have a good feel for this area in general, I did not carefully check the paper's details, e.g., the math or experimental design.", "sentences": {"paper_summary": [[0, 131], [131, 290]], "summary_of_strengths": [[0, 53], [53, 83], [83, 84], [84, 108], [108, 146]], "summary_of_weaknesses": [[0, 30], [30, 62], [62, 164], [164, 244], [244, 331], [331, 426], [426, 635], [635, 694], [694, 782]], "comments,_suggestions_and_typos": [[0, 92], [92, 172], [172, 265], [265, 297], [297, 375]]}}}, {"rid": "e4459891946c3b9dedb949ff16915fc1abb03b97481eacab1c146ef95f3eb1d79d169e90609c7f0356fe38dbdbcfe03279ffb36641fef135251110a52a730848", "reviewer": null, "report": {"paper_summary": "The paper is about the creation of a large dataset for Thai nested named entity recognition. The dataset is characterized by manually curated class and span annotations, and by the use of a very large class set, 104 classes. \nIn addition, some experiments about using known methods and a new innovative task approach for NNER task are described and analysed. ", "summary_of_strengths": "The paper introduces a new dataset which could be used by others to make different experiments. \nThe paper introduces three different baselines for comparing the experiments with new state of the art models. An error analysis is also included. ", "summary_of_weaknesses": "The paper covers too many topics and some of them are not clear enough. \nThe paper describes the creation of the dataset, the characteristics of Thai that impact the task, the processing problems, the guidelines and human annotation procedures, evaluation and quality control of the manual annotation, five different experiments offered as baseline and 3 experiments with state of the art models, and error analysis. ( Note that there are four pages of appendices). However, some of the topics are not totally covered. For instance, for the description of Thai characteristics, and associated challenges. It is not clear to me the problem of segmentation and it is not clear what are the human annotators doing after the syllable segmentation. An example would help to see the problem in this context. ", "comments,_suggestions_and_typos": "Line 302, right column. \" to trained the model\" => to train the model "}, "scores": {"overall": "3.5 ", "best_paper": "No", "replicability": "3 = They could reproduce the results with some difficulty. The settings of parameters are underspecified or subjectively determined, and/or the training/evaluation data are not widely available.", "datasets": "3 = Potentially useful: Someone might find the new datasets useful for their work.", "software": "1 = No usable software released."}, "meta": {"license": "Copyright © 2021 administered by the Association for Computational Linguistics (ACL)\n                                on behalf of ACL content contributors: None, and other contributors who wish to remain anonymous.\n                                Content is made available under a Creative Commons Attribution 4.0 International Public License.", "author_identity_guess": "1 = I do not have even an educated guess about author identity.", "confidence": "3 =  Pretty sure, but there's a chance I missed something. Although I have a good feel for this area in general, I did not carefully check the paper's details, e.g., the math or experimental design.", "sentences": {"paper_summary": [[0, 93], [93, 225], [225, 359]], "summary_of_strengths": [[0, 96], [96, 208], [208, 244]], "summary_of_weaknesses": [[0, 72], [72, 419], [419, 466], [466, 519], [519, 605], [605, 744], [744, 802]], "comments,_suggestions_and_typos": [[0, 26], [26, 70]]}}}, {"rid": "879b13234d6d01374f7edbafbfd9606c21b5c808ab693460325731eba80fe52f1dfed62bbe466ebd526b0423037bc7ebd68668e33ae3a6115cfdee123ab8bc80", "reviewer": "Tunga Gungor", "report": {"paper_summary": "The paper proposes a new nested named entity recognition dataset for the Thai language. It is formed of 8 layers with 10 coarse-grained classes and 104 fine-grained classes. The dataset is formed of about 5K documents collected from two domains, news articles and restaurant reviews. The data was annotated using an annotation guideline and the annotation steps were explained. The dataset was evaluated using SOTA models. ", "summary_of_strengths": "A nested NER dataset with a wide coverage was compiled for the Thai language. It is the first such dataset for the language. It may be useful for nested NER studies for that language and also for low-resource languages as a comparison. Quality of the annotations was checked. ", "summary_of_weaknesses": "There some parts left unclear during the compilation process. Please see below. \nAlso the dataset submitted as supplementary material to the paper seems to be a small part of the whole dataset. ", "comments,_suggestions_and_typos": "My comments are as follows: - How did you decide the number of classes (10 for coarse-grained and 104 for fine-grained) and how did you decide these classes?\n- It will be useful explaining briefly the currently available NER datasets for the Thai language in the related works section.\n- It was stated in Section 3.1 that the data was annotated on a syllable-basis in order to avoid the automatic word segmentation problems. But, in the rest of the paper, all the explanations were given on a word-basis. Section 3.5 indicates that words were segmented using an automatic tokenizer. Also, the example in Table 2 was annotated on a word-basis. This point should be clarified.\n- Another related issue is, if the dataset was annotated on a syllable basis, how useful will be such an annotation for NLP tasks? For instance, relation extraction, where we usually extract the NEs and the find relations between them. By using syllable annotations, how can we find word NEs? Using a segmenter or tokenizer?\n- How is the annotation on Thai NER datasets, on a syllable-basis or word-basis, and why?\n- It is stated that the dataset includes 4,894 documents. In NER datasets, it is better to state the size of the dataset with the number of sentences. How many sentences does the dataset include?\n- Were these 4,894 documents selected randomly? "}, "scores": {"overall": "3.5 ", "best_paper": "No", "replicability": "1 = They would not be able to reproduce the results here no matter how hard they tried.", "datasets": "3 = Potentially useful: Someone might find the new datasets useful for their work.", "software": "1 = No usable software released."}, "meta": {"license": "Copyright © 2021 administered by the Association for Computational Linguistics (ACL)\n                                on behalf of ACL content contributors: Tunga Gungor, and other contributors who wish to remain anonymous.\n                                Content is made available under a Creative Commons Attribution 4.0 International Public License.", "author_identity_guess": "1 = I do not have even an educated guess about author identity.", "confidence": "4 = Quite sure. I tried to check the important points carefully. It's unlikely, though conceivable, that I missed something that should affect my ratings.", "sentences": {"paper_summary": [[0, 88], [88, 174], [174, 284], [284, 378], [378, 423]], "summary_of_strengths": [[0, 78], [78, 125], [125, 236], [236, 276]], "summary_of_weaknesses": [[0, 62], [62, 80], [80, 194]], "comments,_suggestions_and_typos": [[0, 28], [28, 158], [158, 286], [286, 425], [425, 505], [505, 583], [583, 643], [643, 675], [675, 806], [806, 911], [911, 968], [968, 1000], [1000, 1090], [1090, 1148], [1148, 1241], [1241, 1286], [1286, 1334]]}}}]