[{"rid": "e41e88092bada9f75b4ce8778855411e128fea782712d728ff13b90f98386e6c97f5b383da31df5f5ad9aed07e2e3af42ad0fe8ce53e7dc9d81130c9d24a351e", "reviewer": null, "report": {"paper_summary": "This paper introduces a new corpus for offensive text span detection, evaluates some systems on it and look at their usefulness for toxic to non-toxic text conversion. ", "summary_of_strengths": "​Well-designed corpus, experiment, and result analysis for an important task. Also, interesting use of the corpus + systems trained on it to analyze existing systems for toxic to non-toxic text conversion. The paper is clear. ", "summary_of_weaknesses": "No weaknesses to me, everything looks good to me! ", "comments,_suggestions_and_typos": "Typo; L653: release->released "}, "scores": {"overall": "4 = Strong: This paper is of significant interest (for broad or narrow sub-communities), and warrants acceptance in a top-tier *ACL venue if space allows.", "best_paper": "No", "replicability": "5 = They could easily reproduce the results.", "datasets": "5 = Enabling: The newly released datasets should affect other people's choice of research or development projects to undertake.", "software": "4 = Useful: I would recommend the new software to other researchers or developers for their ongoing work."}, "meta": {"license": "Copyright © 2021 administered by the Association for Computational Linguistics (ACL)\n                                on behalf of ACL content contributors: None, and other contributors who wish to remain anonymous.\n                                Content is made available under a Creative Commons Attribution 4.0 International Public License.", "author_identity_guess": "4 = From an allowed pre-existing preprint or workshop paper, I know/can guess at least one author's name.", "confidence": "4 = Quite sure. I tried to check the important points carefully. It's unlikely, though conceivable, that I missed something that should affect my ratings.", "sentences": {"paper_summary": [[0, 168]], "summary_of_strengths": [[0, 78], [78, 206], [206, 226]], "summary_of_weaknesses": [[0, 50]], "comments,_suggestions_and_typos": [[0, 30]]}}}]