[{"rid": "21382763e074c2038343ff50e6e918aaf08b05b20610034ac8ad1a44cc57e35481f375543ea615000ed99556cbccd5c7465efd5019330d7e09ec79c3dbca0bde", "reviewer": null, "report": {"paper_summary": "The paper presents NAKDIMON, a character-LSTM Hebrew diacritizer that does not use a morphological analyzer/dictionary.  It compares its performance to SOTA on the task; and presents a new test set for the task that is more diverse that previous sets. ", "summary_of_strengths": "The paper is well written and clear. The work is well motivated and enough related work is presented.  The error analysis is clear and helpful. This is a good short paper with a negative result. ", "summary_of_weaknesses": "The paper presents inconclusive negative results: it is unclear what the results would look like had millions of additional words that are *automatically diacritized* using Dicta are added in Nakdimon's training. The authors added 1.3M such words. I think an additional experiment that uses more words (automatically diacritized) or just generated word forms from a morphological dictionary can make the result more convincing (negative or positive it may be). ", "comments,_suggestions_and_typos": "- it would help to report OOV rates; and performance on in-vocabulary vs OOV for your system.\n- the discussion of Arabic use of diacritization is not accurate. Arabic \"dots\" are not optional in common use of Arabic; diacritical marks (vowels, nunation, gemination) are.  Check out  https://aclanthology.org/N07-2014.pdf https://aclanthology.org/2007.mtsummit-papers.20.pdf - I am puzzled by a difference between the Dicta test set and the new test set: the difference between CHA and WOR for the Dicta test set is much bigger that the respective difference in the new test set (between 1.4 and 2.4 times bigger).  Any thoughts on that? ", "ethical_concerns": "None "}, "scores": {"overall": "2 = Revisions Needed: This paper has some merit, but also significant flaws, and needs work before it would be of interest to the community.", "best_paper": "No", "datasets": "5 = Enabling: The newly released datasets should affect other people's choice of research or development projects to undertake.", "software": "4 = Useful: I would recommend the new software to other researchers or developers for their ongoing work."}, "meta": {"license": "Copyright © 2021 administered by the Association for Computational Linguistics (ACL)\n                                on behalf of ACL content contributors: None, and other contributors who wish to remain anonymous.\n                                Content is made available under a Creative Commons Attribution 4.0 International Public License.", "author_identity_guess": "1 = I do not have even an educated guess about author identity.", "confidence": "5 = Positive that my evaluation is correct. I read the paper very carefully and am familiar with related work.", "sentences": {"paper_summary": [[0, 120], [120, 252]], "summary_of_strengths": [[0, 37], [37, 102], [102, 144], [144, 195]], "summary_of_weaknesses": [[0, 213], [213, 248], [248, 461]], "comments,_suggestions_and_typos": [[0, 94], [94, 160], [160, 270], [270, 373], [373, 613], [613, 636]], "ethical_concerns": [[0, 5]]}}}]