[{"rid": "4aaf67bb39a536f9c69db39faec8fdfd2a3368a601e2e17070610a76bca035c18409744aa4344e6e32a0666894537b13494f33fc051ffb579273744ca1f6582a", "reviewer": null, "report": {"paper_summary": "This paper introduces a new multimodal dialogue state tracking dataset, with simulated dialogues of moving objects that have varying shapes, colors, and sizes. They also design a novel Video Dialogue Transformer Network as a strong baseline for the task. ", "summary_of_strengths": "The dataset and model designed in this work appear to be novel and would be broadly useful to the dialogue systems and multimodal learning communities. ", "summary_of_weaknesses": "As the authors mention, the dataset is limited to simulated dialogues of simple objects, rather than human objects, but this is a preliminary study. In addition, it is not specified whether the data and code will be publicly released, which is the primary contribution. Some of the baselines used were weak. Other stronger baselines should be considered, e.g., SUMBT, DSDST, GCDST, SOM-DST, CSFN-DST, MinTL, and Pegasus. ", "comments,_suggestions_and_typos": "- line 249: \"tuned\" -> \"tune\" - line 325: is a word missing after \"linear\"?\n- line 343: \"recovers\" -> \"recover\" - please clarify what is meant in line 375 by \"harmful\" and annotation bias in line 373 - line 494: \"Asides\" -> \"Aside\" - lines 528-529: should \"only improves the results significantly\" be \"insignificantly\"?\n- line 541: \"We observed that\" is repeated twice - line 584: please elaborate on what is meant by filtering the videos and training a new model, as well as how to interpret Table 5 "}, "scores": {"overall": "4 = This paper represents solid work, and is of significant interest for the (broad or narrow) sub-communities that might build on it.", "best_paper": "No", "datasets": "1 = No usable datasets submitted.", "software": "1 = No usable software released."}, "meta": {"license": "Copyright © 2021 administered by the Association for Computational Linguistics (ACL)\n                                on behalf of ACL content contributors: None, and other contributors who wish to remain anonymous.\n                                Content is made available under a Creative Commons Attribution 4.0 International Public License.", "author_identity_guess": "1 = I do not have even an educated guess about author identity.", "confidence": "4 = Quite sure. I tried to check the important points carefully. It's unlikely, though conceivable, that I missed something that should affect my ratings.", "sentences": {"paper_summary": [[0, 160], [160, 255]], "summary_of_strengths": [[0, 152]], "summary_of_weaknesses": [[0, 149], [149, 270], [270, 308], [308, 421]], "comments,_suggestions_and_typos": [[0, 30], [30, 76], [76, 112], [112, 200], [200, 232], [232, 320], [320, 369], [369, 501]]}}}, {"rid": "d4b6a18e476d8e6bbc82a16af3be25ab35ab591e6d762377cd3c7a461fb6c5dfae0df4cab91a186fa68d4d0dcbe88c11f30a461bfd96fc392bfd976f35d7cda0", "reviewer": null, "report": {"paper_summary": "This paper introduces a multimodal DST task. The paper's contributions are 3 folds:  1. defines the task which pertains to state tracking over a multi-turn conversation between the system and the user wherein the user asks questions and the system provides answers from a video scene. \n2. provides a synthetic dataset (DVD-DST) for the task. \n3. VDTN: which is a multimodal transformer-based model that combines video and dialog features to answer the user's questions. \nThey test VDTN on their synthetic dataset against baselines to showcase that VDTN does better at the multimodal DST task. ", "summary_of_strengths": "1. Interesting task definition - traditional DST systems do not quite deal with references to multiple intra-domain objects (which is a harder task to track states over IMO). This task catches up on that distinction. \n2. The paper is well-written (extensive analysis in appendix) and tries to cover a large ground of work (defining task + providing synthetic dataset + novel model architecture) ", "summary_of_weaknesses": "- Overall, I feel that the paper is trying to do a lot of things at one go. The authors have covered a large ground of work but maybe it's too much to put into a single paper and isn't doing justice to each of the contributions. Example, given that this is a new task - I would want to know more details about the task - how is it different/why is it beneficial etc. ( the authors have covered these aspects, but briefly). \nGetting into the details of weaknesses: - One of the major weaknesses of this paper is the use of synthetic datasets. Also, the choice of baseline (DVD) doesn't seem super clear. Based on the examples, it seems to be a very \"dumb\" baseline. Some insight into the chosen baseline would be helpful.\nHowever, despite these weaknesses it is still a comprehensive paper. ", "comments,_suggestions_and_typos": "nil "}, "scores": {"overall": "3.5 ", "best_paper": "No", "datasets": "5 = Enabling: The newly released datasets should affect other people's choice of research or development projects to undertake.", "software": "3 = Potentially useful: Someone might find the new software useful for their work."}, "meta": {"license": "Copyright © 2021 administered by the Association for Computational Linguistics (ACL)\n                                on behalf of ACL content contributors: None, and other contributors who wish to remain anonymous.\n                                Content is made available under a Creative Commons Attribution 4.0 International Public License.", "author_identity_guess": "1 = I do not have even an educated guess about author identity.", "confidence": "4 = Quite sure. I tried to check the important points carefully. It's unlikely, though conceivable, that I missed something that should affect my ratings.", "sentences": {"paper_summary": [[0, 45], [45, 88], [88, 285], [285, 289], [289, 342], [342, 346], [346, 470], [470, 593]], "summary_of_strengths": [[0, 3], [3, 175], [175, 217], [217, 221], [221, 395]], "summary_of_weaknesses": [[0, 76], [76, 229], [229, 369], [369, 423], [423, 464], [464, 542], [542, 603], [603, 665], [665, 721], [721, 790]], "comments,_suggestions_and_typos": [[0, 4]]}}}, {"rid": "f3f751ba8b21e054b0fd4d27d2f966fab26cf382c0a8f51d2c6ec4be6b17b050fe248fb2fb091fcae6f0e79231a9bd3c7b696da7961e1310f79bf4638586a896", "reviewer": "Weizhe Lin", "report": {"paper_summary": "This paper introduced an extended definition which extends unimodal DST to multimodal DST. To demonstrate this new schema of DST, the authors generated dialogues based on an extended CATER video split, with additional ground-truth labeling for bounding boxes and visual objects across frames.  The dialogues mainly focus on visually-grounded object reasoning, where a question is raised to query the states of objects in the given video clip.\nThe proposed DST definition comprises of dialogue states from the traditional DST setting and dialogue states that represent the states of visible objects. Two temporal-based slots are also added such that an object can be located by each turn.\nThe model architecture is based on an autoregressive approach, where the dialogue states of last turn along with turn utterances (t-1 and t) are given to generate the frame start/end and object states. The backbone is Transformer block, and Mask Vision Modeling (similar to Mask Language Modeling) is used to self-supervise the learning of visual representations.\nIn experiments, the authors presented several baseline models to evaluate different aspects of the proposed DVD-DST dataset. The model outperformed these baselines, and analyses on model components were provided. ", "summary_of_strengths": "1. The paper is generally well-written. Most of the content does not cause confusion. \n2. The introduction of Multimodal DST (MM-DST) is interesting. Though there are some concurrent works in introducing MM-DST, the paper defines a more complete set of dialogue states: single object to multiple, and maintaining object states also becomes a DST task. This new definition is in general convincing and promising, and can be extended to more complex MM-DST problems. \n3. The creation of the dataset refers to prior work and took into consideration the distribution bias of datasets. Potential biasedness was further discussed with some simple baseline models proposed in Sec. 4. It can be seen that the dataset is generally in high quality. \n4. The video self-supervised training improved the overall performance, showing that with this technique, the Transformer blocks learn to distinguish visual cues and learn meaningful representations. \n5. The experiments and ablation studies are rich and cover most of potential research questions. ", "summary_of_weaknesses": "1. The extension to the unimodal DST definition is good enough in the CATER dataset, but why the authors pick the CATER dataset as the basis is not obvious and lacks further discussion. This dataset contains only simple objects and questions related to their positioning and movements.  This is very “synthetic” and so that the proposed MM-DST definition is very limited to simple objects and movements. How can this definition be extended to broader and more real applications, like other real-world dialogue systems and QA machines? \n2. The clarification of different models being compared is not clear enough. Many baseline models are proposed and compared, but for most of them this paper did not explain why they were proposed, what are expected, and further discussions are still missing. The current form is a bit messy in Line 409-436, 461-509. \n3. The comparison with baseline systems is not very convincing. The baseline systems such as TRADE are already old. They have low performance in unimodal DST, to the best of my knowledge. For example, TRADE is a very basic model (48.62%), and NA-DST achieved only 50.52% on MultiWOZ 2.0. However, the current best model from the leaderboard of MultiWOZ ([budzianowski/multiwoz: Source code for end-to-end dialogue model from the MultiWOZ paper (Budzianowski et al. 2018, EMNLP) (github.com)](https://github.com/budzianowski/multiwoz)) is: [KAGE-GPT2](https://aclanthology.org/2021.emnlp-main.620.pdf) (Lin et al, 2021) with 54.86% on MultiWOZ 2.0 and [TripPy + SaCLog](https://arxiv.org/abs/2106.00291) (Dai et al. 2021) with 60.61 on MultiWOZ 2.1. Based on the approach the authors are using, [SimpleTOD](https://arxiv.org/pdf/2005.00796.pdf) (Hosseini-Asl et al. 2020) suits better since it generates dialogue states in an auto-regressive way as well. Furthermore, it is also unfair to compare with unimodal DST systems that were not trained on image understanding. Thus, it is more fair to train those baseline systems (at least one of them) with self-supervised learning. \n4. The join training of L_seg and L_obj seems to underperform either alone. This was neither tackled nor deeply discussed. This component should be crucial to the overall performance, and thus better analysis is required. ", "comments,_suggestions_and_typos": "1. Though the paper presented a fair amount of good work, the current presentation should be improved. For example, the captions of tables and figures should contain necessary explanations of what are presented and what are the major findings that a reader should put focus on. Abbreviations (Tab. 2 “Dial.”, “ Vid.”) should be clearly described in captions. Reference should be put to ambiguous descriptions (e.g. refer Line 253,254 to Fig.2 such that examples of OBJ<class> can be well understood). Line 261: R^{L_obj x 4}: 4 should be x1 x2 y1 y2, and this should be stated. Table 3:  the meaning of (tracking) should be clearly stated, or use another name like “w/ oracle bounding box labels”. Line 506-509, use the formal names instead of only citations for these models. Line 543-546: not understandable. Line 193, redundant first “|”, {}|_{some conditions} is enough. \n2. In general, this paper presented a fairly good amount of work. And the shift from unimodal to multimodal is on the right track. Though there is still a lot to improve, I believe that the authors are moving towards an impactful work. \n3. Well, DVD-DST - what does DVD mean..... A better name is strongly suggested since \"DVD\" seems to distract readers from its real meaning. ", "ethical_concerns": "No ethical concerns are outstanding. "}, "scores": {"overall": "3.5 ", "best_paper": "No", "datasets": "4 = Useful: I would recommend the new datasets to other researchers or developers for their ongoing work.", "software": "1 = No usable software released."}, "meta": {"license": "Copyright © 2021 administered by the Association for Computational Linguistics (ACL)\n                                on behalf of ACL content contributors: Weizhe Lin, and other contributors who wish to remain anonymous.\n                                Content is made available under a Creative Commons Attribution 4.0 International Public License.", "author_identity_guess": "1 = I do not have even an educated guess about author identity.", "confidence": "3 =  Pretty sure, but there's a chance I missed something. Although I have a good feel for this area in general, I did not carefully check the paper's details, e.g., the math or experimental design.", "sentences": {"paper_summary": [[0, 91], [91, 293], [293, 443], [443, 599], [599, 688], [688, 890], [890, 1052], [1052, 1177], [1177, 1265]], "summary_of_strengths": [[0, 3], [3, 40], [40, 86], [86, 90], [90, 150], [150, 352], [352, 465], [465, 469], [469, 581], [581, 677], [677, 739], [739, 743], [743, 940], [940, 944], [944, 1038]], "summary_of_weaknesses": [[0, 3], [3, 186], [186, 286], [286, 404], [404, 535], [535, 539], [539, 613], [613, 795], [795, 853], [853, 857], [857, 918], [918, 970], [970, 1042], [1042, 1142], [1142, 1603], [1603, 1808], [1808, 1922], [1922, 2030], [2030, 2034], [2034, 2107], [2107, 2154], [2154, 2253]], "comments,_suggestions_and_typos": [[0, 3], [3, 103], [103, 278], [278, 298], [298, 311], [311, 318], [318, 359], [359, 501], [501, 578], [578, 698], [698, 777], [777, 811], [811, 875], [875, 879], [879, 942], [942, 1007], [1007, 1112], [1112, 1116], [1116, 1253]], "ethical_concerns": [[0, 37]]}}}]