[{"rid": "a3834a569f77482c154859425a610a944a5ab05d6eead3497e1af551e64d43d375ac91d1eefae9f4a61174883aa06ba99480a2ca153edb1191f6d7580565a572", "reviewer": null, "report": {"paper_summary": "Authors present  a novel finetuning method, BitFit, where instead of finetuning the entire model the authors finetune only the `bias’ terms and the final task-specific classification layer. The authors compare BitFit to other parameter-efficient finetuning methods such as adapters and sparse params and report that BitFit performs better than previous approaches and even better than full finetuning on certain tasks. Additional analysis on the change in values of layer wise bias terms reveals that finetuning a specific subset of bias terms can also lead to marginally lower performance as compared to finetuning all bias terms. For low to medium data regimes, BitFit performs better than full finetuning. ", "summary_of_strengths": "1. Simple and effective method of finetuning that performs better than competitive baselines. For low to medium data, BitFit has better performance than fine-tuning the entire transformer model. \n2. Author perform additional analysis on the change of bias terms and find that tuning a subset of bias terms also lead to marginally lower performance than finetuning all bias terms. ", "summary_of_weaknesses": "1. Sensitivity of results to random seeds is not clear. Would be helpful to report variance for finetuning under different random seed settings. \n2. The actual strengths or limitations of BitFit are unclear. To elaborate, in addition to reporting empirical numbers on multiple tasks an analysis of the kind of examples where BitFit performs well should be added. It would be helpful for the community to understand if there is a certain type of tasks/nature of examples,  where BitFit performs better or is comparable to full fine-tuning. ", "comments,_suggestions_and_typos": "Minor typo: Line 69: hard reason --> hard to reason "}, "scores": {"overall": "3 = Good: This paper is of interest to the *ACL audience and could be published, but might not be appropriate for a top-tier publication venue. It would likely be a strong paper in a suitable workshop.", "best_paper": "No", "replicability": "4 = They could mostly reproduce the results, but there may be some variation because of sample variance or minor variations in their interpretation of the protocol or method.", "datasets": "1 = No usable datasets submitted.", "software": "5 = Enabling: The newly released software should affect other people's choice of research or development projects to undertake."}, "meta": {"license": "Copyright © 2021 administered by the Association for Computational Linguistics (ACL)\n                                on behalf of ACL content contributors: None, and other contributors who wish to remain anonymous.\n                                Content is made available under a Creative Commons Attribution 4.0 International Public License.", "author_identity_guess": "4 = From an allowed pre-existing preprint or workshop paper, I know/can guess at least one author's name.", "confidence": "3 =  Pretty sure, but there's a chance I missed something. Although I have a good feel for this area in general, I did not carefully check the paper's details, e.g., the math or experimental design.", "sentences": {"paper_summary": [[0, 190], [190, 419], [419, 632], [632, 709]], "summary_of_strengths": [[0, 3], [3, 94], [94, 195], [195, 199], [199, 380]], "summary_of_weaknesses": [[0, 3], [3, 56], [56, 145], [145, 149], [149, 208], [208, 363], [363, 539]], "comments,_suggestions_and_typos": [[0, 52]]}}}, {"rid": "63e6907546809c29c6678e0b7768044386cffcd2d9d29d2cd0a6402acf7cf545807ce23f46172008b74dd4293dd59263459da0d53716a3518eddfccb173e0844", "reviewer": null, "report": {"paper_summary": "The paper proposes a simple and efficient method, BitFit, for fine-tuning language models on tasks with small-or-low training data. BitFit fine-tunes only the bias-terms of the language model and shows comparable performance to full fine-tuning on some tasks in GLUE.  The bias terms constitute very few parameters of a pre-trained LM and so BitFit is more efficient than DiffPrune and Adapters in terms of the number of parameters fine-tuned. ", "summary_of_strengths": "- The paper introduces a simple technique for fine-tuning language models and comparisons with other techniques show that the method is parameter efficient on the GLUE benchmark. ", "summary_of_weaknesses": "- The paper provides some unsubstantiated conjectures about the \"fine-tuning as exposure of existing capabilities in LMs\". Without adequate reasoning or references, it is hard to comprehend what the author(s) refer to in this case.\n- Generalization gap: No reference to a graph or table that the Generalization gap talks about. However, I did understand later that the generalization gap referred to here is from validation to test in Table 1. The difference between full fine-tuning validation and test also seems to be within 3% from this table and given that experiments haven't been run over multiple seeds, the conclusion about the lower generalization gap is unformed. On QQP, both full fine-tuning and BitFit suffer very similar drops. \n    - Have the author(s) run the codes for multiple seeds and reported the mean? \n    - If not run for multiple seeds, is the <1% difference a significant result?\nOverall, while this paper proposes an interesting empirical result, it makes some unsubstantiated claims and some of the conclusions from the experiments are not adequately justified. The paper could benefit from a more substantial discussion of fewer results in the main paper with a more detailed discussion deferred to the Appendix for other experiments. ", "comments,_suggestions_and_typos": "- Perhaps this point is not explicitly mentioned, but it seems like BitFit also has the added advantage of *not* introducing any new parameters to the model. This would have been a nice positive to stress on.\n- Is there any reason why the paper stresses on Masked Language Models in particular? Did experiments not work out with an autoregressive LM? "}, "scores": {"overall": "2 = Borderline: This paper has some merit, but also significant flaws. It does not warrant publication at top-tier venues, but might still be a good pick for workshops.", "best_paper": "No", "replicability": "4 = They could mostly reproduce the results, but there may be some variation because of sample variance or minor variations in their interpretation of the protocol or method.", "datasets": "1 = No usable datasets submitted.", "software": "4 = Useful: I would recommend the new software to other researchers or developers for their ongoing work."}, "meta": {"license": "Copyright © 2021 administered by the Association for Computational Linguistics (ACL)\n                                on behalf of ACL content contributors: None, and other contributors who wish to remain anonymous.\n                                Content is made available under a Creative Commons Attribution 4.0 International Public License.", "author_identity_guess": "4 = From an allowed pre-existing preprint or workshop paper, I know/can guess at least one author's name.", "confidence": "4 = Quite sure. I tried to check the important points carefully. It's unlikely, though conceivable, that I missed something that should affect my ratings.", "sentences": {"paper_summary": [[0, 132], [132, 268], [268, 444]], "summary_of_strengths": [[0, 179]], "summary_of_weaknesses": [[0, 123], [123, 232], [232, 328], [328, 444], [444, 675], [675, 743], [743, 825], [825, 907], [907, 1091], [1091, 1265]], "comments,_suggestions_and_typos": [[0, 158], [158, 209], [209, 295], [295, 351]]}}}, {"rid": "44e7ab41a54cab53f17e79871feb2713cc16df873abd22f680ff5a4c0366953bb1c6c359fd3fd84fa68c262345dae767a3250a4249f7a0583a6569f44fdaa4d1", "reviewer": null, "report": {"paper_summary": "This paper presents an interesting finding, i.e., fine-tuning only the bias terms of pre-trained language models is competitive with fine-tuning the entire model. The authors compared the proposed method Bias-terms Fine-tuning (BitFit) with other parameter-efficient fine-tuning methods (e.g., Adapters, Diff-Pruning). The experimental results on GLUE benchmark show that BitFit can achieve strong performance with less trainable parameters. ", "summary_of_strengths": "- The paper is well written and easy to understand.\n- The proposed method (BitFit) is neat and novel.\n- The authors show strong empirical results on GLUE benchmark. ", "summary_of_weaknesses": "I do not have any concerns about this paper. ", "comments,_suggestions_and_typos": "It would be helpful to compare BitFit with Adapter and Diff-Pruning base on other language models (e.g.,RoBERTa, T5). But current version is good enough for a short paper. "}, "scores": {"overall": "4 = Strong: This paper is of significant interest (for broad or narrow sub-communities), and warrants acceptance in a top-tier *ACL venue if space allows.", "best_paper": "No", "replicability": "4 = They could mostly reproduce the results, but there may be some variation because of sample variance or minor variations in their interpretation of the protocol or method.", "datasets": "1 = No usable datasets submitted.", "software": "4 = Useful: I would recommend the new software to other researchers or developers for their ongoing work."}, "meta": {"license": "Copyright © 2021 administered by the Association for Computational Linguistics (ACL)\n                                on behalf of ACL content contributors: None, and other contributors who wish to remain anonymous.\n                                Content is made available under a Creative Commons Attribution 4.0 International Public License.", "author_identity_guess": "1 = I do not have even an educated guess about author identity.", "confidence": "4 = Quite sure. I tried to check the important points carefully. It's unlikely, though conceivable, that I missed something that should affect my ratings.", "sentences": {"paper_summary": [[0, 163], [163, 319], [319, 442]], "summary_of_strengths": [[0, 52], [52, 102], [102, 165]], "summary_of_weaknesses": [[0, 45]], "comments,_suggestions_and_typos": [[0, 118], [118, 172]]}}}]