[{"rid": "db6797e7fe34857ed5981bd0ea20947288238d48d7f412cb23c85472a8f914f85e94f016ae1ec9e08eddb063ae1dc853307a20b749fae53c065cf305f7598253", "reviewer": null, "report": {"paper_summary": "The present paper investigates the Word-in-Context task in a few-shot setting. Utilising a prompt-based approach, rather than optimising models to predict the expected label (i.e. whether two word senses are different), this paper proposes to predict (embeddings of) words synonymous to those in question and compare the distances of these embeddings. Models optimised in this way reach the performance of models finetuned on the whole training set and the approach is argued to generalise to some other tasks. ", "summary_of_strengths": "The method is surprisingly simple, the results are convincing as they significantly improve upon the state-of-the-art on the WiC task in the few-shot setting. The paper shows that the methodology is applicable to some other few-shot tasks as well. Claims are substantiated and backed by evidence. ", "summary_of_weaknesses": "The main weakness of the paper is that it's very terse, partly due to the 4-page limit of a short submission. This leads to potentially important information being omitted, see detailed comments below. \nSome of the mentioned points could be easily alleviated by utilising the additional page that is provided upon acceptance in a venue. ", "comments,_suggestions_and_typos": "The following are points where i would like to see further clarifications: (NB: I do not have access to the forum/comments of the previous submission so some of my comments might have been addressed earlier.)\n- Why are SST-2 and SICK-E chosen as representative tasks to show that the proposed method generalises to other few-shot settings? Other papers seem to go for the full SuperGLUE suite. Similarly, for those tasks, why is Autoprompt chosen as the only reference approach to compare against? Admittedly, the difference in performance to other approaches (at least for the SST-2 task) appears to not differ too much.  - It is great to see that confidence scores were reported for the obtained results, but how exactly are they calculated?\n- The high-level description helps to understand the approach intuitively, but a more detailed (e.g. mathematical) formulation, for example in the appendix, would be helpful as well. Similarly, the figure is supposed to help to understand the problem better, but I find it confusing in two ways: First, the figure is too abstract for me. Maybe having more text labels would help. Second, depicting sentiment analysis, it does not align well with the main contribution of the paper, improvements on the WiC task. Maybe reworking the figure to depict the WiC task would help with both problems.\n- Qualitative error analysis in the Appendix is great, but the manuscript so far lacks a more detailed analysis of the results. One could wonder, for the WiC task, are the errors always due to models predicting \"matched\" for \"not matched\" GT? Is this similar to other approaches? For example, a by-class accuracy breakdown could answer some of these questions. "}, "scores": {"overall": "3.5 ", "best_paper": "No", "replicability": "3 = They could reproduce the results with some difficulty. The settings of parameters are underspecified or subjectively determined, and/or the training/evaluation data are not widely available.", "datasets": "1 = No usable datasets submitted.", "software": "1 = No usable software released."}, "meta": {"license": "Copyright © 2021 administered by the Association for Computational Linguistics (ACL)\n                                on behalf of ACL content contributors: None, and other contributors who wish to remain anonymous.\n                                Content is made available under a Creative Commons Attribution 4.0 International Public License.", "author_identity_guess": "1 = I do not have even an educated guess about author identity.", "confidence": "3 =  Pretty sure, but there's a chance I missed something. Although I have a good feel for this area in general, I did not carefully check the paper's details, e.g., the math or experimental design.", "sentences": {"paper_summary": [[0, 79], [79, 352], [352, 511]], "summary_of_strengths": [[0, 159], [159, 248], [248, 297]], "summary_of_weaknesses": [[0, 110], [110, 202], [202, 337]], "comments,_suggestions_and_typos": [[0, 209], [209, 340], [340, 394], [394, 498], [498, 622], [622, 623], [623, 744], [744, 927], [927, 1082], [1082, 1124], [1124, 1256], [1256, 1337], [1337, 1465], [1465, 1580], [1580, 1617], [1617, 1698]]}}}]