[{"rid": "2a9d16fb890611d1da1586df109d5ea3883ac31d59d259fe86e6bdc41f41585225d71ca9f5dafe832a3c8d2a9decebe1741bead124515d9bf5a5efb4603e7c68", "reviewer": "Ni Lao", "report": {"paper_summary": "This paper proposes DAR, which improves dense retrieval models with MixUp interpolations and dropout perturbation. MixUp (Zhang+ 2018) was initially proposed for image models, which creates augmented examples by linearly interpolating both the representations and labels between positive-negative sample pairs.  This work applies this technique to dense  text retrieval, and augments the original contrastive loss with soft binary cross-entropy losses. Furthermore, this paper also explores perturbing the representations with 0.1 dropout rate, and this technique can be combined with the MixUp strategy.\nExperiment on the DPR framework shows that DAR significantly outperforms vanilla DPR and its combinations with different data augmentation strategies (QA,DA,AR). The improvement is more prominent on unlabeled documents (not seen during training).  Oblation study shows that perturbation is only marginally helpful by itself, but a lot more helpful when combined with MuxUp.  Experiment on the ANCE framework shows that combining ANCE with DAR significantly improves MRR, and marginally improves R@1k. ", "summary_of_strengths": "This work is well motivated from the need to generalize unseen documents, and shows good empirical results. ", "summary_of_weaknesses": "However, I find it less motivated by the computational cost of other data augmentation approaches, which are not really that expensive as shown in Table 7. ", "comments,_suggestions_and_typos": "It seems that the proposed document augmentation approach is not mutually exclusive to other approaches such as query generation (QA, DA, AR in Table 1), and we should evaluate the combined performance of them with DAR. "}, "scores": {"overall": "3.5 ", "best_paper": "No", "replicability": "5 = They could easily reproduce the results.", "datasets": "1 = No usable datasets submitted.", "software": "1 = No usable software released."}, "meta": {"license": "Copyright © 2021 administered by the Association for Computational Linguistics (ACL)\n                                on behalf of ACL content contributors: Ni Lao, and other contributors who wish to remain anonymous.\n                                Content is made available under a Creative Commons Attribution 4.0 International Public License.", "author_identity_guess": "1 = I do not have even an educated guess about author identity.", "confidence": "3 =  Pretty sure, but there's a chance I missed something. Although I have a good feel for this area in general, I did not carefully check the paper's details, e.g., the math or experimental design.", "sentences": {"paper_summary": [[0, 115], [115, 311], [311, 453], [453, 605], [605, 767], [767, 852], [852, 979], [979, 980], [980, 1106]], "summary_of_strengths": [[0, 108]], "summary_of_weaknesses": [[0, 156]], "comments,_suggestions_and_typos": [[0, 220]]}}}, {"rid": "4983c10973bc21ac0b8b463ef670ca8459c7b43374d72e4a71c209ef7d013798a1fecdd1952db60b58c5355c0354c48dd7907e30998421c7c5c192810d7877a2", "reviewer": "Kai Hui", "report": {"paper_summary": "The paper proposed two document augmentation methods for training data augmentation, namely, the interpolation with mixup and the stochastic perturbation with dropout. In the interpolation, a dummy document is created by interpolating the positive and negative documents which is associated with a soft label; In the dropout, multiple dummy document representations are  generated by masking the document representation with stochastic masks. ", "summary_of_strengths": "- The description of the motivation, and method are clear and easy to follow - The proposed methods are intriguing - The reported results are promising. Especially, the boost in terms of the success rate @ 20, 5, 1 on NQ looks good. ", "summary_of_weaknesses": "- The biggest concerns/confusions during the reading are the lack of implementation details of the proposed methods. They should have been described in the implementation details in Section 4.1.   1) For the interpolation method, how the \\lambda has been set? \n2) For the dropout, thru the reading of the response letter, my understanding is that multiple stochastic masks (w/ 0 and 1) are applied to a document presentation from an encoder. Herein, what is the dropping rate? How many masks have been generated?\n- I am not sure TQA is a good enough benchmark for the proposed method.  It can be seen from Table 1, none of the competing deep models could outperform BM25. Though the proposed DAR could boost DPR, I am not sure if such gain is meaningful. ", "comments,_suggestions_and_typos": "- The proposed methods are novel and intriguing. The confusion mostly comes from the implementation details and the results. Why not extend the efforts to a full paper and properly add all of the details given the extra space? "}, "scores": {"overall": "4 = Strong: This paper is of significant interest (for broad or narrow sub-communities), and warrants acceptance in a top-tier *ACL venue if space allows.", "best_paper": "No", "replicability": "3 = They could reproduce the results with some difficulty. The settings of parameters are underspecified or subjectively determined, and/or the training/evaluation data are not widely available.", "datasets": "1 = No usable datasets submitted.", "software": "1 = No usable software released."}, "meta": {"license": "Copyright © 2021 administered by the Association for Computational Linguistics (ACL)\n                                on behalf of ACL content contributors: Kai Hui, and other contributors who wish to remain anonymous.\n                                Content is made available under a Creative Commons Attribution 4.0 International Public License.", "author_identity_guess": "1 = I do not have even an educated guess about author identity.", "confidence": "4 = Quite sure. I tried to check the important points carefully. It's unlikely, though conceivable, that I missed something that should affect my ratings.", "sentences": {"paper_summary": [[0, 168], [168, 443]], "summary_of_strengths": [[0, 77], [77, 115], [115, 153], [153, 233]], "summary_of_weaknesses": [[0, 117], [117, 195], [195, 197], [197, 260], [260, 442], [442, 477], [477, 513], [513, 585], [585, 672], [672, 755]], "comments,_suggestions_and_typos": [[0, 49], [49, 125], [125, 227]]}}}]