[{"rid": "7ee102243dbf8de1d8e6a4df72d144a8eb5872685d4cb2686aca33dad00eedec4b7db39790881b7ac8dd76c80dfb35969d2786a17bee7fb1d4b4283826284e11", "reviewer": null, "report": {"paper_summary": "This paper investigates the causes of an Event Detection model’s skewed performance and presents trigger saliency attribution to explicitly assess the underlying pattern of events. The authors also develop a new training mechanism based on trigger saliency attribution, which uses saliency as evidence to enhance learning. Experimental results achieve promising performance on two benchmarks. ", "summary_of_strengths": "- The paper investigates the causes of an Event Detection model’s skewed performance.\n- A technically sound method to improve Event Detection by presents trigger saliency attribution that can explicitly quantify an event’s contextual pattern.\n- Experiments on ACE-2005 and MAVEN benchmarks verify its effectiveness. ", "summary_of_weaknesses": "- Authors aim to improve previous methods via trigger saliency attribution and grouping event types with similar patterns together. But one question is how to measure the correctness of the divided group, not only from the perspective of intuitions but experimental evidence.\n- As a recent trend is pre-training Transformer on large-scale corpora and larger models also show greater capabilities for context representative, I am wondering if the larger model performs poorly on context-dependent types.\n- Case visualization contains only two examples of each instance and consists of mere conjectures about the reason behind their model’s performance and errors. ", "comments,_suggestions_and_typos": "As mentioned by weaknesses above. "}, "scores": {"overall": "3.5 ", "best_paper": "No", "replicability": "4 = They could mostly reproduce the results, but there may be some variation because of sample variance or minor variations in their interpretation of the protocol or method.", "datasets": "1 = No usable datasets submitted.", "software": "3 = Potentially useful: Someone might find the new software useful for their work."}, "meta": {"license": "Copyright © 2021 administered by the Association for Computational Linguistics (ACL)\n                                on behalf of ACL content contributors: None, and other contributors who wish to remain anonymous.\n                                Content is made available under a Creative Commons Attribution 4.0 International Public License.", "author_identity_guess": "1 = I do not have even an educated guess about author identity.", "confidence": "4 = Quite sure. I tried to check the important points carefully. It's unlikely, though conceivable, that I missed something that should affect my ratings.", "sentences": {"paper_summary": [[0, 181], [181, 323], [323, 393]], "summary_of_strengths": [[0, 86], [86, 243], [243, 316]], "summary_of_weaknesses": [[0, 132], [132, 276], [276, 503], [503, 663]], "comments,_suggestions_and_typos": [[0, 34]]}}}]