[{"rid": "c1af730b370c44b11d64851ee9d2f5ea9eb336b8c04301c2681c8d1bfdf213c74db334a970ae2b248018ee30be7a033c695c8c021292d26e3f53ccac0f23ec28", "reviewer": "Sheng Shen", "report": {"paper_summary": "This paper proposes a contrastive learning framework to learn phrase representations in an unsupervised way. Cluster-assisted contrastive learning is proposed to reduce noisy in-batch negatives by selecting negatives from clusters. Extensive experiments on entity clustering and topical phrase mining show the effectiveness of the proposed methods. Case studies are also provided that demonstrate coherent and diverse topical phrases can be founded by UCTopic without supervision. ", "summary_of_strengths": "- The paper is well-written and clearly presented.  - The proposed cluster-assisted contrastive learning objective is well-motivated and effective when finetuning the encoder on the target task further. Extensive experimental results are provided to show the significance of the proposed UCTopic versus baseline methods.  - Detailed discussion is also provided for different datasets to further analyze the effectiveness of the proposed method with respect to informativeness, diversity of the constructed phrases, and the source of phrase semantics. ", "summary_of_weaknesses": "- The details of how to apply K-Means methods to obtain the pseudo labels when using the CCL and how the number of clusters will affect the final performance is missing. ", "comments,_suggestions_and_typos": "- Given that sentence length might affect in Table 1, additional statistics of the pre-trained sentence length versus the might be good to provide.  - Could the author provide a more detailed description of how to construct the pre-training phrases and how many pre-training phrases are present and how these phrases overlapped with the downstream tasks? "}, "scores": {"overall": "3.5 ", "best_paper": "No", "replicability": "4 = They could mostly reproduce the results, but there may be some variation because of sample variance or minor variations in their interpretation of the protocol or method.", "datasets": "3 = Potentially useful: Someone might find the new datasets useful for their work.", "software": "4 = Useful: I would recommend the new software to other researchers or developers for their ongoing work."}, "meta": {"license": "Copyright © 2021 administered by the Association for Computational Linguistics (ACL)\n                                on behalf of ACL content contributors: Sheng Shen, and other contributors who wish to remain anonymous.\n                                Content is made available under a Creative Commons Attribution 4.0 International Public License.", "author_identity_guess": "1 = I do not have even an educated guess about author identity.", "confidence": "3 =  Pretty sure, but there's a chance I missed something. Although I have a good feel for this area in general, I did not carefully check the paper's details, e.g., the math or experimental design.", "sentences": {"paper_summary": [[0, 109], [109, 232], [232, 349], [349, 481]], "summary_of_strengths": [[0, 51], [51, 52], [52, 203], [203, 321], [321, 322], [322, 551]], "summary_of_weaknesses": [[0, 170]], "comments,_suggestions_and_typos": [[0, 148], [148, 149], [149, 355]]}}}, {"rid": "264cb031349df77aae892fcec24ac8091c98df747caed53f30a86441fa9a17de6ba0a4ae3b5dc57307d9d0c1eed83b62f06e5dc1d6a373448f0eb4d8d5c65477", "reviewer": null, "report": {"paper_summary": "The paper proposes a contrastive learning-based method for phrase representations and topic mining. Results show that the method achieves the best performance on topic mining and phrase representations. The proposed model can extract more diverse phrases. ", "summary_of_strengths": "1. The paper applies unsupervised contrastive learning to topic modeling, which is suitable for the unsupervised task. Results show that the proposed model can extract more diverse phrases. \n2. The authors also find that in the finetuning process, in-batch negative samples have a bad influence on the performance. So they propose a topic-assist contrastive learning method to reduce noises and turn the original finetuning process into a topic-specific finetuning process. \n3. Experiemnts results show that the proposed model achieves good performance on several datasets. ", "summary_of_weaknesses": "1. It seems that the biggest contribution of the paper is to apply contrastive learning to topic modeling, which is of limited novelty. \n2. Batch is a sampling method, so what is the major difference between batch and the proposed one? This limits the performance significantly. ", "comments,_suggestions_and_typos": "Suggestions: 1. It is a little bit confusing in the assumptions in section 1. First of all, “The phrase semantics are determined by their context.”. As for the examples in Figure 1, the semantic of phrase “ United States” is fixed and not influenced by the context. I think the writers want to express: if we mask “United States”, we can still infer the mask phrase by its context. \n2. Writing should be strengthened. "}, "scores": {"overall": "3.5 ", "best_paper": "No", "replicability": "3 = They could reproduce the results with some difficulty. The settings of parameters are underspecified or subjectively determined, and/or the training/evaluation data are not widely available.", "datasets": "3 = Potentially useful: Someone might find the new datasets useful for their work.", "software": "3 = Potentially useful: Someone might find the new software useful for their work."}, "meta": {"license": "Copyright © 2021 administered by the Association for Computational Linguistics (ACL)\n                                on behalf of ACL content contributors: None, and other contributors who wish to remain anonymous.\n                                Content is made available under a Creative Commons Attribution 4.0 International Public License.", "author_identity_guess": "1 = I do not have even an educated guess about author identity.", "confidence": "3 =  Pretty sure, but there's a chance I missed something. Although I have a good feel for this area in general, I did not carefully check the paper's details, e.g., the math or experimental design.", "sentences": {"paper_summary": [[0, 100], [100, 203], [203, 256]], "summary_of_strengths": [[0, 3], [3, 119], [119, 190], [190, 194], [194, 315], [315, 474], [474, 478], [478, 574]], "summary_of_weaknesses": [[0, 3], [3, 136], [136, 140], [140, 236], [236, 279]], "comments,_suggestions_and_typos": [[0, 16], [16, 78], [78, 149], [149, 266], [266, 382], [382, 386], [386, 418]]}}}]