[{"rid": "29b4b4ffced31f175c39dd09eb38b5d8fcbb8543641322dc87442f102fb354f48017201834d7e24d64832f7aea4fa4f5fc892898e767d19ebf974a2f372cd73e", "reviewer": "Yawei Sun", "report": {"paper_summary": "In this paper, the author proposes a deep-learning based inductive logic reasoning method. The method firstly extracts query-related (candidate-related) information. Then, the method conducts logic reasoning among the filtered information by inducing feasible rules that entail the target relation. The reasoning process is accomplished via attentive memories with novel differentiable logic operators. ", "summary_of_strengths": "1. Combining deep learning with ILP is interesting. The authors introduce a smooth connection between deep representation learning with logic reasoning by associating distributed representations with discrete logic predicates and their probabilistic evaluations. \n2. The research described in the paper seems technically sound and correct. ", "summary_of_weaknesses": "1. The experiments are not convincing. For example, the authors use the development dataset to evaluate the results. Test data is not publicly available. The reason is insufficient. In addition, four different query relations is small. It is hard to convince the effectiveness of DILR. \n2. This work is not clearly written. For example, the second paragraph of section 5.1 should be rewritten and divided into more than one paragraph. ", "comments,_suggestions_and_typos": "1. What is DNNs, in Section 1 Introduction ? \n2. The rule is \"if A is in B and B is part of country C, then A is in country C\". How to solve the example by DILR? Specifically, how to process the example by Hierarchical Attentive Reader and Multi-hop Reasoner ? \n3. BERT is a strong baseline model from Table 1. Do you explain why DILR-BERT is stronger than BERT in detail? "}, "scores": {"overall": "3.5 ", "best_paper": "No", "replicability": "4 = They could mostly reproduce the results, but there may be some variation because of sample variance or minor variations in their interpretation of the protocol or method.", "datasets": "1 = No usable datasets submitted.", "software": "1 = No usable software released."}, "meta": {"license": "Copyright © 2021 administered by the Association for Computational Linguistics (ACL)\n                                on behalf of ACL content contributors: Yawei Sun, and other contributors who wish to remain anonymous.\n                                Content is made available under a Creative Commons Attribution 4.0 International Public License.", "author_identity_guess": "1 = I do not have even an educated guess about author identity.", "confidence": "4 = Quite sure. I tried to check the important points carefully. It's unlikely, though conceivable, that I missed something that should affect my ratings.", "sentences": {"paper_summary": [[0, 91], [91, 166], [166, 299], [299, 403]], "summary_of_strengths": [[0, 3], [3, 52], [52, 263], [263, 267], [267, 340]], "summary_of_weaknesses": [[0, 3], [3, 39], [39, 117], [117, 154], [154, 182], [182, 236], [236, 286], [286, 290], [290, 324], [324, 435]], "comments,_suggestions_and_typos": [[0, 3], [3, 45], [45, 49], [49, 128], [128, 162], [162, 261], [261, 265], [265, 311], [311, 373]]}}}, {"rid": "1d7c93153cb5e57842e155c6ff468bd1e7d170925c9b4ce13cc2a3fd8f767a48b5a83d784d2cf7c57169e9e46ac3b9ff5e92755d8fc7c65277ab3691a6db4bc9", "reviewer": null, "report": {"paper_summary": "***This is from the reviewer `2guV` of the previous version.***\nI have read the responses from the authors to these weaknesses and I think most of them are well addressed in the revised version. Thus, I have raised my overall score. \n----- This paper presents a multi-hop reasoning method to reading comprehension with structured queries in the format of triplets (subject, relation, ?) --- predicting the object of a triplet via reading multiple documents. The key idea of the proposed method is to combine neural token representations and inductive logic programming (ILP) so that the reasoning chains are more interpretable to humans. The proposed method DILR is an end-to-end model, consisting of a hierarchical attentive reader module and a multi-hop logic reasoner, where the former continually produces a query&context-aware representation of entities, and the latter use them for softly selecting atoms to form logic clauses. A highlight of such a neural-symbolic method is that the final loss can smoothly be back-propagated to the trainable modules. ", "summary_of_strengths": "- The proposed method avoids using pre-extracted NER results and limited rule templates. Instead, the module learns to select the atoms end-to-end and does improve the performance.\n- The logic rules and attentions are naturally interpretable and can be used for understanding the reasoning process of the model. ", "summary_of_weaknesses": "- The evaluation part lacks the results of recent pre-trained LMs' results such as RoBERTa and UnifiedQA, etc, which thus makes the results and conclusions less convincing. It is unclear if the performance gain from DILR is still there if with a more powerful pre-trained LM. And also, it seems that the DILR-BERT doesn't fine-tune the BERT parameters? From the description, I feel like the BERT here is only used as an encoder to get contextualized representation but is not trainable. Please correct me if I missed anything here.\n- The model is limited to the triplet-format questions, which is limited to a pre-defined list of relations and may not generalize to other MRC datasets and other relations.\n- There are a few missing baseline methods such as DrKIT (Bhuwan Dhingra et al. ICLR 2020), which is also a differentiable multi-hop reasoning framework, focusing on entity mentions. Please also look at the datasets and baseline methods this paper used for evaluation.\n- There is no qualitative analysis of the used logic clauses for case studies. It's unclear whether the logic clauses induced by the DILR are really meaningful to reason about the answers.\n---  I have read the responses from the authors to these weaknesses and I think most of them are well addressed in the revised version. Thus, I have raised my overall score. ", "comments,_suggestions_and_typos": "N/A ", "ethical_concerns": "N/A "}, "scores": {"overall": "3.5 ", "best_paper": "No", "replicability": "3 = They could reproduce the results with some difficulty. The settings of parameters are underspecified or subjectively determined, and/or the training/evaluation data are not widely available.", "datasets": "1 = No usable datasets submitted.", "software": "1 = No usable software released."}, "meta": {"license": "Copyright © 2021 administered by the Association for Computational Linguistics (ACL)\n                                on behalf of ACL content contributors: None, and other contributors who wish to remain anonymous.\n                                Content is made available under a Creative Commons Attribution 4.0 International Public License.", "author_identity_guess": "1 = I do not have even an educated guess about author identity.", "confidence": "3 =  Pretty sure, but there's a chance I missed something. Although I have a good feel for this area in general, I did not carefully check the paper's details, e.g., the math or experimental design.", "sentences": {"paper_summary": [[0, 64], [64, 195], [195, 233], [233, 240], [240, 391], [391, 458], [458, 638], [638, 934], [934, 1060]], "summary_of_strengths": [[0, 89], [89, 181], [181, 312]], "summary_of_weaknesses": [[0, 173], [173, 276], [276, 353], [353, 487], [487, 532], [532, 706], [706, 889], [889, 975], [975, 1054], [1054, 1164], [1164, 1300], [1300, 1338]], "comments,_suggestions_and_typos": [[0, 4]], "ethical_concerns": [[0, 4]]}}}, {"rid": "35b575479428229666d5a876848bcefc7c9c4a0a43dda8805f608913e1244f371ac80a6e25040e10e408ec135575bd6b85c5394b274ee35499c198d410065588", "reviewer": null, "report": {"paper_summary": "The authors present a neuro-symbolic approach to answer multi-hop questions by combining neural representations with differentiable ILP reasoning. They show the effectiveness of their approach on multiple-choice structured queries (Wikihop and Medhop dataset). The improvements are noteworthy, albeit on a narrow task. The authors have done a good job responding to previous reviews and making appropriate changes where possible. However, I think the system description is still very involved and make it hard to judge the technical contributions of their system. ", "summary_of_strengths": "- A novel approach that combines deep-learning with logic(ILP)  - An attention-based approach to produce representations that do not rely on NER - Improved scores on WikiHop and MedHop subsets compared to prior work - Ablations show clear benefit of each part of their system ", "summary_of_weaknesses": "- Complicated system with a narrow scope (but that seems to be the current issue with other neuro-ILP work too)   - Complex attention mechanisms that are hard to interpret - The Complexity vs Accuracy tradeoff may not be worth it (e.g. BERT is a much much simpler model with a marginal drop in accuracy). The interpretability of the soft rules could be a potential benefit of the DILR approach, but it is still limited (no interpretation on relations, mostly attention-based entity chains) ", "comments,_suggestions_and_typos": "- #54: Min et al 2019 is a decomposition-based approach not a Neural Module Network - #55: Doesn't your attention-based approach also implicitly encodes relevant contexts into unnamed relations?\n- #277: What is i and j here refer to? It is only introduced later on the next page. It would help if every term is clearly defined. I would even be okay if the equations are only spelled out in the appendix with the main paper only using some meaningful function names. E.g. B_ij = subj_context_attn(S, C) - It would help a lot in terms of understanding if the indices are not shared. E.g if \"i\" refers to a token in the subject, don't use it to also refer to the index in the answer candidate later. This will make the reader's life much easier since []_{ij} would then always refer to the attention between the subject and context. We don't have to carefully look around each equation to understand the meaning of each term.\n- In 4.2, please think about what are the key ideas that you want the reader to know vs what are the key details needed for reproducibility. Try to move the latter to an appendix.  - The description of the BERT model is unclear. You get the representations for the query-subject OR the candidate? Shouldn't you be getting a representation for query-subject-candidate-context for each candidate and context? Or do you get multiple vector representations and concatenate them? \n  - Are all the models re-trained on the same subset? "}, "scores": {"overall": "3.5 ", "best_paper": "No", "replicability": "3 = They could reproduce the results with some difficulty. The settings of parameters are underspecified or subjectively determined, and/or the training/evaluation data are not widely available.", "datasets": "1 = No usable datasets submitted.", "software": "2 = Documentary: The new software will be useful to study or replicate the reported research, although for other purposes it may have limited interest or limited usability. (Still a positive rating)"}, "meta": {"license": "Copyright © 2021 administered by the Association for Computational Linguistics (ACL)\n                                on behalf of ACL content contributors: None, and other contributors who wish to remain anonymous.\n                                Content is made available under a Creative Commons Attribution 4.0 International Public License.", "author_identity_guess": "1 = I do not have even an educated guess about author identity.", "confidence": "3 =  Pretty sure, but there's a chance I missed something. Although I have a good feel for this area in general, I did not carefully check the paper's details, e.g., the math or experimental design.", "sentences": {"paper_summary": [[0, 147], [147, 261], [261, 319], [319, 430], [430, 564]], "summary_of_strengths": [[0, 64], [64, 145], [145, 216], [216, 276]], "summary_of_weaknesses": [[0, 114], [114, 172], [172, 305], [305, 490]], "comments,_suggestions_and_typos": [[0, 84], [84, 195], [195, 234], [234, 280], [280, 328], [328, 466], [466, 502], [502, 581], [581, 697], [697, 830], [830, 923], [923, 1064], [1064, 1103], [1103, 1104], [1104, 1152], [1152, 1220], [1220, 1330], [1330, 1398], [1398, 1401], [1401, 1453]]}}}]