[{"rid": "f50c6edd6f7d33a87cd3ca0f768b3ea2e5f143c7b33128fc10a07f6aa74f835344dc2d1b88a5e003a20aa8982989d1238934cdba7b7fffb7dc7e462ad73dc5a8", "reviewer": "Malte Ostendorff", "report": {"paper_summary": "The paper presents a sentence-level matching method for fine-grain document similarity of research papers (named ASPIRE). The method relies on co-citation sentences as learning signal to train a multi-vector model. The key difference to related work is the ability of determining paper’s similarity not only on a single aspect but multiple ones, whereby the set of aspects is not predefined.  The method uses a combination of a SciBERT encoder, contrastive learning, multi-instance learning, and optimal transport. In experiments with four datasets all baselines are outperformed. Besides the promising experimental results, one strength of presented method is its scalable inference that could easily enable future applications based on the method. ", "summary_of_strengths": "- ASPIRE outperforms the strong baselines (e.g., SPECTER).\n- A series of relevant ablations are presented. \n-Even though the paper presents a niche topic, the approach is important and could be also applied on other domains apart from scientific documents. \n-The multi vector approach makes aspect similarity feasible for production environments due to scalable inference (with ANN). ", "summary_of_weaknesses": "- The approach description (§ 3) is partially difficult to follow and should be revised. The additional page of the camera-ready version should be used to extend the approach description (rather than adding more experiments).\n- CSFCube results are not reported with the same metrics as in the original publication making a comparison harder than needed. ", "comments,_suggestions_and_typos": "- The standard deviation from the Appendix could be added to Table 1 at least for one metric. There should be enough horizontal space.\n- Notation of BERT_\\theta and BERT_\\epsilon is confusing. Explicitly calling them the co-citation sentence encoder and the paper encoder could make it clearer.  - How are negative sampled for BERT_\\epsilon?\nAdditional relevant literature: - Luu, K., Wu, X., Koncel-Kedziorski, R., Lo, K., Cachola, I., & Smith, N.A. (2021). Explaining Relationships Between Scientific Documents. ACL/IJCNLP.\n- Malte Ostendorff, Terry Ruas, Till Blume, Bela Gipp, Georg Rehm. Aspect-based Document Similarity for Research Papers. COLING 2020.\nTypos: -\tLine 259: “cotation” -\tLine 285: Missing “.” "}, "scores": {"overall": "4 = Strong: This paper is of significant interest (for broad or narrow sub-communities), and warrants acceptance in a top-tier *ACL venue if space allows.", "best_paper": "No", "replicability": "4 = They could mostly reproduce the results, but there may be some variation because of sample variance or minor variations in their interpretation of the protocol or method.", "datasets": "1 = No usable datasets submitted.", "software": "4 = Useful: I would recommend the new software to other researchers or developers for their ongoing work."}, "meta": {"license": "Copyright © 2021 administered by the Association for Computational Linguistics (ACL)\n                                on behalf of ACL content contributors: Malte Ostendorff, and other contributors who wish to remain anonymous.\n                                Content is made available under a Creative Commons Attribution 4.0 International Public License.", "author_identity_guess": "3 = From the contents of the submission itself, I know/can guess at least one author's name.", "confidence": "4 = Quite sure. I tried to check the important points carefully. It's unlikely, though conceivable, that I missed something that should affect my ratings.", "sentences": {"paper_summary": [[0, 122], [122, 215], [215, 392], [392, 393], [393, 515], [515, 581], [581, 750]], "summary_of_strengths": [[0, 59], [59, 107], [107, 257], [257, 384]], "summary_of_weaknesses": [[0, 89], [89, 226], [226, 354]], "comments,_suggestions_and_typos": [[0, 94], [94, 135], [135, 193], [193, 295], [295, 296], [296, 342], [342, 374], [374, 459], [459, 514], [514, 526], [526, 593], [593, 647], [647, 660], [660, 714]]}}}, {"rid": "30aa157cc690ecbf3ee3034c035b2533e3c1a2e99c7ce2c797371c7c758de51b77204c36880a0163059bed31ff962c7a97d94be7c6d287e09e1c2e2a93ac4e1e", "reviewer": "Jingang Wang", "report": {"paper_summary": "This paper tries to use co-citations in full-text papers to learn an aspect matching model with fine-grained aspect representation of paper abstracts in sentence level for fine-grained retrieval, and it also achieves to compute document-level distance with a multi-vector document similarity model for abstract level retrieval. ", "summary_of_strengths": "Advantages of this paper are as follows. \n• Co-citations used in this paper seems to be a new data source for fine-grained retrieval task. \n• The proposed ASPIRE model uses co-citing sentences as textual supervision signals to train fine-grained retrieval models. \n• This paper gets good performance across several datasets. ", "summary_of_weaknesses": "Weaknesses of the paper: • The mix of different approaches and tasks leads to a confusion for readers. \n• The logic flow of the paper needs to be improved. \n• Not sure why the proposed model work for the experimental datasets, since those datasets do not have such textual supervision as co-citing sentences. \n• There are no comparison and contrast between proposed approaches and baselines. ", "comments,_suggestions_and_typos": "I strongly suggest to improve the narrative of the paper. "}, "scores": {"overall": "2.5 ", "best_paper": "No", "replicability": "3 = They could reproduce the results with some difficulty. The settings of parameters are underspecified or subjectively determined, and/or the training/evaluation data are not widely available.", "datasets": "1 = No usable datasets submitted.", "software": "1 = No usable software released."}, "meta": {"license": "Copyright © 2021 administered by the Association for Computational Linguistics (ACL)\n                                on behalf of ACL content contributors: Jingang Wang, and other contributors who wish to remain anonymous.\n                                Content is made available under a Creative Commons Attribution 4.0 International Public License.", "author_identity_guess": "1 = I do not have even an educated guess about author identity.", "confidence": "3 =  Pretty sure, but there's a chance I missed something. Although I have a good feel for this area in general, I did not carefully check the paper's details, e.g., the math or experimental design.", "sentences": {"paper_summary": [[0, 328]], "summary_of_strengths": [[0, 41], [41, 139], [139, 264], [264, 325]], "summary_of_weaknesses": [[0, 103], [103, 156], [156, 309], [309, 392]], "comments,_suggestions_and_typos": [[0, 58]]}}}]