[{"rid": "89eada3482fa6a3f6a91b917f657fe02cf1194ab05ad493f2c98defa704cf823661f722f36e11820781b4469cf6fc5b7b59efbf694e7632fe51309ea9a35b908", "reviewer": null, "report": {"paper_summary": "This paper proposes a method based on Optimal Transport (OT) to simultaneously incorporate the interaction between syntax and semantics as part of the content preservation objective for Text Style Transfer (TST) training. The intuition is based upon the hypothesis that semantically related words in both sentences should have the same syntactic importance too. Since two differently styled sentences can have different number of words causing similar words to appear at another levels, the authors propose to use OT for computing the optimal method for transitioning from one distribution to the other.\nThe authors evaluate the proposed method on three benchmark datasets using supervised and unsupervised settings and claim to achieve new SoTA results. ", "summary_of_strengths": "1. SoTA results on all four experimental directions : Informal <-> Formal, Informal -> Formal, Informal <-> Formal & Combined Domains, BLEU evaluated against the first reference. \n2. Ablation experiments for proving the efficacy of the proposed OT based method. \n3. Corroboration of the results with human evaluation ", "summary_of_weaknesses": "1. Lack of analysis to test the statistical stability of the proposed method (i.e. considering multiple generated hypotheses and comparing the score variability). ", "comments,_suggestions_and_typos": "Typos: L504: Compared to* the baselines "}, "scores": {"overall": "4 = Strong: This paper is of significant interest (for broad or narrow sub-communities), and warrants acceptance in a top-tier *ACL venue if space allows.", "best_paper": "No", "replicability": "5 = They could easily reproduce the results.", "datasets": "1 = No usable datasets submitted.", "software": "4 = Useful: I would recommend the new software to other researchers or developers for their ongoing work."}, "meta": {"license": "Copyright © 2021 administered by the Association for Computational Linguistics (ACL)\n                                on behalf of ACL content contributors: None, and other contributors who wish to remain anonymous.\n                                Content is made available under a Creative Commons Attribution 4.0 International Public License.", "author_identity_guess": "1 = I do not have even an educated guess about author identity.", "confidence": "3 =  Pretty sure, but there's a chance I missed something. Although I have a good feel for this area in general, I did not carefully check the paper's details, e.g., the math or experimental design.", "sentences": {"paper_summary": [[0, 222], [222, 362], [362, 604], [604, 755]], "summary_of_strengths": [[0, 3], [3, 179], [179, 183], [183, 262], [262, 266], [266, 317]], "summary_of_weaknesses": [[0, 3], [3, 163]], "comments,_suggestions_and_typos": [[0, 40]]}}}]