[{"rid": "6de4c24feda039f610f2f5499017edf441c88aa4ccfcd935c5311e14cb3a538507eae0a124803d5f1852a085fc55e85971be82ce03f925c776ba7dcb86604511", "reviewer": null, "report": {"paper_summary": "The paper describes a transformer that has a block (a component that's enhanced by residual connection). replaced (or enhanced) by ordinary differential equation. The claims are that this method while adding a (reasonably small) computational cost overhead. ", "summary_of_strengths": "Definitely a novel work. Reasonably well described, extensive evaluation. ", "summary_of_weaknesses": "Evaluation is done on very old WMT datasets. It's difficult to claim that those results are state of the art, because those datasets are small by today's standard. Most improvements of MT architectures are shown to not hold out when evaluated rigorously on a wide array of datasets and one of the problems is the dataset size: https://arxiv.org/abs/2102.11972 Nevertheless, the main contribution of this paper is a novel transformer architecture and the evaluation results can be taken as a sanity check. ", "comments,_suggestions_and_typos": "Please include a more recent big datasets for evaluation. "}, "scores": {"overall": "4 = Strong: This paper is of significant interest (for broad or narrow sub-communities), and warrants acceptance in a top-tier *ACL venue if space allows.", "best_paper": "No", "replicability": "3 = They could reproduce the results with some difficulty. The settings of parameters are underspecified or subjectively determined, and/or the training/evaluation data are not widely available.", "datasets": "1 = No usable datasets submitted.", "software": "1 = No usable software released."}, "meta": {"license": "Copyright © 2021 administered by the Association for Computational Linguistics (ACL)\n                                on behalf of ACL content contributors: None, and other contributors who wish to remain anonymous.\n                                Content is made available under a Creative Commons Attribution 4.0 International Public License.", "author_identity_guess": "1 = I do not have even an educated guess about author identity.", "confidence": "2 =  Willing to defend my evaluation, but it is fairly likely that I missed some details, didn't understand some central points, or can't be sure about the novelty of the work.", "sentences": {"paper_summary": [[0, 105], [105, 163], [163, 258]], "summary_of_strengths": [[0, 25], [25, 74]], "summary_of_weaknesses": [[0, 45], [45, 164], [164, 360], [360, 505]], "comments,_suggestions_and_typos": [[0, 58]]}}}]