[{"rid": "0a403ec48d3198d320628d852e9d215734dd5b90e7550c2f7e94480e4f3838c337bd750b3183e4dfde5d7ab98546c927689c027e6fcab5451486c3938a682b7b", "reviewer": null, "report": {"paper_summary": "This paper aims at generating more meaningful questions for education considering predicting question types and making an event-centric summarization. Experiments show the usefulness of these two tasks. ", "summary_of_strengths": "The idea is intuitive and effective. The method could be useful for QG or NLG community. ", "summary_of_weaknesses": "The claim of high cognitive demand question generation can not convince me. \nIn my view, the authors’ method helps the QG model focus on the summarized event. \nIt is similar to the sentence editing/rewriting task conditioned on the question type. \nWhy not extract keywords or event tuples? What is the difference? \nThe comparison is unfair. I can not understand why you concatenate all questions into one sentence. \nMy suggestion is to perform the QG task on each question type. \nCase study and Error analysis are expected. ", "comments,_suggestions_and_typos": "N/A "}, "scores": {"overall": "3 = Good: This paper is of interest to the *ACL audience and could be published, but might not be appropriate for a top-tier publication venue. It would likely be a strong paper in a suitable workshop.", "best_paper": "No", "replicability": "4 = They could mostly reproduce the results, but there may be some variation because of sample variance or minor variations in their interpretation of the protocol or method.", "datasets": "1 = No usable datasets submitted.", "software": "1 = No usable software released."}, "meta": {"license": "Copyright © 2021 administered by the Association for Computational Linguistics (ACL)\n                                on behalf of ACL content contributors: None, and other contributors who wish to remain anonymous.\n                                Content is made available under a Creative Commons Attribution 4.0 International Public License.", "author_identity_guess": "1 = I do not have even an educated guess about author identity.", "confidence": "4 = Quite sure. I tried to check the important points carefully. It's unlikely, though conceivable, that I missed something that should affect my ratings.", "sentences": {"paper_summary": [[0, 151], [151, 203]], "summary_of_strengths": [[0, 37], [37, 89]], "summary_of_weaknesses": [[0, 76], [76, 159], [159, 247], [247, 290], [290, 314], [314, 341], [341, 415], [415, 479], [479, 524]], "comments,_suggestions_and_typos": [[0, 4]]}}}, {"rid": "f9d269c23f60eedad27e62a19e6ebd7fd010adf8438300f82e884864442f16143fda1357243da801d6d4ee66072057c58d1ddd9e11831a6ebaa4fa48739c3622", "reviewer": null, "report": {"paper_summary": "This paper investigates an interesting problem of automatically generating high-cognitive-demand educational questions for children’s storybooks. To this end, this paper proposes a three-stage framework: 1) learn to predict the question type distribution, 2) extract salient question-worthy events from the text, and 3) generate educational questions based on the outputs from steps 1) and 2). Both automatic and human evaluation validates the effectiveness of the proposed method. ", "summary_of_strengths": "- A well-motivated task worthy of study by the QG community. It is practically meaningful to generate educational questions for children's storybooks and it could be applied to many real-world educational applications.  - The proposed framework is straightforward but logically sound.  - The authors conducted comprehensive evaluation, including the automatic evaluation and human evaluation.  - The paper is fairly easy to follow. ", "summary_of_weaknesses": "- This work is a bit incremental since it is basically an improved model of Yao et al., 2021 for FairytaleQA.  - Each component of the framework is based on existing works. For example, BERT for learning question type distribution, BART for summary generation, and question generation. Therefore, I don't see many technical contributions from this paper.  - The performance improvement over Yao et al., 2021 also seems a bit incremental in terms of BERTScore and human evaluation results. ", "comments,_suggestions_and_typos": "Putting together all the strengths and weaknesses I believe the NLP and QG community will benefit from this work. However, at the same time, it does leave things to be desired. Nonetheless, I am slightly inclined to accept this work.  Some minor suggestions & questions:  - Line 516: \"We can see that our method has a better estimation of the distribution of question types, which is closer to the distribution of the ground-truth.\" Does this count as an advantage of the proposed model? I think a perfect fit of FairytaleQA's distribution of question types shows that the model can better overfit the FairytaleQA dataset, but this may hurt its generalizability to other datasets.  - In Line 136, the authors missed some related works about multi-sentence / multi-document QG, for example:    - Pan et al. Semantic Graphs for Generating Deep Questions. ACL, 2020. \n  - Xie et al. Exploring Question-Specific Rewards for Generating Deep Questions. COLING, 2020. \n  - Tuan et al. Capturing Greater Context for Question Generation. AAAI, 2020. "}, "scores": {"overall": "3.5 ", "best_paper": "No", "replicability": "4 = They could mostly reproduce the results, but there may be some variation because of sample variance or minor variations in their interpretation of the protocol or method.", "datasets": "1 = No usable datasets submitted.", "software": "4 = Useful: I would recommend the new software to other researchers or developers for their ongoing work."}, "meta": {"license": "Copyright © 2021 administered by the Association for Computational Linguistics (ACL)\n                                on behalf of ACL content contributors: None, and other contributors who wish to remain anonymous.\n                                Content is made available under a Creative Commons Attribution 4.0 International Public License.", "author_identity_guess": "1 = I do not have even an educated guess about author identity.", "confidence": "4 = Quite sure. I tried to check the important points carefully. It's unlikely, though conceivable, that I missed something that should affect my ratings.", "sentences": {"paper_summary": [[0, 146], [146, 394], [394, 482]], "summary_of_strengths": [[0, 61], [61, 219], [219, 220], [220, 285], [285, 286], [286, 393], [393, 394], [394, 432]], "summary_of_weaknesses": [[0, 110], [110, 111], [111, 173], [173, 286], [286, 355], [355, 356], [356, 489]], "comments,_suggestions_and_typos": [[0, 114], [114, 177], [177, 234], [234, 235], [235, 272], [272, 433], [433, 488], [488, 681], [681, 682], [682, 853], [853, 864], [864, 947], [947, 961], [961, 1029], [1029, 1041]]}}}]