[{"rid": "c9e07574b08c7c4d0effb33c800855f358653db7167f6d3547696c380a8353c7f13d8253927da31d2f985df3709a41e9973e5e76c92a4f5f16752f40f1ceaecc", "reviewer": null, "report": {"paper_summary": "See my previous summary.\nAfter reading the authors' response, most questions and concerns are addressed.  The remaining concern I have is the instability of major PLMs (e.g., https://openreview.net/forum?id=nzpLWnVAyah), where PLMs are very sensitive to hyper-parameters both in pre-training and fine-tuning. \nThis paper explores language abilities of PLM(s), but each PLM is based on a single hyper-parameter configuration (learning rate, batch size, number of updates etc.). Considering the instability of PLMs, my concern is that the findings of this paper might not be supported when we use different hyper-parameters (e.g., using different random seeds, learning rates, batch sizes).  It would be great to mention this phenomenon/possibility in the paper. ", "summary_of_strengths": "see above ", "summary_of_weaknesses": "see above ", "comments,_suggestions_and_typos": "I appreciate authors' response. I raised my score. "}, "scores": {"overall": "3 = Good: This paper is of interest to the *ACL audience and could be published, but might not be appropriate for a top-tier publication venue. It would likely be a strong paper in a suitable workshop.", "best_paper": "No", "replicability": "4 = They could mostly reproduce the results, but there may be some variation because of sample variance or minor variations in their interpretation of the protocol or method.", "datasets": "4 = Useful: I would recommend the new datasets to other researchers or developers for their ongoing work.", "software": "1 = No usable software released."}, "meta": {"license": "Copyright © 2021 administered by the Association for Computational Linguistics (ACL)\n                                on behalf of ACL content contributors: None, and other contributors who wish to remain anonymous.\n                                Content is made available under a Creative Commons Attribution 4.0 International Public License.", "author_identity_guess": "1 = I do not have even an educated guess about author identity.", "confidence": "4 = Quite sure. I tried to check the important points carefully. It's unlikely, though conceivable, that I missed something that should affect my ratings.", "sentences": {"paper_summary": [[0, 25], [25, 105], [105, 106], [106, 309], [309, 477], [477, 689], [689, 690], [690, 761]], "summary_of_strengths": [[0, 10]], "summary_of_weaknesses": [[0, 10]], "comments,_suggestions_and_typos": [[0, 32], [32, 51]]}}}, {"rid": "25d81c5100d51b1e76e62a58136ddf202f0cd593dce3022314fa2faf872ce35425d15424a77e74592c2b856df0c9814c93b25c8d33ed6e03a9808afb71c740b5", "reviewer": "Thang Vu", "report": {"paper_summary": "I reviewed this paper in September. Since the authors did not update their paper, my comments and scores for this paper stay unchanged. ", "summary_of_strengths": "See review in Sept. ", "summary_of_weaknesses": "See review in Sept. ", "comments,_suggestions_and_typos": "See review in Sept. "}, "scores": {"overall": "3 = Good: This paper is of interest to the *ACL audience and could be published, but might not be appropriate for a top-tier publication venue. It would likely be a strong paper in a suitable workshop.", "best_paper": "No", "replicability": "3 = They could reproduce the results with some difficulty. The settings of parameters are underspecified or subjectively determined, and/or the training/evaluation data are not widely available.", "datasets": "3 = Potentially useful: Someone might find the new datasets useful for their work.", "software": "1 = No usable software released."}, "meta": {"license": "Copyright © 2021 administered by the Association for Computational Linguistics (ACL)\n                                on behalf of ACL content contributors: Thang Vu, and other contributors who wish to remain anonymous.\n                                Content is made available under a Creative Commons Attribution 4.0 International Public License.", "author_identity_guess": "1 = I do not have even an educated guess about author identity.", "confidence": "3 =  Pretty sure, but there's a chance I missed something. Although I have a good feel for this area in general, I did not carefully check the paper's details, e.g., the math or experimental design.", "sentences": {"paper_summary": [[0, 36], [36, 136]], "summary_of_strengths": [[0, 20]], "summary_of_weaknesses": [[0, 20]], "comments,_suggestions_and_typos": [[0, 20]]}}}]