[{"rid": "ed6a448153d21c5e87700a26686a8bc5c1f967ef8e12c2d42787ac5d1b0b5f08beb12de91b6038d5a330fab97a5da343759b8e3ebe07fc958d1a32ab6cb23290", "reviewer": null, "report": {"paper_summary": "This paper dealt with a interchange intervention training with a distillation technique. They propose to train a student model to become a causal abstraction of a teacher model, which is faithful with a simpler causal structure. Their experimental results show that the proposed method improved some tasks compared with a standard distillation method. ", "summary_of_strengths": "+ Distillation method with a causal abstraction is novel approach. \n+ They experimented the proposed method with various types of tasks. ", "summary_of_weaknesses": "+ They did not show the detailed method (of distillation training procedure) in the paper. They should include them in main text not in appendix. \n+ They should explain why the proposed model can deal with a causal abstraction. At least they should show some samples and analyze them. \n+ They should compare among the proposed methods and analyze these results. ", "comments,_suggestions_and_typos": "+ Performance of each teacher model should be shown in Table 1. \n+ They can use the following paper: Knowledge Distillation from Internal Representations [Aguilar, AAAI20] "}, "scores": {"overall": "2.5 ", "best_paper": "No", "datasets": "1 = No usable datasets submitted.", "software": "1 = No usable software released."}, "meta": {"license": "Copyright © 2021 administered by the Association for Computational Linguistics (ACL)\n                                on behalf of ACL content contributors: None, and other contributors who wish to remain anonymous.\n                                Content is made available under a Creative Commons Attribution 4.0 International Public License.", "author_identity_guess": "1 = I do not have even an educated guess about author identity.", "confidence": "3 =  Pretty sure, but there's a chance I missed something. Although I have a good feel for this area in general, I did not carefully check the paper's details, e.g., the math or experimental design.", "sentences": {"paper_summary": [[0, 89], [89, 229], [229, 352]], "summary_of_strengths": [[0, 67], [67, 137]], "summary_of_weaknesses": [[0, 91], [91, 146], [146, 228], [228, 285], [285, 362]], "comments,_suggestions_and_typos": [[0, 64], [64, 172]]}}}]