[{"rid": "c699ea82d7e1a59a1d1150c2e72b55ab4bf610e77fbda9f9b98bd97966efd6f07ca36041b3de5c3581ef330b3197a40c6939ab9c417a4d0b945b227c88c768ae", "reviewer": null, "report": {"paper_summary": "This paper proposes a trainable subgraph retriever (SR) that acts as a plug-in module to enhance subgraph-oriented knowledge base question answering (KBQA) frameworks. The authors decouple the subgraph retriever from the reasoner based on the probabilistic formalization of KBQA. The subgraph retriever constructs the subgraph by expanding paths from topic entities and merging the trees. The authors explore weak supervision and distant supervision for training the subgraph retriever and also propose an end-to-end training method to jointly learn the retriever and reasoner. Extensive experiments show that the proposed method shows significant improvement over existing subgraph-oriented KBQA models. ", "summary_of_strengths": "1. \tThe proposed method is very novel. The decoupled retriever and reasoner are substantially different from existing works. Different training strategies and an end-to-end variant are also studied. \n2. \tThe proposed method shows significant improvement over previous methods. \n3. \tThe experiments are very comprehensive and solid. \n4. \tThe paper is well-written and easy to follow. \n5. \tCode is provided and well-organized. ", "summary_of_weaknesses": "1. \tWhile the proposed method is more effective than the previous methods, the efficiency (e.g. training and inference speed) is not compared. ", "comments,_suggestions_and_typos": "Question: 1. \tFor the end-to-end variant, are the retrieving and the reasoning also intertwined as in previous works? Any intuition on why the proposed method is better?\nTypos and Formatting Issues: 1. \tLine 53: the publication year is missing from the citation for WebQSP. \n2. \tThe caption of the table should be put on top. \n3. \tLine 435: a space is missing between “statement.” and “SR”. \n4. \tLine 576: proves -> prove. "}, "scores": {"overall": "4 = Strong: This paper is of significant interest (for broad or narrow sub-communities), and warrants acceptance in a top-tier *ACL venue if space allows.", "best_paper": "No", "replicability": "5 = They could easily reproduce the results.", "datasets": "1 = No usable datasets submitted.", "software": "4 = Useful: I would recommend the new software to other researchers or developers for their ongoing work."}, "meta": {"license": "Copyright © 2021 administered by the Association for Computational Linguistics (ACL)\n                                on behalf of ACL content contributors: None, and other contributors who wish to remain anonymous.\n                                Content is made available under a Creative Commons Attribution 4.0 International Public License.", "author_identity_guess": "1 = I do not have even an educated guess about author identity.", "confidence": "3 =  Pretty sure, but there's a chance I missed something. Although I have a good feel for this area in general, I did not carefully check the paper's details, e.g., the math or experimental design.", "sentences": {"paper_summary": [[0, 168], [168, 280], [280, 389], [389, 578], [578, 705]], "summary_of_strengths": [[0, 3], [3, 39], [39, 125], [125, 199], [199, 203], [203, 277], [277, 281], [281, 332], [332, 336], [336, 383], [383, 387], [387, 425]], "summary_of_weaknesses": [[0, 3], [3, 143]], "comments,_suggestions_and_typos": [[0, 13], [13, 118], [118, 170], [170, 202], [202, 274], [274, 278], [278, 326], [326, 330], [330, 381], [381, 391], [391, 395], [395, 423]]}}}, {"rid": "cef38cf1ce556879df7ee50de2bb4b1dd8f64fd063748c48843394191072c5e746d815f659c139920513eb500f984ec1852fd6fe10d93b440e5ecf8478be1c7d", "reviewer": "Nan Shao", "report": {"paper_summary": "In this paper, the authors propose a trainable subgraph retriever (SR) decoupled from the subsequent reasoning process, which enables a plug-and-play framework to enhance any subgraph-oriented KBQA model. The paper also propose a weakly supervised pre-training for SR and a unsupervised pre-training method for the retriever. Extensive experiments are conducted on two KBQA datasets: WebQSP and CWQ. \nThe experimental results show the proposed subgraph retriever and training strategy significantly improve retrieval perfomance and achieve the SOTA performance.\nThe paper is a standard ACL-level paper and I tend to recommend to accept it. ", "summary_of_strengths": "1. The intuition that decouple subgraph retriever and reasoner seems reasonable. \n2. The paper gives clear problem deﬁnition and formalized discussion, which makes the proposed method more convincing. \n3. Extensive experiments, clear and significant improvements. \n3. Good writting. ", "summary_of_weaknesses": "1. The method is too complicated, may be hard to follow. ( but the authors public their code) 2. The  proposed weakly supervised pre-training method and unsupervised pre-training method seem not very related to the main contribution of the paper. ", "comments,_suggestions_and_typos": "It's better to also append the results of proposed weakly supervised pre-training method and unsupervised pre-training method  to the main table (Table 2). "}, "scores": {"overall": "4 = Strong: This paper is of significant interest (for broad or narrow sub-communities), and warrants acceptance in a top-tier *ACL venue if space allows.", "best_paper": "No", "replicability": "4 = They could mostly reproduce the results, but there may be some variation because of sample variance or minor variations in their interpretation of the protocol or method.", "datasets": "1 = No usable datasets submitted.", "software": "1 = No usable software released."}, "meta": {"license": "Copyright © 2021 administered by the Association for Computational Linguistics (ACL)\n                                on behalf of ACL content contributors: Nan Shao, and other contributors who wish to remain anonymous.\n                                Content is made available under a Creative Commons Attribution 4.0 International Public License.", "author_identity_guess": "1 = I do not have even an educated guess about author identity.", "confidence": "2 =  Willing to defend my evaluation, but it is fairly likely that I missed some details, didn't understand some central points, or can't be sure about the novelty of the work.", "sentences": {"paper_summary": [[0, 205], [205, 326], [326, 400], [400, 562], [562, 640]], "summary_of_strengths": [[0, 3], [3, 81], [81, 85], [85, 201], [201, 205], [205, 264], [264, 268], [268, 283]], "summary_of_weaknesses": [[0, 3], [3, 59], [59, 97], [97, 247]], "comments,_suggestions_and_typos": [[0, 156]]}}}, {"rid": "fd6f572f1c5279528023a42eb9fbdad249b1f1ebfe7c12bbfa276ed59b3018998128a948f482055f07ab0c3ba4b83416a21640418e95a7517111b6d650e0a6f1", "reviewer": "Chen Zhang0", "report": {"paper_summary": "This paper proposes a trainable subgraph retrieving (SR) approach for KBQA, which can be combined with existing reasoning modules.  The SR approach uses a dual-encoder to expand paths to induce the subgraph and stop the expansion automatically. It can be trained in a weakly supervised way or in an unsupervised way and be fine-tuned in an end-to-end manner. This paper conducts experiments on two benchmark datasets with the proposed SR module.  Experiments show that the SR module leads to smaller subgraphs with higher answer recall. When combined with existing reasoning modules such as GraftNet and NSM, the approach achieves SOTA performance. ", "summary_of_strengths": "1. The paper points out a promising direction of improving retrieving subgraphs for KBQA, which receives little attention currently.\n2. The weakly supervised and unsupervised pre-training strategies can alleviate the problem of scarcity in training data, which is an important issue in KBQA.\n3. The proposed trainable SR approach is effective in retrieving subgraphs with higher coverage and smaller sizes. The performance on two KBQA datasets is impressive. ", "summary_of_weaknesses": "1. The proposed path expanding method might not involve much novelty. It is very similar to the UHop model in [1], which also adopts an iterative style to extract reasoning path until reaching the END, and updates question representation with historical expanded relations.  2. The trainable SR module is based on RoBERTa, while NSM and GraftNet do not employ large pretrained language models. Since RoBERTa is generally considered more powerful than LSTM and MLP, it is likely that the high performance largely results from RoBERTa rather than the trainable SR strategy itself. Then the comparison between the setting with and without SR may be unfair. Also, it is questionable whether it is worth the much larger computation resources to use a RoBERTa-based SR module instead of the simple and effective PRR.  3. There may be some problems with the mathematical formulas. In equation 6, when the similarity s(q,r) is larger, the probability of r given q should be larger rather than smaller.\n[1] UHop: An Unrestricted-Hop Relation Extraction Framework for Knowledge-Based Question Answering. NAACL’19 ", "comments,_suggestions_and_typos": "1. I recommend citing the UHop paper, which is closely related to the proposed SR method.\n2. In the experiments of this paper, it is assumed that the golden topic entities are given (as indicated in lines 187-188). So it is better that you mark whether the baseline models use golden topic entities or entity linking results in the result table, which is a variable need to be controlled when we compare the performance of KBQA models. For example, BAMNet, GraftNet, and PullNet use entity linking results on WebQSP, according to original paper.\n3. The EmbedKGQA reports 66.4 Hits@1 in the original paper while Table 2 shows 46.0 Hits@1, which is much lower. Is there any explanation for this contradiction? "}, "scores": {"overall": "2.5 ", "best_paper": "No", "replicability": "3 = They could reproduce the results with some difficulty. The settings of parameters are underspecified or subjectively determined, and/or the training/evaluation data are not widely available.", "datasets": "1 = No usable datasets submitted.", "software": "3 = Potentially useful: Someone might find the new software useful for their work."}, "meta": {"license": "Copyright © 2021 administered by the Association for Computational Linguistics (ACL)\n                                on behalf of ACL content contributors: Chen Zhang0, and other contributors who wish to remain anonymous.\n                                Content is made available under a Creative Commons Attribution 4.0 International Public License.", "author_identity_guess": "1 = I do not have even an educated guess about author identity.", "confidence": "5 = Positive that my evaluation is correct. I read the paper very carefully and am familiar with related work.", "sentences": {"paper_summary": [[0, 131], [131, 245], [245, 359], [359, 446], [446, 537], [537, 649]], "summary_of_strengths": [[0, 3], [3, 133], [133, 136], [136, 292], [292, 295], [295, 407], [407, 459]], "summary_of_weaknesses": [[0, 3], [3, 70], [70, 274], [274, 275], [275, 278], [278, 394], [394, 579], [579, 654], [654, 811], [811, 812], [812, 815], [815, 874], [874, 994], [994, 1094], [1094, 1103]], "comments,_suggestions_and_typos": [[0, 3], [3, 90], [90, 93], [93, 215], [215, 436], [436, 546], [546, 549], [549, 659], [659, 708]]}}}]