[{"rid": "802e97a5cf30c788ecd057534551263ee9b8004fa6a796e6e0e3992c3b55736b32c408efd5e716713ebac1b6f70dc54b8a38da4aac60da48935f1921b5950bc8", "reviewer": null, "report": {"paper_summary": "The paper presents a new task called: Spoken Conversational Question Answering (SCQA). The proposed dataset consists of multi-turn conversations and passages in both text and speech form. The authors claim that SCQA is more challenging than only text-based tasks; and indeed, the performance of existing SOTA models such as BERT-based and ALBERT-based degrade. The paper suggests a dual attention technique to tackle the underperformance and shows that indeed the performance increases. The main idea of the dual attention is that model can benefit from learning on two language modalities (in this case, text and speech) ", "summary_of_strengths": "•\tThe paper is well written; the experiments are sound, and the task seem interesting. \n•\tI really like the idea of exploiting the two language modalities to improve existing models. I am not familiar with this kind of usage, so the novelty here is good. Also, I like the teacher-student approach (called Knowledge Distillation) which enable them to overcome the noise that came from ASR. \n•\tThe mathematical formulation of the task and the different approaches are nice and clear •\tThe baseline comparisons are also good ", "summary_of_weaknesses": "The authors use the term “significant” several times in the paper but in fact, did not use any statistical test to check that the results are indeed significantly decreed. \nThis problem gets bigger when looking at Tables 5 and 6; it is hard to see that the suggested techniques truly improve the models. Personally, I am not convinced that the Dual attention and knowledge distillation technique, suggested by the authors, improved the models (see for example lines 5 and 8 in table 5, the change in F1 score is ~2 points) I am wondering if you had a perfect ASR, was it still beneficial to use the two language modalities? I am not an expert on speech embedding but does it capture things like tone, speed, and nervousness? If the answers is negative, I think that this is a major weakness ", "comments,_suggestions_and_typos": "I think that the main strength of the paper is the use of the two language modalities. The dataset\\task is nice, but it is not the main contribution in my opinion. \nI think that if the paper will be accepted then it will be required to perform the right statistical test in order to prove that indeed the methods works "}, "scores": {"overall": "3 = Good: This paper makes a reasonable contribution, and might be of interest for some (broad or narrow) sub-communities, possibly with minor revisions.", "best_paper": "No", "datasets": "4 = Useful: I would recommend the new datasets to other researchers or developers for their ongoing work.", "software": "3 = Potentially useful: Someone might find the new software useful for their work."}, "meta": {"license": "Copyright © 2021 administered by the Association for Computational Linguistics (ACL)\n                                on behalf of ACL content contributors: None, and other contributors who wish to remain anonymous.\n                                Content is made available under a Creative Commons Attribution 4.0 International Public License.", "author_identity_guess": "1 = I do not have even an educated guess about author identity.", "confidence": "4 = Quite sure. I tried to check the important points carefully. It's unlikely, though conceivable, that I missed something that should affect my ratings.", "sentences": {"paper_summary": [[0, 87], [87, 188], [188, 361], [361, 487], [487, 622]], "summary_of_strengths": [[0, 87], [87, 183], [183, 255], [255, 389], [389, 522]], "summary_of_weaknesses": [[0, 172], [172, 304], [304, 624], [624, 725], [725, 791]], "comments,_suggestions_and_typos": [[0, 87], [87, 164], [164, 319]]}}}, {"rid": "94fa38294cafb35dbc4fc5ee47ce2edb7f28acdc579d09e347eda793735579d90260a72dfdf5123f5ce1375483e0c01abcefdb0cedb2039dfd120f16371e66dc", "reviewer": "Shang-Wen Li", "report": {"paper_summary": "The paper discussed the problem of Spoken Conversational Question Answering (SCQA). On the one hand, conversational question answering (CQA) has been a challenging problem in language understanding and of many applications. On the other hand, speech modality in a natural form for conversation and contains additional information in audio signals. It is natural to explore the intersection of the two, i.e., SCQA. There are several existing works, but the research is usually limited by available dataset. This paper collects a Spoken-CoQA dataset based on CoQA and Google TTS for generating the training set and human speakers for collecting the test set audio. The authors also proposed DDNET approach which is a unification of knowledge distillation and dual attention techniques, and showed the efficacy of DDNET empirically by applying DDNET to various spoken QA models. ", "summary_of_strengths": "- The paper investigates a novel and challenging problem, Spoken Conversational Question Answering (SCQA). The problem is crucial for understanding natural/spoken conversation. The area is relevant to several ACL communities and could be interesting for industry application.  - The authors compile a dataset (Spoken-CoQA) to evaluate SCQA problem with much bigger sizes than previously available datasets. If the dataset is released as the authors promised, it will signifcantly benefit the research and benchmarking in SCQA problem.\n- The authors proposed a novel approach, DDNET. The approach leverages knowledge distillation and dual attention techniques to combine text representation and audio representation. The authors further showed the efficacy of DDNET empirically by applying DDNET to various spoken QA models and benchmarking with Spoken-CoQA dataset and a public available spoken SQuAD dataset. ", "summary_of_weaknesses": "- Although the authors showed consistent improvement with proposed DDNET approach over the baselines, it is difficult to interpret how good the results are. It would be great if the authors can provide some qualitiative analysis to help readers understanding the quality of result. Also, it would be interesting to see how the audio modality helps the answer prediction to better interpret the pros and cons of proposed method and the addition of audio modality.\n- There is a recent trend to bypass ASR, in order to make the underlying methods more scalable to low resourced languages. The proposed method still relies on ASR and it would be interesting to see if SCQA can achieve reasonable performance without ASR system. ", "comments,_suggestions_and_typos": "See above weakness section "}, "scores": {"overall": "4 = This paper represents solid work, and is of significant interest for the (broad or narrow) sub-communities that might build on it.", "best_paper": "No", "datasets": "1 = No usable datasets submitted.", "software": "1 = No usable software released."}, "meta": {"license": "Copyright © 2021 administered by the Association for Computational Linguistics (ACL)\n                                on behalf of ACL content contributors: Shang-Wen Li, and other contributors who wish to remain anonymous.\n                                Content is made available under a Creative Commons Attribution 4.0 International Public License.", "author_identity_guess": "1 = I do not have even an educated guess about author identity.", "confidence": "4 = Quite sure. I tried to check the important points carefully. It's unlikely, though conceivable, that I missed something that should affect my ratings.", "sentences": {"paper_summary": [[0, 84], [84, 224], [224, 348], [348, 414], [414, 506], [506, 663], [663, 876]], "summary_of_strengths": [[0, 107], [107, 177], [177, 276], [276, 277], [277, 407], [407, 535], [535, 583], [583, 716], [716, 910]], "summary_of_weaknesses": [[0, 157], [157, 282], [282, 463], [463, 586], [586, 724]], "comments,_suggestions_and_typos": [[0, 27]]}}}]