[{"rid": "883cec982be6ead1ee077df92d0d08618b52f2c4d4c39b923d78fb412dcf88496ff4894080de73f3c786310afcab26fa9e04cafe7020c5561b3835c375a0fd0c", "reviewer": null, "report": {"paper_summary": "The paper addresses the problem of privacy for document embeddings. The authors define a strong sentence-level privacy for documents and propose deepcandidate, an unsupervised embedding technique to generate sentence-private document embeddings. Experiments on sentiment analysis and text classification were conducted to show the usefulness and effectiveness of the proposed method. ", "summary_of_strengths": "- The paper is theoretically sound. There are a lot of mathematical notations in the paper but the authors defined them clearly, explained in detail, also showed the some necessary derivations (in Appendix) to help the readers to understand.\n- Experimental results show SentDP performs much better on stronger privacy guarantee, empirically proved the previous theoretical statements.\n- The authors proposed a novel approach from a strong privacy definition for document embeddings, which is significant different from the existing works. ", "summary_of_weaknesses": "- It would be nice to show more experimental results of the proposed method from more aspects such as an ablation study or parameter analysis.\n- There is still a clear gap between the private embeddings and non-private ones. For some baseline approaches the embedding performances are basically random guessing. The paper failed to explain this tradeoff and potential solutions. ", "comments,_suggestions_and_typos": "- One question: x' is sampled within certain distance from x in the embedding space, does that mean they are semantically/syntactically similar? If so, how much high-level concepts from the documents can be hided? "}, "scores": {"overall": "3.5 ", "best_paper": "No", "replicability": "3 = They could reproduce the results with some difficulty. The settings of parameters are underspecified or subjectively determined, and/or the training/evaluation data are not widely available.", "datasets": "1 = No usable datasets submitted.", "software": "4 = Useful: I would recommend the new software to other researchers or developers for their ongoing work."}, "meta": {"license": "Copyright © 2021 administered by the Association for Computational Linguistics (ACL)\n                                on behalf of ACL content contributors: None, and other contributors who wish to remain anonymous.\n                                Content is made available under a Creative Commons Attribution 4.0 International Public License.", "author_identity_guess": "1 = I do not have even an educated guess about author identity.", "confidence": "2 =  Willing to defend my evaluation, but it is fairly likely that I missed some details, didn't understand some central points, or can't be sure about the novelty of the work.", "sentences": {"paper_summary": [[0, 68], [68, 246], [246, 384]], "summary_of_strengths": [[0, 36], [36, 242], [242, 385], [385, 539]], "summary_of_weaknesses": [[0, 143], [143, 225], [225, 312], [312, 379]], "comments,_suggestions_and_typos": [[0, 145], [145, 214]]}}}, {"rid": "3b7abb0934c42ac0f248c37cd980b1fd8cb472be2563c43775260b1a7d765728f8f85a513beba740c4a5c6a50e70cfcb2fa3fe097f7606711ae41ec14f73aa8e", "reviewer": null, "report": {"paper_summary": "This paper introduces an approach to produce privacy-preserving document embeddings with the property that every single sentence of the document could be replaced by some other random one while obtaining a similar embedding for the document. The paper is way out of my area of expertise, and thus this review must remain an educated guess. \nThe proposed method replaces sentence embeddings from the private document for embeddings obtained from a set of public documents. The method uses embeddings that are close to the original ones by picking those with high \"Tukey Depth\" with respect to the set of candidate embeddings. Finally, the embeddings are spread apart by passing them through a network trained with an unsupervised clustering signal, and, if understand correctly, averaged together. ", "summary_of_strengths": "1. The method seems to be well grounded in a theoretical framework. \n2. The paper is very clear, and even though I lack the relevant background I could follow it (with quite some effort, which is also quite natural) 3. The empirical results seem good (but I am not familiar with the state of the art in this area) ", "summary_of_weaknesses": "1. As an outsider, I wonder whether some natural baselines could have been explored. For instance, given that the method uses sentence embeddings after a clustering transformation, I wonder what would happen if cluster centroids were directly used instead. Similarly, I wonder what's the need for computing the Tucker Depth, and not just using the closest vector in terms of cosine similarity. ", "comments,_suggestions_and_typos": "L404: It might be worth recalling the reader that k is the number of sentences at this point, given that this fact was introduced much earlier on and not used until then. "}, "scores": {"overall": "4 = Strong: This paper is of significant interest (for broad or narrow sub-communities), and warrants acceptance in a top-tier *ACL venue if space allows.", "best_paper": "No", "replicability": "3 = They could reproduce the results with some difficulty. The settings of parameters are underspecified or subjectively determined, and/or the training/evaluation data are not widely available.", "datasets": "1 = No usable datasets submitted.", "software": "1 = No usable software released."}, "meta": {"license": "Copyright © 2021 administered by the Association for Computational Linguistics (ACL)\n                                on behalf of ACL content contributors: None, and other contributors who wish to remain anonymous.\n                                Content is made available under a Creative Commons Attribution 4.0 International Public License.", "author_identity_guess": "1 = I do not have even an educated guess about author identity.", "confidence": "1 = Not my area, or paper is very hard to understand. My evaluation is just an educated guess.", "sentences": {"paper_summary": [[0, 242], [242, 340], [340, 472], [472, 625], [625, 797]], "summary_of_strengths": [[0, 3], [3, 68], [68, 72], [72, 219], [219, 314]], "summary_of_weaknesses": [[0, 3], [3, 85], [85, 257], [257, 394]], "comments,_suggestions_and_typos": [[0, 171]]}}}]