[{"rid": "fd2caf0a98ac82aa472d008400f29ba5bd74e77d5471c83cb7634bca4d59d5c302b38774e1e7775d5f8bf1110a26d537ba5427a759506b0a0807bc3e3590493c", "reviewer": null, "report": {"paper_summary": "This paper aims to find the best strategy to select training examples for few-shot transfer. They evaluated 5 data selection methods (data cross-entropy, predictive entropy, gradient embedding, loss embedding) on 3 tasks (POS tagging, NER, NLI) from 20 languages (categorized into 3 groups) . Their final results showed embedding based data selection methods consistently outperforms other strategies. ", "summary_of_strengths": "Comprehensive empirical studies. Experiments seems to be very solid. Paper is clearly written. ", "summary_of_weaknesses": "Although the experiments are very comprehensive, this paper lacks technical novelty. The optimal data selection strategy also seems to offer limited improvement over random data selection. ", "comments,_suggestions_and_typos": "Can you provide more insights about why loss embedding based data selection is better for sequential labeling task while gradient embedding is better for classification task? Why embedding based methods are better than other selection methods?\nFor method selection, details should be included in the main paper rather than appendix (2.1 and 2.2 all refer to Appendix B). "}, "scores": {"overall": "3 = Good: This paper makes a reasonable contribution, and might be of interest for some (broad or narrow) sub-communities, possibly with minor revisions.", "best_paper": "No", "datasets": "1 = No usable datasets submitted.", "software": "3 = Potentially useful: Someone might find the new software useful for their work."}, "meta": {"license": "Copyright © 2021 administered by the Association for Computational Linguistics (ACL)\n                                on behalf of ACL content contributors: None, and other contributors who wish to remain anonymous.\n                                Content is made available under a Creative Commons Attribution 4.0 International Public License.", "author_identity_guess": "1 = I do not have even an educated guess about author identity.", "confidence": "2 =  Willing to defend my evaluation, but it is fairly likely that I missed some details, didn't understand some central points, or can't be sure about the novelty of the work.", "sentences": {"paper_summary": [[0, 93], [93, 293], [293, 402]], "summary_of_strengths": [[0, 33], [33, 69], [69, 95]], "summary_of_weaknesses": [[0, 85], [85, 189]], "comments,_suggestions_and_typos": [[0, 175], [175, 244], [244, 371]]}}}]