[{"rid": "0d20ab1e52c967fc2b6ecd5084040c53b37a21cba1b83a8817be76caac2836fa048bcb7422a15838798e562ca3c095c423dd8a9d0e9ddf698dc8b5a0b845b1f3", "reviewer": null, "report": {"paper_summary": "## Paper Summary Dialogue state trackers (DST) extract important information from multi-turn dialogue situations and structures the belief state that appears during the conversation in the form of domain-slot-value. Performance of DSTs are measured using two metrics - joint goal accuracy and slot accuracy. Joint goal accuracy verifies if the predicted belief states perfectly matches the gold labels. This metric scores the performance of the later turns as zero even if the model mis-predicts a particular turn and performs accurately in the later turns. So, in this sense this metric this metric underestimates the model performance. On the other hand slot accuracy is a function of total number of predefined slots of all domains and by definition it is prone to overestimating the model performance. To solve these problems the authors propose a new metric called Relative Slot Accuracy that does not depend on the predefined number of unique slots and also scores the models in a way that matches human intuition. ", "summary_of_strengths": "## Summary of Strengths The strengths of the paper are as follows: \t1. The scoring metric defined in the paper is not a function of number of predefined slots. \n\t2. The scoring metric is simple to implement and compute. ", "summary_of_weaknesses": "## Summary of Weaknesses  The weaknesses of the paper are as follows: \t1. It is not clear how Relative slot accuracy correlates to the precision and recall of the model. \n\t2. The paper lacks theoretical analysis and justification, which is required while defining a new metric. ", "comments,_suggestions_and_typos": "## Comments Suggestions and Typos Theoretical analysis and evidences should be added in the paper in addition to experimental evidences. "}, "scores": {"overall": "3 = Good: This paper is of interest to the *ACL audience and could be published, but might not be appropriate for a top-tier publication venue. It would likely be a strong paper in a suitable workshop.", "best_paper": "No", "replicability": "5 = They could easily reproduce the results.", "datasets": "1 = No usable datasets submitted.", "software": "1 = No usable software released."}, "meta": {"license": "Copyright © 2021 administered by the Association for Computational Linguistics (ACL)\n                                on behalf of ACL content contributors: None, and other contributors who wish to remain anonymous.\n                                Content is made available under a Creative Commons Attribution 4.0 International Public License.", "author_identity_guess": "1 = I do not have even an educated guess about author identity.", "confidence": "4 = Quite sure. I tried to check the important points carefully. It's unlikely, though conceivable, that I missed something that should affect my ratings.", "sentences": {"paper_summary": [[0, 17], [17, 216], [216, 308], [308, 403], [403, 558], [558, 638], [638, 806], [806, 1021]], "summary_of_strengths": [[0, 24], [24, 67], [67, 71], [71, 160], [160, 165], [165, 220]], "summary_of_weaknesses": [[0, 26], [26, 70], [70, 74], [74, 170], [170, 175], [175, 278]], "comments,_suggestions_and_typos": [[0, 34], [34, 137]]}}}, {"rid": "a8a1cf2a07b35e928f4936d3347839f2dd6c9ba0cc09e1e10673ba58d8adc188f3125743bb319cfcbaf4c2f37cc62c7ec3bd9887e632b685f1d78722473aa27f", "reviewer": null, "report": {"paper_summary": "In this paper, authors propose a new variation of slot accuracy metric, called as relative slot accuracy (RSA), for dialog state tracking (DST) evaluation. Unlike the slot accuracy that tracks all the pre-defined slots based on ontology, RSA only uses the slots that either appear in the predicted or the gold states in the given turn. The metric is very intuitive and makes perfect sense. ", "summary_of_strengths": "-  Evaluating DST appropriately is still challenging and joint goal accuracy (JGA) heavily penalizes a system for even one mistake. Thus, JGA underestimates the performance of system, while another commonly used slot accuracy metric overestimates the performance. The proposed modification to slot accuracy metric is very intuitive and can be used to better compare DST systems. ", "summary_of_weaknesses": "- A major concern is the lack of comparison against the newly proposed average goal accuracy (AGA) metric. Please refer to the question. It is important to understand how relative slot accuracy metric differs from the existing AGA metric, and what are the benefit of using this new metric along with (or in place of) the AGA metric. ", "comments,_suggestions_and_typos": "In Eq. 3, does T* include all the slots-values in gold and predicted belief states or just the predicted and gold slots-values in current turn?\nHow does this metric correlate with the Average Goal Metric proposed in Rastogi et al. (2020b)? If you are using entire belief/predicted states for calculating T*, your metric is almost identical to the AGA. I think you should include evaluation results with the AGA metric. "}, "scores": {"overall": "3 = Good: This paper is of interest to the *ACL audience and could be published, but might not be appropriate for a top-tier publication venue. It would likely be a strong paper in a suitable workshop.", "best_paper": "No", "replicability": "5 = They could easily reproduce the results.", "datasets": "1 = No usable datasets submitted.", "software": "1 = No usable software released."}, "meta": {"license": "Copyright © 2021 administered by the Association for Computational Linguistics (ACL)\n                                on behalf of ACL content contributors: None, and other contributors who wish to remain anonymous.\n                                Content is made available under a Creative Commons Attribution 4.0 International Public License.", "author_identity_guess": "1 = I do not have even an educated guess about author identity.", "confidence": "5 = Positive that my evaluation is correct. I read the paper very carefully and am familiar with related work.", "sentences": {"paper_summary": [[0, 156], [156, 336], [336, 390]], "summary_of_strengths": [[0, 132], [132, 264], [264, 379]], "summary_of_weaknesses": [[0, 107], [107, 137], [137, 333]], "comments,_suggestions_and_typos": [[0, 144], [144, 240], [240, 352], [352, 419]]}}}]