[{"rid": "fc280bbea3dcf0362b1b11d51865a27c48ee3f30fe6b1e4ad619caba80fa9d5b4963dfb14cfc03c30ff79091ab07d452cedfb5359ff6bfecacd6808a5941cfaf", "reviewer": null, "report": {"paper_summary": "This paper suggests there is a vanishing-gradient issue when using a global learning rate to train additive late-fusion multimodal models and presents a solution named Modality-Specific Learning Rate (MSLR). The authors explored 3 different variants of MSLR, showing that when optimal unimodal learning rates are close, “smooth” variant performs the best, and when optimal unimodal LRs are far apart, “keep” and “dynamic” variants are better. The authors also performed layer conductance analysis to validate the hypothesis about vanishing gradients, showing that MSLR leads to models with larger layer conductance values. ", "summary_of_strengths": "1) This paper introduces a conceptually simple and intuitive idea of Modality-Specific Learning Rates, which empirically works well for late-fusion additive models; 2) This paper presents layer conductance analysis and shows that layer conductance disparity between modalities are mitigated when MSLR is applied; Overall, this paper proposes a simple yet empirically beneficial method to apply modality-specific learning rates and this improves late-fusion performance. ", "summary_of_weaknesses": "1) It is unclear how one should do the smoothing of LR in the “Smooth” variant. The authors proposed some values in the reasonable range but without any discussion on how they are decided. It would be great if there is a methodical approach or a description of how this is done. \n2) Layer conductance is not a good way to measure vanishing gradients. It is a measure of neuron importance for a given input. While the result of conductance analysis is in the form of “gradients”, it is a different concept from the gradients the model receives during training. Hence, I would argue that the layer conductance analysis is actually not measuring what the authors aim to measure and the conclusions should be revised. \n3) MSLR requires knowing the unimodal optimal learning rates in advance - which means we have to spend resources to tune unimodal models and discard them in the end. It would be interesting to see how this compares to directly tuning a late-fusion model with separate LR for each modality, especially with a similar or less compute budget. ", "comments,_suggestions_and_typos": "1) Relating to weakness 2), the authors need to properly measure gradients during training and validate their hypothesis about vanishing gradients, which would be easy to measure with norm of gradients. If the authors do not have the resources to conduct this analysis in time, I suggest the authors to revise their claims on vanishing gradients as layer conductance does not measure that. \n2) I suggest the authors to add a brief discussion about how to pick learning rates in the “Smooth” variant; 3) Typo - line 440, “...from the all the joint…” -> “...from all the joint…” 4) Typo - line 561, “while MSLR while achieves…” -> “while MSLR achieves…” "}, "scores": {"overall": "3 = Good: This paper is of interest to the *ACL audience and could be published, but might not be appropriate for a top-tier publication venue. It would likely be a strong paper in a suitable workshop.", "best_paper": "No", "replicability": "4 = They could mostly reproduce the results, but there may be some variation because of sample variance or minor variations in their interpretation of the protocol or method.", "datasets": "1 = No usable datasets submitted.", "software": "1 = No usable software released."}, "meta": {"license": "Copyright © 2021 administered by the Association for Computational Linguistics (ACL)\n                                on behalf of ACL content contributors: None, and other contributors who wish to remain anonymous.\n                                Content is made available under a Creative Commons Attribution 4.0 International Public License.", "author_identity_guess": "1 = I do not have even an educated guess about author identity.", "confidence": "4 = Quite sure. I tried to check the important points carefully. It's unlikely, though conceivable, that I missed something that should affect my ratings.", "sentences": {"paper_summary": [[0, 208], [208, 443], [443, 623]], "summary_of_strengths": [[0, 313], [313, 470]], "summary_of_weaknesses": [[0, 80], [80, 189], [189, 279], [279, 351], [351, 407], [407, 560], [560, 714], [714, 881], [881, 1055]], "comments,_suggestions_and_typos": [[0, 203], [203, 390], [390, 652]]}}}]