[{"rid": "3cb226b0d8814a65b174a7d0cb90ebfa0748d404cd08981e4a84a2a794c22f90563f97eb4e66f87b1c5ec1921001d1baefeca833441161438617557155e84375", "reviewer": "Tong Zhang", "report": {"paper_summary": "This work models the Knowledge Graph Completion task and Question Answering task into a sequence-to-sequence paradigm. The authors propose two easy but effective training and inference methods for the two tasks, respectively.  KGT5 outperforms the current compositional KGE models on the link prediction task. Moreover, the proposed method also achieved outstanding performance on KGQA over incomplete KGs. ", "summary_of_strengths": "(1) The new training and inference strategies for sequence-to-sequence method are easy but effective. \n(2) The proposed method outperforms the current compositional KGE models on the link prediction task. In addition, it is demonstrated to be complementary to the SOTA KGE methods. \n(3) the proposed method has an outstanding performance on KGQA tasks over incomplete KGs. ", "summary_of_weaknesses": "(1) The performances of the KGT5 on KGQA are only evaluated with 50% incomplete KG settings. The effectiveness of the proposed methods is not demonstrated under the complete KG situation, which is necessary for KGQA evaluation. \n(2) The performance of KGT5 on KGQA tasks could take advantage of the n-to-one mapping between an entity/relation and its textual representation. The experiments should be performed in a more fair setting. ", "comments,_suggestions_and_typos": "The performance on KGQA with the complete KG setting should be provided. "}, "scores": {"overall": "3.5 ", "best_paper": "No", "replicability": "4 = They could mostly reproduce the results, but there may be some variation because of sample variance or minor variations in their interpretation of the protocol or method.", "datasets": "1 = No usable datasets submitted.", "software": "4 = Useful: I would recommend the new software to other researchers or developers for their ongoing work."}, "meta": {"license": "Copyright © 2021 administered by the Association for Computational Linguistics (ACL)\n                                on behalf of ACL content contributors: Tong Zhang, and other contributors who wish to remain anonymous.\n                                Content is made available under a Creative Commons Attribution 4.0 International Public License.", "author_identity_guess": "1 = I do not have even an educated guess about author identity.", "confidence": "4 = Quite sure. I tried to check the important points carefully. It's unlikely, though conceivable, that I missed something that should affect my ratings.", "sentences": {"paper_summary": [[0, 119], [119, 226], [226, 310], [310, 407]], "summary_of_strengths": [[0, 102], [102, 205], [205, 282], [282, 373]], "summary_of_weaknesses": [[0, 93], [93, 228], [228, 375], [375, 435]], "comments,_suggestions_and_typos": [[0, 73]]}}}, {"rid": "919d93df080f1ef6cc593896bbfdfb9bf338b159f8f738972de24aadba271a0d8180c9e65474a388a6057ad883d71d783dce1618410ba18056a06e5b60138640", "reviewer": null, "report": {"paper_summary": "This paper proposes a simple but powerful approach that uses a single Transformer architecture to tackle KG link prediction and question answering treated as sequence-to-sequence tasks. This approach can reduce the model size up to 90% compared to conventional Knowledge graph embedding (KGE) models, and the performance of this approach is best among small-sized baseline models. ", "summary_of_strengths": "1. \tThis paper uses the Transformer structure for KG link prediction and question answering tasks, and this simple approach seems powerful. \n2. \tThis paper conducts a large number of experiments on multiple datasets and analyzes the experimental results. ", "summary_of_weaknesses": "Minor: The paper only contains a high-level description of the proposed approach that benefits the performance of KGQA. It would be better if the authors provide some explicit cases or discussions to explain how pre-training on KG link prediction can improve performance on KGQA compared with the previous representative works later. ", "comments,_suggestions_and_typos": "Specific comments for improving the work: 1. The authors may provide some explicit cases or discussions to explain how pre-training on KG link prediction can improve performance on KGQA. \n2. This paper shows KG link prediction performance from the proposed model trained on Wikidata5M in section 4.4. it would be better to show the KG link prediction performance from KGT5 after finetuning for QA, and showing performance on KG link prediction and KGQA with multi-task setting is also a good choice. "}, "scores": {"overall": "3.5 ", "best_paper": "No", "replicability": "4 = They could mostly reproduce the results, but there may be some variation because of sample variance or minor variations in their interpretation of the protocol or method.", "datasets": "3 = Potentially useful: Someone might find the new datasets useful for their work.", "software": "4 = Useful: I would recommend the new software to other researchers or developers for their ongoing work."}, "meta": {"license": "Copyright © 2021 administered by the Association for Computational Linguistics (ACL)\n                                on behalf of ACL content contributors: None, and other contributors who wish to remain anonymous.\n                                Content is made available under a Creative Commons Attribution 4.0 International Public License.", "author_identity_guess": "1 = I do not have even an educated guess about author identity.", "confidence": "3 =  Pretty sure, but there's a chance I missed something. Although I have a good feel for this area in general, I did not carefully check the paper's details, e.g., the math or experimental design.", "sentences": {"paper_summary": [[0, 186], [186, 381]], "summary_of_strengths": [[0, 3], [3, 140], [140, 144], [144, 255]], "summary_of_weaknesses": [[0, 7], [7, 120], [120, 334]], "comments,_suggestions_and_typos": [[0, 42], [42, 45], [45, 187], [187, 191], [191, 301], [301, 500]]}}}]