[{"rid": "090711ce39f919422e42d87e2e3fa3cccbf75b88410abc41df2d59108aaf42fc60cad2dfe6ec51c72c72891fb40b2cbd8b2cadd48c6a89c6a25f7f41b73df96b", "reviewer": null, "report": {"paper_summary": "This paper works on multimodal misinformation detection, particularly in the context of \"miscaptioned\" images on Twitter. The authors collect a large multimodal data of 884k tweets on the topics of Climate Change, COVID-19, and Military Vehicles. Next, a misinformation detection method, based on CLIP embeddings is proposed. The effectiveness of this approach is demonstrated on (a) a simulated dataset mismatched image captions and (b) real-world data of misinformation. ", "summary_of_strengths": "- The paper is very well written and structured.\n- The collected dataset could be useful for multimodal research.\n- The authors demonstrate strong gains over the baseline approach of detection using zero-shot CLIP.\n- Experiments are mostly rigorous (for a short paper). ", "summary_of_weaknesses": "- My main criticism is that the \"mismatched\" image caption dataset is artificial and may not capture the kind of misinformation that is posted on platforms like Twitter. For instance, someone posting a fake image of a lockdown at a particular place may not just be about a mismatch between the image and the caption, but may rather require fact-checking, etc. Moreover, the in-the-wild datasets on which a complementary evaluation is conducted are also more about mismatched image-caption and not the real misinformation (lines 142-143). Therefore, the extent to which this dataset can be used for misinformation detection is limited. I would have liked to see this distinction between misinformation and mismatched image captions being clear in the paper.\n- Also, since the dataset is artificially created, the dataset itself might have a lot of noise. For instance, the collected \"pristine\" set of tweets may not be pristine enough and might instead contain misinformation as well as out-of-context images. I would have liked to see more analysis around the quality of the collected dataset and the amount of noise it potentially has.   - Since this is a new dataset, I would have liked to see evaluation of more models (other than just CLIP). But given that it is only a short paper, it is probably not critical (the paper makes enough contributions otherwise) ", "comments,_suggestions_and_typos": "- Table 4 and Table 5: Are the differences statistically significant? ( especially important because the hNews and Twitter datasets are really small) - Lines 229-240: Are the differences between the topics statistically significant? "}, "scores": {"overall": "4 = This paper represents solid work, and is of significant interest for the (broad or narrow) sub-communities that might build on it.", "best_paper": "No", "datasets": "5 = Enabling: The newly released datasets should affect other people's choice of research or development projects to undertake.", "software": "4 = Useful: I would recommend the new software to other researchers or developers for their ongoing work."}, "meta": {"license": "Copyright © 2021 administered by the Association for Computational Linguistics (ACL)\n                                on behalf of ACL content contributors: None, and other contributors who wish to remain anonymous.\n                                Content is made available under a Creative Commons Attribution 4.0 International Public License.", "author_identity_guess": "1 = I do not have even an educated guess about author identity.", "confidence": "4 = Quite sure. I tried to check the important points carefully. It's unlikely, though conceivable, that I missed something that should affect my ratings.", "sentences": {"paper_summary": [[0, 122], [122, 247], [247, 326], [326, 473]], "summary_of_strengths": [[0, 49], [49, 114], [114, 215], [215, 270]], "summary_of_weaknesses": [[0, 170], [170, 360], [360, 538], [538, 635], [635, 757], [757, 854], [854, 1009], [1009, 1137], [1137, 1139], [1139, 1246], [1246, 1364]], "comments,_suggestions_and_typos": [[0, 72], [72, 150], [150, 233]]}}}, {"rid": "e32028fea0e2a5b69ee874b1229abce47dd7e1e3581ec450975a27d111146734822a71ca9bb71cac9fd490ff691193089130c40fe7fb051b6f178a9e1ea9abd6", "reviewer": "Florian Kunneman", "report": {"paper_summary": "The paper addresses a sub-topic in the realm of mis/disinformation, namely images posted on social media with a misleading caption. With a focus on the topics of climate change, covid-19 and military vehicles, a dataset is collected from twitter using an iterative process to come to the best set of query terms, and selecting posts that contain at least one image. Half of the data is then articifially made out-of-context, by both randomly connecting captions to images, and doing so in a more informed way by selecting on semantic similarity. Two existing datasets consisting of images and deceptive captions are then used for evaluation, and the zero-shot CLIP model is used as baseline on the task. The new dataset is used to finetune this baseline model, comparing different multi-modal fusion techniques. This approach was found to outperform the baseline model, and several insights were offered by inspecting the influence of text clustering and image OCR'ing. ", "summary_of_strengths": "- Clear and proper data collection procedure - The use of multiple evaluation sets - The insight that multiplying the image- and textual CLIP embeddings is beneficial - Analysis of the percentage of hard and random negatives and their impact - Insights into the value of Optical Character Recognition on performance - Insights into the value of tweet text clustering ", "summary_of_weaknesses": "- Little insight into the actual problem domain. How does the new dataset and its labels compare to actual cases of out-of-context captions?\n- Lack of a manual inspection of genuine deceptive captions in the dataset, neither of the random or hard samples that were generated nor of model output - Application of a single model with and without fine-tuning ", "comments,_suggestions_and_typos": "- The introduction could benefit from a clear example of the problem domain - 'falsified' is an ambiguous term to use, as it also refers to the research practice where one tries to falsify a hypothesis.\n- Line 111 - 113: 'by retrieving the image of the sample with the greatest textual similarity for a given caption' - it is not clear to me based on this description how these hard negatives were generated "}, "scores": {"overall": "3 = Good: This paper makes a reasonable contribution, and might be of interest for some (broad or narrow) sub-communities, possibly with minor revisions.", "best_paper": "No", "datasets": "3 = Potentially useful: Someone might find the new datasets useful for their work.", "software": "1 = No usable software released."}, "meta": {"license": "Copyright © 2021 administered by the Association for Computational Linguistics (ACL)\n                                on behalf of ACL content contributors: Florian Kunneman, and other contributors who wish to remain anonymous.\n                                Content is made available under a Creative Commons Attribution 4.0 International Public License.", "author_identity_guess": "1 = I do not have even an educated guess about author identity.", "confidence": "4 = Quite sure. I tried to check the important points carefully. It's unlikely, though conceivable, that I missed something that should affect my ratings.", "sentences": {"paper_summary": [[0, 132], [132, 366], [366, 546], [546, 704], [704, 812], [812, 970]], "summary_of_strengths": [[0, 45], [45, 83], [83, 167], [167, 242], [242, 316], [316, 367]], "summary_of_weaknesses": [[0, 49], [49, 141], [141, 295], [295, 356]], "comments,_suggestions_and_typos": [[0, 76], [76, 203], [203, 408]]}}}, {"rid": "026afc14b184ea209f525ff954622af51d20da3b5c48638ee94702a3fd3fa0e8ff2dd803da166faf69d21801e8fbb848241fab10fae9027e4565aea564242499", "reviewer": null, "report": {"paper_summary": "The paper deals with misinformation detection in Twitter, using multimodal data (images and text). \nAuthors focus on three topics: COVID, climate change, and military vehicles. ", "summary_of_strengths": "Authors perform experiements on multiple settings, using several quality metrics. \nThe results show a superiority of the proposed method. \nPartial ablation study is also reported. ", "summary_of_weaknesses": "The paper is not very clearly writtem. Too much information is moved to Appendix. \nSome important details of data collection and data generation are omitted. \nThe main issue is a lack of novelty - authors use exisiting tools and approaches for tweets classification. ", "comments,_suggestions_and_typos": "I did not notice many typos. However, the paper organization can be improved. \nFor example, data generation and data collection can be described in the same section. \nAlso, motivation behind some experiments is not very clear. Interpretation of the results are offen missing. \nBelow are some detailed comments/questions:  1. What \"in-the-wild\" term means? \n2. Evaluation metrics can be explained in a few words (or a relevant reference can be provided). \n3. I did not understand why Multiply option was selected for the experiments, when Concat+Dot clearly outperforms it in 4 cases, as shown in Table 3. \n4. Conclusions from Table 4 are missing. \n5. The motivation behind experiment with clustering and interpretation of its results are missing/unclear. "}, "scores": {"overall": "2 = Revisions Needed: This paper has some merit, but also significant flaws, and needs work before it would be of interest to the community.", "best_paper": "No", "datasets": "3 = Potentially useful: Someone might find the new datasets useful for their work.", "software": "1 = No usable software released."}, "meta": {"license": "Copyright © 2021 administered by the Association for Computational Linguistics (ACL)\n                                on behalf of ACL content contributors: None, and other contributors who wish to remain anonymous.\n                                Content is made available under a Creative Commons Attribution 4.0 International Public License.", "author_identity_guess": "1 = I do not have even an educated guess about author identity.", "confidence": "4 = Quite sure. I tried to check the important points carefully. It's unlikely, though conceivable, that I missed something that should affect my ratings.", "sentences": {"paper_summary": [[0, 99], [99, 177]], "summary_of_strengths": [[0, 82], [82, 138], [138, 180]], "summary_of_weaknesses": [[0, 39], [39, 82], [82, 158], [158, 267]], "comments,_suggestions_and_typos": [[0, 29], [29, 78], [78, 166], [166, 227], [227, 276], [276, 325], [325, 356], [356, 360], [360, 454], [454, 458], [458, 605], [605, 609], [609, 647], [647, 651], [651, 755]]}}}]