[{"rid": "b6471bd64d652cce2aab51eb4eaa7a36bf8b0f53e71692c95a15a293914fbfa710f8ee33d85e431dba9cdc510218ccf0102fde0a9dbafb93e4a02a904b78a554", "reviewer": null, "report": {"paper_summary": "This short paper presents an alternative to label smoothing for neural MT.  In one variant (\"weighted\"), the amount of training-time probability assigned to every vocab item except the correct one at each time step in the decoder is varied based on whether the item appears in the source-side vocabulary, target-side vocabulary, or both.  The more fully explored variant (\"masked\") just sets the source-side vocabulary weight to 0 and distributes the smoothed weight evenly over the vocabulary items in the other two classes.  Both variants of label smoothing are motivated by a noticed drop in BLEU scores whenever label smoothing is done with source/target vocabulary sharing also turned on.  Label smoothing and vocabulary sharing each improve scores over the Transformer-base, but using the two together hurts performance.\nMasked label smoothing (with vocab sharing) is tested against Transformer-base, vocab sharing alone, label smoothing alone, and vocab sharing + label smoothing together.  Evaluation is mainly by BLEU score on a variety of data sets (IWSLT, WMT, CASIA) and language pairs.  The score differences are not large -- I think never more than 0.5 BLEU) -- but the authors report that using masked label smoothing statistically outperforms regular label smoothing when vocab selection is also turned on.\nThe short paper fits in four pages as required.  There is a one-page appendix.  There's also a small software package with a README as part of the uploaded submission -- but it's not mentioned in the text and so I almost missed it. ", "summary_of_strengths": "- Focused, straightforward idea with a clear intuitive and practical motivation.  I think people will be interested in this paper's observations and proposed solution.  I expect that the details necessary for re-implementation are relatively clear.\n- Evaluation on several different language pairs, which includes some diversity of character set / writing system.  Both into and out of English is covered. ", "summary_of_weaknesses": "- The use of the appendix is a little more integral than I think would be ideal.  You have to read the appendix in order to know the conclusions of some analysis; the main text only says that such-and-such \"matters,\" but now how.\n- It's not always clear which results are meaningful.  Some rows of the main table have statistical significance tests, but other metrics, analysis, and data points do not.  Since the score differences are overall quite small, this detracts from the reliability of the results.  Readers might be inclined to decide that the techniques aren't worth trying. ", "comments,_suggestions_and_typos": "SUGGESTIONS - It's great to have at least some statistical significance tests.  Since they were added only after the first revision of the paper, I felt like they weren't fully integrated into the main text or all of the results tables (like Table 5).  For example, the beginning of Section 5.2 (line 201) says that LS \"outperforms\" VS+LS... but we do not have any significance tests between these two configurations.  These differences of 0.1 BLEU may actually be ties, in which case \"outperforms\" is incorrect.\n- In Table 3(b), is it really the case that 23.19 BLEU for RO-EN is statistically better than 23.15, or is this a typo?  I've never seen significance at p < 0.01 for such a tiny score change.\n- Even without a formal significance test, can we have some intuition about this ECE score in Section 6.1 / Table 4?  How is this score computed and what properties of MT training does it reflect?  I've never heard of this metric before, so I don't really understand what it is or whether an improvement of 0.7 is meaningful.  (Whereas I know quite well how much intuitive importance to give 0.7 BLEU.)\n- In Table 5, I would think that one intuitive configuration is to devalue the source vocabulary without shutting it off completely, via parameter settings like 0.5-0.5-0.25.  If your original motivation is correct, I would expect a configuration like that to do better than your current best result, 0.5-0-0.5.  Doesn't the current result indicate that the source-side vocabulary is somehow quite helpful -- the opposite of your initial claim?\nOTHER TYPOS OR CONFUSION - Why don't the numbers at the top of Table 5 (for baseline label smoothing) match the scores given in Table 3 for LS?  Aren't these identical configurations?\n- How do you decide when model training is over?  Is it a fixed number of epochs or updates, or after perplexity on the dev set converges (for some definition), etc.  Appendix B doesn't say.  Since your experiments modify the kind of signal that the model receives during training, I was wondering if that has a confounding effect on the results.  (For example, if MLS makes the training last 25 percent more updates than the baseline, then is the increased performance partially due to the mere fact of training longer?)\n- The WLS parameters \"1-1-0\" in Section 4.2 (line 175) directly contradict the claim in Section 4.1 (line 150) that these three values must sum to 1. ", "ethical_concerns": "No ethical concerns. "}, "scores": {"overall": "4 = Strong: This paper is of significant interest (for broad or narrow sub-communities), and warrants acceptance in a top-tier *ACL venue if space allows.", "best_paper": "No", "replicability": "4 = They could mostly reproduce the results, but there may be some variation because of sample variance or minor variations in their interpretation of the protocol or method.", "datasets": "1 = No usable datasets submitted.", "software": "3 = Potentially useful: Someone might find the new software useful for their work."}, "meta": {"license": "Copyright © 2021 administered by the Association for Computational Linguistics (ACL)\n                                on behalf of ACL content contributors: None, and other contributors who wish to remain anonymous.\n                                Content is made available under a Creative Commons Attribution 4.0 International Public License.", "author_identity_guess": "1 = I do not have even an educated guess about author identity.", "confidence": "4 = Quite sure. I tried to check the important points carefully. It's unlikely, though conceivable, that I missed something that should affect my ratings.", "sentences": {"paper_summary": [[0, 75], [75, 338], [338, 526], [526, 694], [694, 827], [827, 997], [997, 1099], [1099, 1323], [1323, 1371], [1371, 1402], [1402, 1555]], "summary_of_strengths": [[0, 81], [81, 168], [168, 249], [249, 364], [364, 406]], "summary_of_weaknesses": [[0, 81], [81, 230], [230, 284], [284, 403], [403, 508], [508, 586]], "comments,_suggestions_and_typos": [[0, 12], [12, 79], [79, 252], [252, 418], [418, 513], [513, 633], [633, 705], [705, 822], [822, 902], [902, 1031], [1031, 1108], [1108, 1283], [1283, 1420], [1420, 1553], [1553, 1578], [1578, 1697], [1697, 1737], [1737, 1786], [1786, 1903], [1903, 1928], [1928, 2084], [2084, 2259], [2259, 2409]], "ethical_concerns": [[0, 21]]}}}, {"rid": "395f3cafa74691254b06a12d8efd53c79d240eea7e7aa486f8121a919a2552b8e5021b038ab05ca134f071fbbea89874ff0e84c846ea62952509fd12a704c6a2", "reviewer": null, "report": {"paper_summary": "The paper argues that jointly adopting both label smoothing and vocabulary sharing techniques can be conflicting. This comes from a simple intuition that words have zero overlap with the possible target words should have no chance to appear in the target sentence. They propose to use a very simple approach (Masked label smoothing) that addresses the conflict. Results show that the method gains very incremental improvement in translation accuracy and some improvement in model calibration.  Overall the conflict is interesting but the result is very mixed. ", "summary_of_strengths": "The paper presents an interesting conflict between these two approaches. I personally never thought about this before. ", "summary_of_weaknesses": "Cons: From translation accuracy perspective, the improvement from fixing the conflict is very incremental. This is clearly shown as the translation improvement is only +0.47 at its best. In other cases (e.g. in the specific case (EN-RO - Table 5)), the improvement is +0.04 (from 23.15 to 23.19), which I would say it does not imply anything that is particularly meaningful.  able 5 also shows that assigning B_s to 0 seems does not matter that much (i.e. it does not hurt the performance that much). This shows that despite the intuition, the conflict actually does not matter in reality.\nThere might be improvement in model calibration, but with the current paper it is not clear from Table 4 the improvement means big thing or not. ", "comments,_suggestions_and_typos": "Typo + writing - as shown in Table 6,7 for both BLEU 207 and chrF -> 6, 7 - As shown in Table 3 , MLS 212 achieves consistent improvement over the origi213 nal label smoothing in both the original and the 214 balanced multilingual translation dataset under all 215 translation directions -> Table 3, MLS - About ECE score: There should be an explanation from the paper.\n- Writing style: the authors use the word outperform a lot in the paper. Clearly the improvement does not reflect an \"outperforming\" by anymeans. I suggest the authors lower the use of word... "}, "scores": {"overall": "3 = Good: This paper is of interest to the *ACL audience and could be published, but might not be appropriate for a top-tier publication venue. It would likely be a strong paper in a suitable workshop.", "best_paper": "No", "replicability": "3 = They could reproduce the results with some difficulty. The settings of parameters are underspecified or subjectively determined, and/or the training/evaluation data are not widely available.", "datasets": "1 = No usable datasets submitted.", "software": "1 = No usable software released."}, "meta": {"license": "Copyright © 2021 administered by the Association for Computational Linguistics (ACL)\n                                on behalf of ACL content contributors: None, and other contributors who wish to remain anonymous.\n                                Content is made available under a Creative Commons Attribution 4.0 International Public License.", "author_identity_guess": "1 = I do not have even an educated guess about author identity.", "confidence": "4 = Quite sure. I tried to check the important points carefully. It's unlikely, though conceivable, that I missed something that should affect my ratings.", "sentences": {"paper_summary": [[0, 114], [114, 265], [265, 362], [362, 493], [493, 494], [494, 560]], "summary_of_strengths": [[0, 73], [73, 119]], "summary_of_weaknesses": [[0, 107], [107, 187], [187, 375], [375, 376], [376, 501], [501, 590], [590, 735]], "comments,_suggestions_and_typos": [[0, 15], [15, 74], [74, 304], [304, 370], [370, 443], [443, 516], [516, 563]]}}}]