[{"rid": "a40d8ae07e3e76a77ca4f5a264ffbd75a5ba5c324557ec5e1ea3fa28b9291a45f9dbc7a16fe6e707c2b8c29ea3afbadb0fd88d29e8f49371789b082d8c27476e", "reviewer": null, "report": {"paper_summary": "This paper presents a knowledge distillation method based on MAML. The paper's main aim is to address two drawbacks of existing knowledge distillation methods: (1) teacher being unaware of the capacity of the student, and (2) teacher not optimised for distillation.\nThe paper assumes the teacher network is trainable and proposes a simple technique that, in the MAML framework, applies \"pilot updates\" in the inner loop to make the teacher and student networks more compatible. Pilot updates are essentially MAML's original inner loop, but applied twice, the first time to update the teacher and the second time to update the student.\nExperiments are performed on distilling BERT and evaluated on a number of tasks/datasets in the GLUE benchmark. The proposed method consistently outperforms the compared baselines on almost all tasks.\nOn the CV side, the proposed method is evaluated on distilling ResNet and VGG. The method achieves comparable performance with SOTA model CRD. ", "summary_of_strengths": "- Addresses knowledge distillation, an important technique with wide application in machine learning, natural language processing and computer vision.\n- The proposed method achieves SOTA performance on a large number of tasks in NLP, in distilling BERT.\n- The presentation is clear, logical and easy to follow.\n- A comparative analysis on the tradeoff between model performance and computational costs. ", "summary_of_weaknesses": "- The proposed method is quite simple. Its essence is the \"pilot update\" mechanism, which basically applies the inner loop of MAML twice, once to update the teacher, and once to update the student.\n- The achieved performance boost is moderate.\n- The comparative analysis in Table 2 shows that, with significantly more computational costs than the two compared baselines (PKD and ProKT), the model achieves a modest performance gain of about 0.5 absolute F1 points. This analysis, though very welcome, demonstrates that the proposed method suffers a large computational penalty for a small accuracy/F1 gain. ", "comments,_suggestions_and_typos": "This paper is a resubmission from ARR August, and it has not been significantly improved. The only major addition is Table 2 that describes the tradeoff between computational cost and model performance. Therefore, the majority of reviewers' comments from ARR August still holds (I was one of the original reviewers). "}, "scores": {"overall": "3 = Good: This paper is of interest to the *ACL audience and could be published, but might not be appropriate for a top-tier publication venue. It would likely be a strong paper in a suitable workshop.", "best_paper": "No", "replicability": "4 = They could mostly reproduce the results, but there may be some variation because of sample variance or minor variations in their interpretation of the protocol or method.", "datasets": "1 = No usable datasets submitted.", "software": "1 = No usable software released."}, "meta": {"license": "Copyright © 2021 administered by the Association for Computational Linguistics (ACL)\n                                on behalf of ACL content contributors: None, and other contributors who wish to remain anonymous.\n                                Content is made available under a Creative Commons Attribution 4.0 International Public License.", "author_identity_guess": "3 = From the contents of the submission itself, I know/can guess at least one author's name.", "confidence": "4 = Quite sure. I tried to check the important points carefully. It's unlikely, though conceivable, that I missed something that should affect my ratings.", "sentences": {"paper_summary": [[0, 67], [67, 266], [266, 478], [478, 635], [635, 747], [747, 836], [836, 915], [915, 979]], "summary_of_strengths": [[0, 151], [151, 254], [254, 311], [311, 403]], "summary_of_weaknesses": [[0, 39], [39, 198], [198, 244], [244, 465], [465, 607]], "comments,_suggestions_and_typos": [[0, 90], [90, 203], [203, 317]]}}}]