[{"rid": "7f02b5e5a8d97efbde8c6f66e1df0d06cf8d072bc5f2f468ebaf33f7c3a4c57197edd42d7ae0d32f2d86d56fe48d56228aced4a79f4e543479db29fe4991362a", "reviewer": "Ziming Huang", "report": {"paper_summary": "This paper conducts an extensive empirical study to assess the faithfulness of post-hoc explanations and the performance of select-then-predict models in out-of-domain settings. There are some interesting findings: post-hoc explanation fails faithfulness in out-of-domain; select-then-predict explanation performs well in out-of-domain settings. ", "summary_of_strengths": "1. This paper has a complete logic, from problem definition to description to experiment to analysis, explaining the main idea of ​​this article in detail. This paper and the provided data and code are very clear and well-written.\n2. The motivation and research questions in this paper are very interesting in the explanation domain.\n3. The paper conducts extensive experiments in out-of-domain setting explanation methods comparison based on different models to prove the post-hoc explanation sufficiency and comprehensiveness show misleading increases in out-of-domain settings and select-then-predict classifiers can be used in out-of-domain settings. ", "summary_of_weaknesses": "Generally, the explanation paper will provide some intuitive examples to support their own arguments to make it more clear. It is recommended that add some examples in the camera-ready version to increase readability. ", "comments,_suggestions_and_typos": "Checking the weakness will help. "}, "scores": {"overall": "3.5 ", "best_paper": "No", "replicability": "4 = They could mostly reproduce the results, but there may be some variation because of sample variance or minor variations in their interpretation of the protocol or method.", "datasets": "4 = Useful: I would recommend the new datasets to other researchers or developers for their ongoing work.", "software": "4 = Useful: I would recommend the new software to other researchers or developers for their ongoing work."}, "meta": {"license": "Copyright © 2021 administered by the Association for Computational Linguistics (ACL)\n                                on behalf of ACL content contributors: Ziming Huang, and other contributors who wish to remain anonymous.\n                                Content is made available under a Creative Commons Attribution 4.0 International Public License.", "author_identity_guess": "1 = I do not have even an educated guess about author identity.", "confidence": "4 = Quite sure. I tried to check the important points carefully. It's unlikely, though conceivable, that I missed something that should affect my ratings.", "sentences": {"paper_summary": [[0, 178], [178, 346]], "summary_of_strengths": [[0, 3], [3, 156], [156, 231], [231, 234], [234, 334], [334, 337], [337, 655]], "summary_of_weaknesses": [[0, 124], [124, 218]], "comments,_suggestions_and_typos": [[0, 33]]}}}, {"rid": "8eecd9d9385a645627d2a6dc5dfb99a9f0adff93a88e823da7c6daa9fb72238b4d05705185bd11eba3b6dec1ff93a1c18736f66f630f4e4674deaa2109450f8e", "reviewer": null, "report": {"paper_summary": "The paper reports an extensive study of explanations in out-of-domain settings. The authors examine the faithfulness of post-hoc explanations (feature attribution approaches) and the out-of-domain performances of inherently faithful models (select-then-predict). The results suggest that random baselines should be used when evaluating post-hoc explanations and that select-then-predict models perform well in out-of-domain settings. ", "summary_of_strengths": "The authors carry out an extensive analysis of explanations in out-of-domain settings considering various datasets and models. The authors describe clearly the motivation, research questions, and contributions of their work. They also introduced in an accessible way the concepts and terminology that are relevant to this research line. The analyses are thorough and their methods well-described.  Besides reporting the results of the analyses, the authors recommend practices for robust evaluation, such as the usage of a random baseline when evaluating post-hoc explanations out-of-domain.  The authors show that select-then-predict models perform rather well in out-of-domain settings, which is a relevant contribution for building real-world applications. ", "summary_of_weaknesses": "It would have been nice to see some examples of predictions and explanations of the models in the paper, and in general some insights from qualitative inspections of the data. ", "comments,_suggestions_and_typos": "- "}, "scores": {"overall": "4 = Strong: This paper is of significant interest (for broad or narrow sub-communities), and warrants acceptance in a top-tier *ACL venue if space allows.", "best_paper": "Maybe", "replicability": "4 = They could mostly reproduce the results, but there may be some variation because of sample variance or minor variations in their interpretation of the protocol or method.", "datasets": "1 = No usable datasets submitted.", "software": "3 = Potentially useful: Someone might find the new software useful for their work."}, "meta": {"license": "Copyright © 2021 administered by the Association for Computational Linguistics (ACL)\n                                on behalf of ACL content contributors: None, and other contributors who wish to remain anonymous.\n                                Content is made available under a Creative Commons Attribution 4.0 International Public License.", "author_identity_guess": "1 = I do not have even an educated guess about author identity.", "confidence": "3 =  Pretty sure, but there's a chance I missed something. Although I have a good feel for this area in general, I did not carefully check the paper's details, e.g., the math or experimental design.", "sentences": {"paper_summary": [[0, 80], [80, 263], [263, 434]], "summary_of_strengths": [[0, 127], [127, 225], [225, 337], [337, 397], [397, 398], [398, 592], [592, 593], [593, 760]], "summary_of_weaknesses": [[0, 176]], "comments,_suggestions_and_typos": [[0, 2]]}}}, {"rid": "9f320459a1665d8d0d4fd148e378270f6dcd498d505a6f2f475a0de31f62931889ab7d137afb7349bf74a57ad9d75223fdaa1a26431d93140d4489848e20eff8", "reviewer": null, "report": {"paper_summary": "The paper measures the out-of-domain faithfulness of post-hoc explanations and the explanations of select-then-predict models. For post-hoc explanations, results show that in many cases, sufficiency and comprehensiveness are better for out-of-domain than for in-domain explanations. This leads to the suggestions,that these models generalize better than other models. Select-then-predict models also perform surprisingly well in out-of-domain settings. However, the authors find that using sufficiency and comprehensiveness for evaluation of faithfulness can be misleading. They hence suggest comparing the faithfulness of post-hoc explanations to a random attribution baseline to ensure robustness. ", "summary_of_strengths": "The paper is well written and easy to understand. It follows a logical structure which makes it easy to follow the experiments and line of argumentation. There are only few grammatical mistakes. A very detailed evaluation is given for both normalized sufficiency and normalized comprehensiveness, as well as full-text F1. The models were trained and evaluated on multiple datasets and domains to ensure unbiased results. A zip file has been attached to reproduce results. The file contains Python code, along with required packages and a detailed README.md. References are given where necessary. All experiments are well explained, and details for datasets, models, and analyses are given in the appendix. ", "summary_of_weaknesses": "There are quite a few punctuation errors and grammatical errors (l. 41, 137, 457), as well as orthographic inconsistencies (e.g., versions of “full-text” l. 95, 343, Table 3, 459, etc.). Some of the findings are printed in italic letters in an inconsistent way (e.g., 391-396, 427-438, 555-561, but not 567-581), also, this makes reading a little inconvenient. Spaces between tables, formulas, and text are also inconsistent (e.g., l. 285, 372). ", "comments,_suggestions_and_typos": "Please correct the punctuation errors and review the consistency of words (orthography with or without dashes, upper and lowercase letters). Remove italic conclusions to ensure better readability. "}, "scores": {"overall": "3.5 ", "best_paper": "No", "replicability": "4 = They could mostly reproduce the results, but there may be some variation because of sample variance or minor variations in their interpretation of the protocol or method.", "datasets": "1 = No usable datasets submitted.", "software": "3 = Potentially useful: Someone might find the new software useful for their work."}, "meta": {"license": "Copyright © 2021 administered by the Association for Computational Linguistics (ACL)\n                                on behalf of ACL content contributors: None, and other contributors who wish to remain anonymous.\n                                Content is made available under a Creative Commons Attribution 4.0 International Public License.", "author_identity_guess": "1 = I do not have even an educated guess about author identity.", "confidence": "4 = Quite sure. I tried to check the important points carefully. It's unlikely, though conceivable, that I missed something that should affect my ratings.", "sentences": {"paper_summary": [[0, 127], [127, 283], [283, 368], [368, 453], [453, 574], [574, 700]], "summary_of_strengths": [[0, 50], [50, 154], [154, 195], [195, 322], [322, 421], [421, 472], [472, 558], [558, 596], [596, 706]], "summary_of_weaknesses": [[0, 187], [187, 361], [361, 446]], "comments,_suggestions_and_typos": [[0, 141], [141, 197]]}}}]