[{"rid": "28224ff4d7b034bc6b591eea7f83b30d1f9839fb96acf3d804e1f31d39f2f1f2fb28ea3e0597332bc5d531184f028caf4e0d8b07e03fdb49f330f81f3d18d6e1", "reviewer": null, "report": {"paper_summary": "This paper pursues a line of research about 'prompting', a method that leverages the prediction capability of pre-trained language models to help perform few-shot classification.  The paper explores one of the research topics in this line of research: how to find good mappings from the original task labels (e.g., positive vs negative) to tokens that can be predicted by the language model (the `label words', e.g., \"great\", \"perfect\" vs \"terrible\", \"awful\").  More specifically, the authors propose a simpler method to use multiple labels words; and a selection method that makes sure that no label word is shared by multiple labels. \nExperiments are presented, with comparison to baselines and earlier methods (Shick et al., 2020; Gao et al., 2021), followed by analyses and a discussion. \nThis is a second revised version. ", "summary_of_strengths": "- The authors propose a simple method to use multiple label words per class by summing their language model probabilities, and does not need to perform fine-tuning during label-word search.  Gao et al. (2021) instead only keep the best label word for each class, and perform fine-tuning multiple times during label-word search.\n- Tested on seven classification tasks in the BLUE benchmark, the method performs better in general than earlier prompting methods on few-shot experiments (n=16 examples in each class in train and in dev).\n- Each experiment is performed five times, mean and standard deviation are provided.\n- The Analysis and Discussion sections count three pages including tables and figures, and show example label words, examine the impact of deduplication, multiple labels, and label mapping, the impact of the number of training examples, and attempt to analyze why this methods works. ", "summary_of_weaknesses": "- (minor) Studying the correlation between inter-class JS divergence and performance is a good point.  However, I found its results not entirely convincing because it depends on the presence of two of the six tasks: CoLA and SST-2.  CoLA is a quite different task, and the authors also report the correlation without this task, which becomes much smaller.  At that point the presence of a positive correlation entirely depends on the presence of SST-2.  Or to phrase it differently, no such correlation is observed in the subset of tasks {QQP, MRPC, QNLI, RTE}. ", "comments,_suggestions_and_typos": "- The authors have taken into account all my previous comments, and plan to look into the correlation point above. "}, "scores": {"overall": "4 = This paper represents solid work, and is of significant interest for the (broad or narrow) sub-communities that might build on it.", "best_paper": "No", "datasets": "1 = No usable datasets submitted.", "software": "4 = Useful: I would recommend the new software to other researchers or developers for their ongoing work."}, "meta": {"license": "Copyright © 2021 administered by the Association for Computational Linguistics (ACL)\n                                on behalf of ACL content contributors: None, and other contributors who wish to remain anonymous.\n                                Content is made available under a Creative Commons Attribution 4.0 International Public License.", "author_identity_guess": "1 = I do not have even an educated guess about author identity.", "confidence": "4 = Quite sure. I tried to check the important points carefully. It's unlikely, though conceivable, that I missed something that should affect my ratings.", "sentences": {"paper_summary": [[0, 179], [179, 461], [461, 636], [636, 792], [792, 827]], "summary_of_strengths": [[0, 190], [190, 328], [328, 534], [534, 619], [619, 903]], "summary_of_weaknesses": [[0, 102], [102, 232], [232, 356], [356, 453], [453, 562]], "comments,_suggestions_and_typos": [[0, 115]]}}}]