[{"rid": "0943e5d2efbf75734b113861f9c2bb8ca031e0740fce519c60b9b17470dea2b0df56aa327e769a0e36e89ac92fa23086cd9ee85094e50a67d721965f0c3509f7", "reviewer": null, "report": {"paper_summary": "The paper presents a new corpus with anaphoric relations, annotating recipes for coreference and bridging. The utility of the corpus is demonstrated by training a ML classifier. ", "summary_of_strengths": "The new corpus can benefit others studying anaphora beyond identify. The paper is well written. ", "summary_of_weaknesses": "- Transfer learning does not look to bring significant improvements. Looking at the variance, the results with and without transfer learning overlap. ", "comments,_suggestions_and_typos": "Can you please clarify/expand the evaluation methodology, e.g., given gold anaphors, you only evaluate the antecedents? At least you should state why the standard evaluation metrics fail in this case, e.g., they cannot score plurals, i.e., split-antecedent references Typo: line 513 'pretrained' "}, "scores": {"overall": "3 = Good: This paper is of interest to the *ACL audience and could be published, but might not be appropriate for a top-tier publication venue. It would likely be a strong paper in a suitable workshop.", "best_paper": "No", "replicability": "5 = They could easily reproduce the results.", "datasets": "4 = Useful: I would recommend the new datasets to other researchers or developers for their ongoing work.", "software": "1 = No usable software released."}, "meta": {"license": "Copyright © 2021 administered by the Association for Computational Linguistics (ACL)\n                                on behalf of ACL content contributors: None, and other contributors who wish to remain anonymous.\n                                Content is made available under a Creative Commons Attribution 4.0 International Public License.", "author_identity_guess": "1 = I do not have even an educated guess about author identity.", "confidence": "4 = Quite sure. I tried to check the important points carefully. It's unlikely, though conceivable, that I missed something that should affect my ratings.", "sentences": {"paper_summary": [[0, 107], [107, 178]], "summary_of_strengths": [[0, 69], [69, 96]], "summary_of_weaknesses": [[0, 69], [69, 150]], "comments,_suggestions_and_typos": [[0, 120], [120, 268], [268, 296]]}}}, {"rid": "0db51440a48c9e4de5dd6ddf46099151432764b515c4c534b6c3dd3c7abaae9e2a9c6fdd35a710d1cac40eb661eb2f84279ba5c7fdde3d94e78f0ee0c4fe015e", "reviewer": null, "report": {"paper_summary": "The main point of the paper is a corpus of baking recipes annotated for coreference and bridging relations (both 1-to-1 and many-to-1 transformations of ingredients) and experiments to learn coreference resolution on this genre by transfer from either just unsupervised pretraining (GloVe, ELMo) or including supervised training on an existing larger chemical corpus and subsequent transfer using a state-of-the-art model for span linking coreference. The authors show that both joint training of coreference and bridging and transfer learning from the larger annotated corpus help the performance of the model. ", "summary_of_strengths": "- the authors present a new corpus with coreference and bridging annotation which provides an interesting dataset for exploring this task - the authors provide a nice survey of the work especially concerning bridging corpora and resolution - the authors present some experiments showing that transfer learning can be beneficial for learning bridging resolution ", "summary_of_weaknesses": "- while the focus of the paper is on bridging resolution and the authors claim that transfer learning allows the model to incorporate procedural knowledge, this claim is not backed up by any kind of error analysis or qualitative examples that would show what the model learns exactly - the part that is novel wrt Feng et al 2021 is pretty much just the extension towards ingredient transformation and the transfer learning study (which is however less elaborate as the one in Xia&vanDurme) - while the models are reasonably state of the art (based on ELMo and in line with Lee et al 2018 and Feng et al 2021), newer research such as the Xia&vanDurme paper use more recent language models such as XLM-R as the base model, which may lead to better performance overall ", "comments,_suggestions_and_typos": "Xia and van Durme has been published at EMNLP 2021 and can be cited as such.\nSection 4 413: \"For evaluation, we use precision, recall and F1\" - since MUC and B3 measures also define P/R/F1, it's good to mention here that it's P/R/F1 on individual (coreference or bridging) links. \nSection 6 555: \"Table 4 shows ...\" - the structure of Table 3 and Table 4 isn't very intuitive, since there is partial overlap in conditions and metrics but essentially it's one big collection of results (baseline, +joint, +transfer, +joint+transfer). It's not clear to me why the \"overall\" figure isn't computed based on the separate baseline classifiers "}, "scores": {"overall": "3 = Good: This paper is of interest to the *ACL audience and could be published, but might not be appropriate for a top-tier publication venue. It would likely be a strong paper in a suitable workshop.", "best_paper": "No", "replicability": "4 = They could mostly reproduce the results, but there may be some variation because of sample variance or minor variations in their interpretation of the protocol or method.", "datasets": "4 = Useful: I would recommend the new datasets to other researchers or developers for their ongoing work.", "software": "2 = Documentary: The new software will be useful to study or replicate the reported research, although for other purposes it may have limited interest or limited usability. (Still a positive rating)"}, "meta": {"license": "Copyright © 2021 administered by the Association for Computational Linguistics (ACL)\n                                on behalf of ACL content contributors: None, and other contributors who wish to remain anonymous.\n                                Content is made available under a Creative Commons Attribution 4.0 International Public License.", "author_identity_guess": "1 = I do not have even an educated guess about author identity.", "confidence": "4 = Quite sure. I tried to check the important points carefully. It's unlikely, though conceivable, that I missed something that should affect my ratings.", "sentences": {"paper_summary": [[0, 452], [452, 612]], "summary_of_strengths": [[0, 138], [138, 240], [240, 361]], "summary_of_weaknesses": [[0, 284], [284, 490], [490, 766]], "comments,_suggestions_and_typos": [[0, 77], [77, 280], [280, 533], [533, 637]]}}}]