[{"rid": "f8c377dc052065d77805a0b7b2d085a0b319ea5a3e3867e7b1e27b41aa7d6f5f9c91ab6df4758e4f31f7e436bbd62e0d2ced811481318e0557613ae611c1fdf4", "reviewer": "Md Mosharaf Hossain", "report": {"paper_summary": "The purpose of this paper is to build a system to detect negation cues and negation focus by gathering additional data and utilizing negation masking strategies. Results indicate some improvement as well as some transferability of negation across domains. ", "summary_of_strengths": "In order to build AugNB, the authors collected a large number of negation sentences. This large corpus might be useful for future research.   Using their proposed models (e.g., AugNB and CueNB), the authors conduct extensive experiments on a variety of datasets.   Based on the reported results, detecting negation cues and detecting focus of negation appear promising for most of the datasets. ", "summary_of_weaknesses": "While the results are promising, the innovation of this paper is somewhat limited as the approaches are quite well known.   The paper indicates that only gold cue information is used for scope resolution (I. 219). Now, the question is what happens if you use predicted cues? Is it the case that a few wrong cues can give devastating results on focus detection?  More details should be there for the approach \"negation-focused data collection\" approach. It seems additional cues are collected only from a biomedical domain. Therefore, the model AugNB can be biased to perform better on the biomedical datasets only. \nFurther, there should be more information on CueNB model as well. How is the masking objective utilized on top of AugNB? ", "comments,_suggestions_and_typos": "Numbers in Tables 2 and 3 look more crowded. I would round to one decimal point in these tables. "}, "scores": {"overall": "2.5 ", "best_paper": "No", "datasets": "2 = Documentary: The new datasets will be useful to study or replicate the reported research, although for other purposes they may have limited interest or limited usability. (Still a positive rating)", "software": "2 = Documentary: The new software will be useful to study or replicate the reported research, although for other purposes it may have limited interest or limited usability. (Still a positive rating)"}, "meta": {"license": "Copyright © 2021 administered by the Association for Computational Linguistics (ACL)\n                                on behalf of ACL content contributors: Md Mosharaf Hossain, and other contributors who wish to remain anonymous.\n                                Content is made available under a Creative Commons Attribution 4.0 International Public License.", "author_identity_guess": "1 = I do not have even an educated guess about author identity.", "confidence": "4 = Quite sure. I tried to check the important points carefully. It's unlikely, though conceivable, that I missed something that should affect my ratings.", "sentences": {"paper_summary": [[0, 162], [162, 256]], "summary_of_strengths": [[0, 85], [85, 140], [140, 263], [263, 395]], "summary_of_weaknesses": [[0, 122], [122, 214], [214, 275], [275, 361], [361, 362], [362, 453], [453, 523], [523, 615], [615, 682], [682, 737]], "comments,_suggestions_and_typos": [[0, 45], [45, 97]]}}}]