[{"rid": "4ed3080841b0dcb740254eca0b55df04d76059c6702e320ca95cdfdd81b161c85c62a2fe003743c52941a08d76169471eea91799c0857f084f36406c789b2450", "reviewer": null, "report": {"paper_summary": "This paper deals with the problem of table-based verification. It proposes learning how to mix the outcomes of three experts. Each of these experts focuses on a different kind of information (table reasoning). Each of these expert is also based on different technologies as a means of maximizing its performance. ", "summary_of_strengths": "Overall, I liked the paper and the approach. \nThe paper can be understood with just one read. \nThe idea is clear and technically sounds.\nI do not see any technical flaw in this work (considering the restrictions), and I like it. I think it is a competitive paper for a top-tier conference. ", "summary_of_weaknesses": "The main weakness of this paper is that it is unnecessarily cryptic. Although it does not have hard maths, there are things that could be explained only with words easily (page 3 for instance).\nIn the empirical section, I would add error analysis, significance tests between different configuration, especially in sections 6.1-6.3 ", "comments,_suggestions_and_typos": "a) \"Table-based verification is more challenging than unstructured-text-based\" I would suggest to you that the right thing to say is \"Table-based verification faces different challenges than unstructured-text-based....\" Text analysis has been around for quite a long time, while [web] table analysis for around 15 years.\nb) \"Section 2 \"Task Formulation\" I would re-design it as a \"Research Question(s)\" where you say mostly the same thing but in a clearer way, including the main finding. \"\nc) How do you know that a row in a table is actually true? :)\nd) What hardware did you require?\ne) Some history of table mining forerunners would be nice in the extra page.\nf) What is the trigger-word set??? Did I overlook something? That second point was unclear to me. I think I needed to make my way until section 5.3 to get it. ", "ethical_concerns": ""}, "scores": {"overall": "3.5 ", "best_paper": "No", "replicability": "3 = They could reproduce the results with some difficulty. The settings of parameters are underspecified or subjectively determined, and/or the training/evaluation data are not widely available.", "datasets": "1 = No usable datasets submitted.", "software": "2 = Documentary: The new software will be useful to study or replicate the reported research, although for other purposes it may have limited interest or limited usability. (Still a positive rating)"}, "meta": {"license": "Copyright © 2021 administered by the Association for Computational Linguistics (ACL)\n                                on behalf of ACL content contributors: None, and other contributors who wish to remain anonymous.\n                                Content is made available under a Creative Commons Attribution 4.0 International Public License.", "author_identity_guess": "3 = From the contents of the submission itself, I know/can guess at least one author's name.", "confidence": "3 =  Pretty sure, but there's a chance I missed something. Although I have a good feel for this area in general, I did not carefully check the paper's details, e.g., the math or experimental design.", "sentences": {"paper_summary": [[0, 63], [63, 126], [126, 210], [210, 313]], "summary_of_strengths": [[0, 45], [45, 94], [94, 137], [137, 229], [229, 290]], "summary_of_weaknesses": [[0, 69], [69, 194], [194, 331]], "comments,_suggestions_and_typos": [[0, 79], [79, 321], [321, 491], [491, 553], [553, 587], [587, 664], [664, 699], [699, 725], [725, 762], [762, 823]], "ethical_concerns": []}}}]