[{"rid": "2fb33bc9fdbcd79cacf981e5d8f5870b249322065a211b6c886864d9ffcba2d9dff02d00c95d18272fb974869f2836bd84eebb25117b7bd525525b27049465db", "reviewer": "Rahmad Mahendra", "report": {"paper_summary": "This paper reviews recent state of NLP in South Asia with special focus on historical comparative linguistics. The authors argue that the most fundamental problem of South Asian NLP is data scatteredness instead of data scarcity. The data is available to extract even for endangered languages, while the challenges are how to wrangle this data and to digitise existing non machine readable texts. The authors then present three ongoing language resource projects they are working on, i.e. dependency treebanks, etymological database, and historical linguistic analysis. In the future, the authors plan to work on text digitisation and OCR. ", "summary_of_strengths": "Several research works presented in this paper adds to the horizon of readers' knowledge about NLP research in South Asia. ", "summary_of_weaknesses": "- This paper does not provide a clear and explicit definition of historical-comparative linguistics. Not all *ACL audiences familiarize with this area, except the member of special working group in limited workshop scope.\n- It is hard to follow what are the opinion piece the authors want to share with the readers through this paper. The paper is more likely reporting what the authors are currently do and what they plan to do, but still lacks the reflection points. ", "comments,_suggestions_and_typos": "It is better if the authors can relate the discussion points with the more general context. Does the linguistics issues discussing in this paper applied only for the languages in South Asia? "}, "scores": {"overall": "3 = Good: This paper is of interest to the *ACL audience and could be published, but might not be appropriate for a top-tier publication venue. It would likely be a strong paper in a suitable workshop.", "best_paper": "No", "replicability": "3 = They could reproduce the results with some difficulty. The settings of parameters are underspecified or subjectively determined, and/or the training/evaluation data are not widely available.", "datasets": "1 = No usable datasets submitted.", "software": "3 = Potentially useful: Someone might find the new software useful for their work."}, "meta": {"license": "Copyright © 2021 administered by the Association for Computational Linguistics (ACL)\n                                on behalf of ACL content contributors: Rahmad Mahendra, and other contributors who wish to remain anonymous.\n                                Content is made available under a Creative Commons Attribution 4.0 International Public License.", "author_identity_guess": "3 = From the contents of the submission itself, I know/can guess at least one author's name.", "confidence": "2 =  Willing to defend my evaluation, but it is fairly likely that I missed some details, didn't understand some central points, or can't be sure about the novelty of the work.", "sentences": {"paper_summary": [[0, 111], [111, 230], [230, 397], [397, 570], [570, 640]], "summary_of_strengths": [[0, 123]], "summary_of_weaknesses": [[0, 101], [101, 222], [222, 335], [335, 469]], "comments,_suggestions_and_typos": [[0, 92], [92, 191]]}}}, {"rid": "1284e8772390636549c1dac72d685525220b5422e9291f23c7b07de602465889f518be29b0c17896d5037af4b4cc1d8f1e917282bb224f407618741567d2107e", "reviewer": null, "report": {"paper_summary": "The paper surveys the state of NLP for South Asian languages with a focus on historical linguistics. The authors first describe prior efforts in NLP and linguistics research for South Asian languages and show that most languages in South Asia are severely underrepresented. They argue that the main issue is not data scarcity; data is theoretically available, it just needs to be consolidated and used. Further, the authors highlight a number of ongoing projects and discuss potential future work. For me, the paper mainly serves as an entry point for researchers seeking to get involved in NLP and comparative linguistics for South Asian (or related) languages. ", "summary_of_strengths": "- Addresses an important issue (underrepresentation of South-Asian languages in NLP) - Well-written with a clear structure - Provides an excellent overview of prior work on NLP and comparative linguistics for South Asian languages.\n- Highlights ongoing work in this area of research and provides multiple concrete suggestions for future work, which will help interested people get involved themselves. ", "summary_of_weaknesses": "Although one of the main arguments made in the paper is that the biggest obstacle for NLP for the South Asian languages is data scatteredness rather than data scarcity, these two concepts seem to be mixed in some places. E.g., the introduction first mentions “This data scarcity persists despite long native traditions of linguistic description, [...]”, but then it says “the the most basic problem in NLP/CL work on South Asian languages is not data scarcity, but data scatteredness”. Why mention the data scarcity issue then, rather than going more into detail on the scatteredness aspect? Similarly, section 3 begins with “Having established the issue of data scarcity”. I wish the distinction between these two concepts would be more clear throughout the paper. ", "comments,_suggestions_and_typos": "Typos: l. 287: serveral → several l. 315: missing space "}, "scores": {"overall": "4 = Strong: This paper is of significant interest (for broad or narrow sub-communities), and warrants acceptance in a top-tier *ACL venue if space allows.", "best_paper": "No", "replicability": "5 = They could easily reproduce the results.", "datasets": "1 = No usable datasets submitted.", "software": "1 = No usable software released."}, "meta": {"license": "Copyright © 2021 administered by the Association for Computational Linguistics (ACL)\n                                on behalf of ACL content contributors: None, and other contributors who wish to remain anonymous.\n                                Content is made available under a Creative Commons Attribution 4.0 International Public License.", "author_identity_guess": "1 = I do not have even an educated guess about author identity.", "confidence": "3 =  Pretty sure, but there's a chance I missed something. Although I have a good feel for this area in general, I did not carefully check the paper's details, e.g., the math or experimental design.", "sentences": {"paper_summary": [[0, 101], [101, 274], [274, 403], [403, 498], [498, 663]], "summary_of_strengths": [[0, 85], [85, 123], [123, 232], [232, 402]], "summary_of_weaknesses": [[0, 221], [221, 486], [486, 592], [592, 674], [674, 766]], "comments,_suggestions_and_typos": [[0, 7], [7, 34], [34, 56]]}}}]