[{"rid": "555b9b4626e46bff6dcd1dd669cac930e4e3c587766a39059797b4d5100a130d8c7aa4ee67cb74e7ebc5a9126fed58d4b54ceab34144da5a84f5d402acdf18af", "reviewer": "Daniel F Campos", "report": {"paper_summary": "The authors compress generalized models using established quantization methods. Finding these fail, they evaluate the failure and to rectify it introduce a novel quantization framework that offers improvements leaps and bounds better than prior methods. Their token-level contrastive distillation approach is elegant, simple, and easy to comprehend. ", "summary_of_strengths": "The authors introduce a well-researched, effective, and scalable method for quantizing generalized models. They implement competitive baselines,  evaluate the failure cases. Using the discovery that quantization produces homogenous embeddings they create their contrastive token distillation method which is shown to improve the generator model performance heavily. ", "summary_of_weaknesses": "The only weakness I see in this paper is a lack of description of the incurred cost for token-level conservative loss. Without being able to see the associated code and run the experiments it is difficult to understand what negative impact using token level contrastive learning has. How much slower does it make the training? How does it affect GPU memory usage? ", "comments,_suggestions_and_typos": "It would be beneficial to the community to release the software and associated models along with exporting the models to an engine that can take advantage of lower precision for increased inference speed. ", "ethical_concerns": "No Ethical concerns as their approaches focus on making models more efficient. "}, "scores": {"overall": "4.5 ", "best_paper": "No", "replicability": "4 = They could mostly reproduce the results, but there may be some variation because of sample variance or minor variations in their interpretation of the protocol or method.", "datasets": "1 = No usable datasets submitted.", "software": "1 = No usable software released."}, "meta": {"license": "Copyright © 2021 administered by the Association for Computational Linguistics (ACL)\n                                on behalf of ACL content contributors: Daniel F Campos, and other contributors who wish to remain anonymous.\n                                Content is made available under a Creative Commons Attribution 4.0 International Public License.", "author_identity_guess": "1 = I do not have even an educated guess about author identity.", "confidence": "4 = Quite sure. I tried to check the important points carefully. It's unlikely, though conceivable, that I missed something that should affect my ratings.", "sentences": {"paper_summary": [[0, 80], [80, 254], [254, 350]], "summary_of_strengths": [[0, 107], [107, 174], [174, 366]], "summary_of_weaknesses": [[0, 119], [119, 284], [284, 327], [327, 364]], "comments,_suggestions_and_typos": [[0, 205]], "ethical_concerns": [[0, 79]]}}}, {"rid": "cb1661f19db1f1d4b29606d1f705743caeb32bbe554bfc35f53b7b2e2d2f52ff97bea4acce68f8ddb841793506df7d447f3546b8759a05474cbd1678e5da2edc", "reviewer": "Parminder Bhatia", "report": {"paper_summary": "Paper proposes quantization of generative PLMs coming from GPT and BART family. To overcome the challenges of homogenous word representations with quantized model which can impact conditional models such as GPT, authors present two modifications 1./ Word level contrastive distillation loss. 2./ Module aware quantization that depends on the magnitude of the layer to incorporate more adaptability.  Empirical results on various tasks show that proposed method outperforms the state of-the-art compression methods on generative  PLMs across next utterance prediction and summarization problems. With comparable performance with the full-precision models, paper present 14.4× and 13.4× compression rates on GPT-2 and BART, respectively. ", "summary_of_strengths": "Paper proposes quantization of generative PLMs coming from GPT and BART family. To overcome the challenges of homogenous word representations with quantized model which can impact conditional models such as GPT, authors present two modifications 1./ Word level contrastive distillation loss. 2./ Module aware quantization that depends on the magnitude of the layer to incorporate more adaptability.  Lot of earlier work focusses on BERT based model. Thorough analysis and proposal to mitigate gaps for generative models makes compelling case for future research where the problem is harder than the BERT counter-part and opens avenues for generative tasks by quantizing large PLMs.\nEmpirical results on various tasks show that proposed method outperforms the state of-the-art compression methods on generative  PLMs across next utterance prediction and summarization problems. With comparable performance with the full-precision models, paper present 14.4× and 13.4× compression rates on GPT-2 and BART, respectively. Thorough ablation studies for the two proposed directions. ", "summary_of_weaknesses": "Lot of interesting ideas presented int he paper. It would be useful to incorporate latency aspects of the proposed methods. Additionally, it seems that GPT is used for utterance and BART for summarization but it will be good to add results for both the models across the tasks to see their impact. ", "comments,_suggestions_and_typos": "There is lot of content and tables. Perhaps moving Related work higher might be useful for readers. Additionally adding results for both QuantGPT and QuantBART for both the tasks for completeness. "}, "scores": {"overall": "4 = Strong: This paper is of significant interest (for broad or narrow sub-communities), and warrants acceptance in a top-tier *ACL venue if space allows.", "best_paper": "Yes", "replicability": "4 = They could mostly reproduce the results, but there may be some variation because of sample variance or minor variations in their interpretation of the protocol or method.", "datasets": "1 = No usable datasets submitted.", "software": "1 = No usable software released."}, "meta": {"license": "Copyright © 2021 administered by the Association for Computational Linguistics (ACL)\n                                on behalf of ACL content contributors: Parminder Bhatia, and other contributors who wish to remain anonymous.\n                                Content is made available under a Creative Commons Attribution 4.0 International Public License.", "author_identity_guess": "1 = I do not have even an educated guess about author identity.", "confidence": "5 = Positive that my evaluation is correct. I read the paper very carefully and am familiar with related work.", "sentences": {"paper_summary": [[0, 80], [80, 292], [292, 399], [399, 400], [400, 595], [595, 736]], "summary_of_strengths": [[0, 80], [80, 292], [292, 399], [399, 400], [400, 450], [450, 682], [682, 877], [877, 1018], [1018, 1077]], "summary_of_weaknesses": [[0, 49], [49, 124], [124, 298]], "comments,_suggestions_and_typos": [[0, 36], [36, 100], [100, 197]]}}}]