[{"rid": "09042c84901c6ef5d7657477eaa05707b16aabb2ff86563542a35f76c67fdd97648d4cf84c7194b92056db882474ac64e74a1334f08ac4608cc481f060a7e726", "reviewer": null, "report": {"paper_summary": "This paper provides a general framework for cross lingual UMLS entity linking which can be adapted to other source languages with some prerequisites specifically four steps - unsupervised learning of a language specific UMLS dictionary, generation of candidate mentions, high level recall matching of candidate mentions to UMLs concepts  and leveraging pre trained neural (Transformer) language models for contextual relevance to determine which candidates are correct.  The method exploits a small annotated  corpus in the source language. \nThe approach is evaluated on standard in domain datasets for both English and Hebrew and the results improve on the state of the art. \nIn summary the work involves a novel contribution to the field of cross lingual entity linking within the biomedical domain. ", "summary_of_strengths": "- The paper is in general well written - makes a nice contribution to state of the art of cross lingual NEL - any NEL related contribution targeted to language other than English is of value.\n- appears to have good command of the state of the art. \n-methodology clearly explained and good evaluation.\n- code appears to be available - not sure about documentation for reproducibility ", "summary_of_weaknesses": "- much of the approach  is based on combining existing published work with respect to the dictionary construction and candidate generation so it makes it difficult to assess how much contribution has been made by the authors.\n-  Some issues on readability - There are many acronyms such as CUI(Concept Unique Identifier ), BC5CDR (BioCreative V CDR corpus), MeSH.    I know what they are but the paper should be self contained and acronyms when introduced first should be elaborated on.     i.e UMLS Dictionary Fine-Tuning (UMLS -DTF) - never made obvious in the text.    also Section names - often they are just numbers (see 5.4 or see 4.2 ) - but these should be Section 5.4  and Section 4.2 - no error analysis of spurious  or missing mentions across all datasets especially - BC5CDR - the abstract is too long and should be shortened. ", "comments,_suggestions_and_typos": "-  Some issues on readability -  There are many acronyms such as CUI(Concept Unique Identifier ), BC5CDR (BioCreative V CDR corpus), MeSH.    I know what they are but the paper should be self contained and acronyms when introduced first should be elaborated on.     i.e UMLS Dictionary Fine-Tuning (UMLS -DTF) - never made obvious in the text.    also Section names - often they are just numbers (see 5.4 or see 4.2 ) - but these should be Section 5.4  and Section 4.2 - consider adding into future work an error analysis of spurious  or missing mentions across all datasets especially - BC5CDR - the abstract is too long and should be shortened.\n- line 207 - equation - should one of the L* have the t subscript?  Or am I wrong? "}, "scores": {"overall": "3.5 ", "best_paper": "No", "replicability": "3 = They could reproduce the results with some difficulty. The settings of parameters are underspecified or subjectively determined, and/or the training/evaluation data are not widely available.", "datasets": "1 = No usable datasets submitted.", "software": "4 = Useful: I would recommend the new software to other researchers or developers for their ongoing work."}, "meta": {"license": "Copyright © 2021 administered by the Association for Computational Linguistics (ACL)\n                                on behalf of ACL content contributors: None, and other contributors who wish to remain anonymous.\n                                Content is made available under a Creative Commons Attribution 4.0 International Public License.", "author_identity_guess": "1 = I do not have even an educated guess about author identity.", "confidence": "4 = Quite sure. I tried to check the important points carefully. It's unlikely, though conceivable, that I missed something that should affect my ratings.", "sentences": {"paper_summary": [[0, 470], [470, 541], [541, 676], [676, 802]], "summary_of_strengths": [[0, 39], [39, 108], [108, 192], [192, 248], [248, 301], [301, 383]], "summary_of_weaknesses": [[0, 226], [226, 364], [364, 487], [487, 569], [569, 694], [694, 787], [787, 839]], "comments,_suggestions_and_typos": [[0, 139], [139, 262], [262, 344], [344, 469], [469, 595], [595, 647], [647, 714], [714, 730]]}}}]