[{"rid": "cff563c41391b46a21cff06dbd6d523743628330e339eaf8cfe600f0d9c05fed00df32de7000a49a87627121ef98e12e57219ddd0df9ee55489a6deb8b9ce88b", "reviewer": null, "report": {"paper_summary": "This paper presents a method for inducing unsupervised tags for word sequences, later to be compared against POS tags. The method combines a CRF autoencoder (CRF-AE) for the first step of inducing pseudo-labels, with a rule-based approach for the later step of regenerating the word sequence from these pseudotags. The system hinges on contextualized character-based ELMo representations and some algebraic modifications that are empirically proven to be useful. The system outperforms previous approaches to this problem on both the PTB dataset and a small subset of UD treebanks. ", "summary_of_strengths": "The system outperforms existing ones on the task of unsupervised POS tag induction. ", "summary_of_weaknesses": "This might be a bit unfair, but a serious concern of mine is the task itself. Barring any further information on the evaluation protocol, most notably on the *number of induced tags allowed for the system*, one can think of a trivial system that outperforms any of the ones presented by almost 10 points on PTB - just learn a tag for each vocabulary item. The authors offer no analysis of their system's actual outputs, of which \"many\" correlate with which \"one\" in the evaluation scheme, and although they use a second metric that contains a component that mitigates this problem, they leave this detail out and send the reader to the appendix to understand what the metric does (this is completely unacceptable. If you're using a metric, especially if you're arguing that it's better than the other one, at least explain the virtues of it along general lines in the main text).\nThe multilingual evaluation claims to be of \"the UD data\", a dataset of over 100 languages, yet the authors only select ten without explaining why. The availability of ELMo embeddings, in a resource tucked away in the appendix as well, is for about 45 languages and the intersection is significantly more than 10. ", "comments,_suggestions_and_typos": "Section 3 (the Methods) is very difficult to follow. Almost every subsection selectively gets rid of part of the notation without warning, and inconsistencies abound. For example, in Figure 3, are h_i vectors or lists of vectors (with different layers) and if the latter, at what part are they aggregated? What's the input and output of the minus operand (it has two outgoing arrows?); Is W^s the same as W^{hourglass}? Is it a new parameter? Why is the (unnumbered) equation before line 427 referring to equation (8) as replacing it but taking different inputs (forward and backward h's as opposed to h's from different indices, which by the way may or may not be indicating layers or words, since the variable \"i\" is reserved for neither). Using vague terminology like \"purified representations\" (l.253) doesn't help this overall messiness, making the system very hard to understand.\nIn equation (12), there's a dependence on the vocabulary. How do OOV words get generated under this formulation?\nDo you fine-tune the ELMo parameters?\nOther stuff: - The last sentence of the first paragraph is unfinished.\n- l.64 an-->a - l.294 spareness-->sparseness - l.328 I'm pretty sure you meant \"supervised\" rather than \"unsupervised\", these are the standard splits for *all* WSJ tasks, not limited to dependency parsing either. "}, "scores": {"overall": "2.5 ", "best_paper": "No", "replicability": "3 = They could reproduce the results with some difficulty. The settings of parameters are underspecified or subjectively determined, and/or the training/evaluation data are not widely available.", "datasets": "1 = No usable datasets submitted.", "software": "2 = Documentary: The new software will be useful to study or replicate the reported research, although for other purposes it may have limited interest or limited usability. (Still a positive rating)"}, "meta": {"license": "Copyright © 2021 administered by the Association for Computational Linguistics (ACL)\n                                on behalf of ACL content contributors: None, and other contributors who wish to remain anonymous.\n                                Content is made available under a Creative Commons Attribution 4.0 International Public License.", "author_identity_guess": "1 = I do not have even an educated guess about author identity.", "confidence": "3 =  Pretty sure, but there's a chance I missed something. Although I have a good feel for this area in general, I did not carefully check the paper's details, e.g., the math or experimental design.", "sentences": {"paper_summary": [[0, 119], [119, 315], [315, 463], [463, 582]], "summary_of_strengths": [[0, 84]], "summary_of_weaknesses": [[0, 78], [78, 356], [356, 714], [714, 880], [880, 1028], [1028, 1194]], "comments,_suggestions_and_typos": [[0, 53], [53, 167], [167, 306], [306, 386], [386, 420], [420, 443], [443, 742], [742, 886], [886, 944], [944, 999], [999, 1037], [1037, 1050], [1050, 1108], [1108, 1122], [1122, 1153], [1153, 1321]]}}}]