[{"rid": "21f74d3b60a2101f1630894856ba99180af6242a02b80070fe7274f02c867becdb7ff3d683a90f84d0f414d7b873d0fa2c18407c4bedd4e1bebb8dbcedc40de6", "reviewer": null, "report": {"paper_summary": "This paper works on multi-parallel word alignment (MPWA) through graph neural network (GNN), in particular the graph attention network (GAT). Instead of limiting the word alignment model training to parallel text (bitext), the authors follow the line of work which exploits multi-parallel corpora, which enables recovering missing alignments between a source and a target language. For this, the authors leveraged the community detection (CD) algorithm for graph, which makes the sub-graph within a community complete and while disconnecting inter-community edges, for training data labels.\nThe GNN proposed in the paper takes as input the node features which take into account the graph structure, community membership, and content embeddings which include word, position, and language. To optimize the resulting alignment edges, the authors propose two strategies to post-process the alignments based on the grow-diag-final-and employed in the statistical MT alignment, Thresholding GDFA (TGDFA) and TGDFA+orig ", "summary_of_strengths": "The approach of multi-parallel word alignment (MPWA) is interesting not only because word alignment has largely been not worked on since the advent of neural machine translation (NMT) and only recently resurfaced, but also because of the growing interest of interpretable neural network models, which the current NMT does not really have. In addition, the SMT word alignment also benefits low-resource languages for which parallel or even monolingual corpora are not adequate.\nThe experimental result shows that the proposed graph neural network (GNN) approach outperforms the strong statistical word alignment baseline and prior graph-based and matrix-based approaches in terms of the overall alignment error rate and F1. ", "summary_of_weaknesses": "Although the paper is interesting and strongly supported by experimental results, understanding the details is tough. For one, the difference between TGDFA+orig and TGDFA is not very clear in what is meant by the original bilingual GDFA. An illustration (page limit permitting) may be helpful to understand the difference.\nIt is unclear if HELFI training set uses 3 languages or 84 as listed in the appendix. ", "comments,_suggestions_and_typos": "Apart from the concerns above, it is better to have some insights on how more other language pairs not in the test set correlates with increased performance. This can be achieved by experimental setups which include or exclude other languages not in the test set. For example, in HELFI, there can be one setup which includes only Finnish, Greek, and Hebrew and another that includes all the 84 languages in the Appendix A. The Appendix A is awkward as the section heading is not in one page with the entire content, which can be achieved by the typesetting. ", "ethical_concerns": "(nothing to concern) "}, "scores": {"overall": "4 = Strong: This paper is of significant interest (for broad or narrow sub-communities), and warrants acceptance in a top-tier *ACL venue if space allows.", "best_paper": "No", "replicability": "4 = They could mostly reproduce the results, but there may be some variation because of sample variance or minor variations in their interpretation of the protocol or method.", "datasets": "1 = No usable datasets submitted.", "software": "1 = No usable software released."}, "meta": {"license": "Copyright © 2021 administered by the Association for Computational Linguistics (ACL)\n                                on behalf of ACL content contributors: None, and other contributors who wish to remain anonymous.\n                                Content is made available under a Creative Commons Attribution 4.0 International Public License.", "author_identity_guess": "3 = From the contents of the submission itself, I know/can guess at least one author's name.", "confidence": "3 =  Pretty sure, but there's a chance I missed something. Although I have a good feel for this area in general, I did not carefully check the paper's details, e.g., the math or experimental design.", "sentences": {"paper_summary": [[0, 142], [142, 382], [382, 591], [591, 788], [788, 1013]], "summary_of_strengths": [[0, 339], [339, 477], [477, 723]], "summary_of_weaknesses": [[0, 118], [118, 238], [238, 323], [323, 409]], "comments,_suggestions_and_typos": [[0, 158], [158, 264], [264, 423], [423, 558]], "ethical_concerns": [[0, 21]]}}}]