[{"rid": "74af24c1125fd63845d8b3d8cd1945f8ee33cf98b237e2309548d6ebe615ecf2d2efec22bd4100681a90c170d5f347dc81c7717571b7cf3c849f5a34f744eed0", "reviewer": "Yunfang Wu", "report": {"paper_summary": "This paper makes a modification to the previous prefix-tuning to achieve controllable language generation, which considers contrastive prefixes (e.g. positive vs. negative) and train multiple prefixes simultaneously. It presents supervised, unsupervised and semi-supervised frameworks for training, and provides a unified perspective for both single-aspect control and multi-aspect control. The proposed method is novel and the experiments are comprehensive. This paper is well organized and well written. ", "summary_of_strengths": "1.This paper innovatively applies the prefix-learning to the domain of controllable natural language generation, and achieves promising results on sentiment-control, topic-control language generation tasks. \n2. By using the contrastive prefixes to do the supervised and unsupervised training, it can further enhance the ability of prefix-learning and yield better results on the controllability of text generation. \n3.The author conducted sufficient experiments to verify the effect of the model, described the experimental parameters in detail, and compared with related models. ", "summary_of_weaknesses": "I have two concerns about the experimental results. \n1. In the few-shot learning, when the samples are increased from 24 to 1K, the attribute relevance drops by 2 points for positive class as shown in Table 1, and the toxicity metric becomes worse for the detoxification task as shown in Table 2. Please give some explanations. \n2. In human evaluation, the inter-annotator agreement on the sentiment task and the AGNews 482 task is only 0.39 and 0.30 in Fleiss’ κ, which is low to guarantee a high quality of the evaluation data. ", "comments,_suggestions_and_typos": "The paper is well organized and well written. "}, "scores": {"overall": "3.5 ", "best_paper": "No", "replicability": "4 = They could mostly reproduce the results, but there may be some variation because of sample variance or minor variations in their interpretation of the protocol or method.", "datasets": "1 = No usable datasets submitted.", "software": "4 = Useful: I would recommend the new software to other researchers or developers for their ongoing work."}, "meta": {"license": "Copyright © 2021 administered by the Association for Computational Linguistics (ACL)\n                                on behalf of ACL content contributors: Yunfang Wu, and other contributors who wish to remain anonymous.\n                                Content is made available under a Creative Commons Attribution 4.0 International Public License.", "author_identity_guess": "1 = I do not have even an educated guess about author identity.", "confidence": "3 =  Pretty sure, but there's a chance I missed something. Although I have a good feel for this area in general, I did not carefully check the paper's details, e.g., the math or experimental design.", "sentences": {"paper_summary": [[0, 217], [217, 391], [391, 459], [459, 506]], "summary_of_strengths": [[0, 207], [207, 211], [211, 415], [415, 580]], "summary_of_weaknesses": [[0, 52], [52, 56], [56, 297], [297, 328], [328, 332], [332, 530]], "comments,_suggestions_and_typos": [[0, 46]]}}}, {"rid": "d9bd95358dcf0881bb6ed180dd79569f265a878838b010134d2c0f3f5a90abed17f92e05a724ede37c041d901a18cb4a8cf5900ace47ae097547abbe69dd776c", "reviewer": null, "report": {"paper_summary": "***This is from Reviewer XYZ of the previous version.*** \nI have read other reviews, author responses, and the new version. I would like to keep my original score. \n---- This paper presents a lightweight method to train a controllable text generation model by learning small prefix vectors on top of a frozen LM such as GPT-2. The parameter-efficient prefix vectors are of the same design as the prefix-tuning paper (Li and Liang 2021), while this paper proposes to focus on using prefixes to steer the LM generation process according to given attributes & aspects, such as sentiment (pos./neg.) and topics (sports/world). The author(s) argue(s) that the proposed method is also the first work to explore multi-aspect control.\nThe prefixes can be learned either without attribute labels (via label variables; similar to the VQ-VAE method) or with attribute labels (via a margin loss). The experiments are conducted over multiple datasets for both single and multiple aspect control for text generation. Perplexity and attribute relevance are used for automatic evaluation; Attribute relevance and linguistic quality are two human-evaluation metrics. The results show the effectiveness of the proposed method, although there are still some limitations (e.g., tending to shift to movie reviews regardless of prompts). ", "summary_of_strengths": "- The proposed method is a natural extension of prefix-tuning Li and Liang (2021), which focuses on parameter-efficiently learning of conditional NLG tasks (e.g., summarization). This paper, instead, focuses on the controllable free-text generation with given attributes.\n- Benefiting from the parameter efficiency of Li and Liang (2021)'s work, the proposed method in this paper can mix multiple aspects for controlling. Also, the inference speed is maintained --- comparable to the original base model GPT-2.\n- The experiments show the effectiveness of the proposed method in most cases, outperforming several baseline methods in automatic evaluation metrics. ", "summary_of_weaknesses": "- The modeling of the mixture of multiple aspects is not explored deeper enough, and thus the so-called \"first to explore\" (in the Introduction) sounds more like an overclaim to me.\n- The qualitative results (Table 5) and human evaluation both show that there are still limitations of the proposed method and the improvement is not so obvious.\n- Given the arguments about the downstream applications (Line 116-117), I would like to see more downstream performance of such controllable text generation models. Think about how you would connect the proposed models to real NLG applications, and show the advantage of your model. I would say style transfer could be a good start. ", "comments,_suggestions_and_typos": "N/A. The authors have addressed most of my previous comments and suggestions. "}, "scores": {"overall": "3 = Good: This paper is of interest to the *ACL audience and could be published, but might not be appropriate for a top-tier publication venue. It would likely be a strong paper in a suitable workshop.", "best_paper": "No", "replicability": "4 = They could mostly reproduce the results, but there may be some variation because of sample variance or minor variations in their interpretation of the protocol or method.", "datasets": "1 = No usable datasets submitted.", "software": "1 = No usable software released."}, "meta": {"license": "Copyright © 2021 administered by the Association for Computational Linguistics (ACL)\n                                on behalf of ACL content contributors: None, and other contributors who wish to remain anonymous.\n                                Content is made available under a Creative Commons Attribution 4.0 International Public License.", "author_identity_guess": "1 = I do not have even an educated guess about author identity.", "confidence": "5 = Positive that my evaluation is correct. I read the paper very carefully and am familiar with related work.", "sentences": {"paper_summary": [[0, 57], [57, 124], [124, 164], [164, 170], [170, 327], [327, 596], [596, 623], [623, 727], [727, 885], [885, 1003], [1003, 1150], [1150, 1316]], "summary_of_strengths": [[0, 179], [179, 272], [272, 422], [422, 511], [511, 662]], "summary_of_weaknesses": [[0, 182], [182, 344], [344, 509], [509, 627], [627, 677]], "comments,_suggestions_and_typos": [[0, 5], [5, 78]]}}}, {"rid": "1aa7fa614cb1a09ab64c839bf6b5dd108114982fa670d578ff519ad94713573af7a859e5884c8519f77fc5b714d66e4c035e91acc4eca2f5809bf761ab834e41", "reviewer": null, "report": {"paper_summary": "This paper propose prefix-based models for controllable text generation. Similar to [1], prefixes are token embeddings of language models (e.g., GPT-2) used for learning attribute-specific information and steering the generation of the fixed language models. The authors further add a contrastive loss to enhance the models' controllability. In addition, an unsupervised learning method is introduced to handle scenarios where labels are not available. The authors evaluated the proposed models on multiple controllable text generation tasks, such as controlling sentiment and topics. The experimental results show that comparing to baselines like PPLM and GeDi, the proposed model can achieve a good balance between fluency and controllability.\n[1] Prefix-tuning: Optimizing continuous prompts for generation. ACL 2021 ", "summary_of_strengths": "- The proposed lightweight model achieved strong performance in multiple controllable text generation tasks.\n- The idea of controlling language models in unsupervised way is interesting and new. ", "summary_of_weaknesses": "- Missing human evaluation for the proposed unsupervised learning method. The major technical contribution (novelty) of the paper is controlling language models in unsupervised manner. Unfortunately, human evaluation is absent (in table 4) to demonstrate its effectiveness.\n- For the multi-aspect controlling experiments, CTRL[1] and PPLM[2] should be good baselines.\n[1] CTRL: A conditional transformer language model for controllable generation.  [2] Plug and play language models: A simple approach to controlled text generation. ICLR 2020 ", "comments,_suggestions_and_typos": "Please consider adding new human evaluation results and baselines as mentioned in weaknesses. ", "ethical_concerns": "Missing the discussion of potential misuses of language model controlling techniques. "}, "scores": {"overall": "2.5 ", "best_paper": "No", "replicability": "3 = They could reproduce the results with some difficulty. The settings of parameters are underspecified or subjectively determined, and/or the training/evaluation data are not widely available.", "datasets": "1 = No usable datasets submitted.", "software": "1 = No usable software released."}, "meta": {"license": "Copyright © 2021 administered by the Association for Computational Linguistics (ACL)\n                                on behalf of ACL content contributors: None, and other contributors who wish to remain anonymous.\n                                Content is made available under a Creative Commons Attribution 4.0 International Public License.", "author_identity_guess": "1 = I do not have even an educated guess about author identity.", "confidence": "4 = Quite sure. I tried to check the important points carefully. It's unlikely, though conceivable, that I missed something that should affect my ratings.", "sentences": {"paper_summary": [[0, 73], [73, 259], [259, 342], [342, 453], [453, 585], [585, 746], [746, 811], [811, 820]], "summary_of_strengths": [[0, 109], [109, 195]], "summary_of_weaknesses": [[0, 74], [74, 185], [185, 274], [274, 368], [368, 448], [448, 449], [449, 533], [533, 543]], "comments,_suggestions_and_typos": [[0, 94]], "ethical_concerns": [[0, 86]]}}}]