[{"rid": "6904cb342e56487e5564c17b554e3459e7c75d0f30b90aa919ce1511bf0ec97d1478bd9d4a1639c0b52fd250bea866abdb1b65e0c71ed8bda0fcac5c3e5d6211", "reviewer": "Ziming Huang", "report": {"paper_summary": "This paper proposes a new Consistency and Robustness Evaluative Test Suite (CARETS) for the VQA task.  This test suite differs from previous work by balancing question generation to create pairs of instances to test models and focusing on six capabilities, rephrasing, ontological, order, visual obfuscation, attribute antonym, and negation.\nThe paper conducts many experiments in some state-of-the-art VQA systems in the proposed dataset to reveal existing major issues. ", "summary_of_strengths": "1. The motivation of this paper is clear and novel, as well as easy to follow.\n2. The new dataset can be very useful for the VQA community and greatly promote progress in this field. ", "summary_of_weaknesses": "1. This paper mainly compares some experimental results of existing models on proposed new data, I would suggest exploring a potential solution based on the proposed new data.\n2. How do the templates generate? ", "comments,_suggestions_and_typos": "Please check some typo before publication: Line435-436: \"their weight initailiza-tions\" -> initailizations Line 613: \"their comprehension of different visuo-linguistic\" -> visual-linguistic "}, "scores": {"overall": "4 = Strong: This paper is of significant interest (for broad or narrow sub-communities), and warrants acceptance in a top-tier *ACL venue if space allows.", "best_paper": "No", "replicability": "4 = They could mostly reproduce the results, but there may be some variation because of sample variance or minor variations in their interpretation of the protocol or method.", "datasets": "1 = No usable datasets submitted.", "software": "1 = No usable software released."}, "meta": {"license": "Copyright © 2021 administered by the Association for Computational Linguistics (ACL)\n                                on behalf of ACL content contributors: Ziming Huang, and other contributors who wish to remain anonymous.\n                                Content is made available under a Creative Commons Attribution 4.0 International Public License.", "author_identity_guess": "1 = I do not have even an educated guess about author identity.", "confidence": "3 =  Pretty sure, but there's a chance I missed something. Although I have a good feel for this area in general, I did not carefully check the paper's details, e.g., the math or experimental design.", "sentences": {"paper_summary": [[0, 102], [102, 342], [342, 472]], "summary_of_strengths": [[0, 3], [3, 79], [79, 82], [82, 183]], "summary_of_weaknesses": [[0, 3], [3, 176], [176, 179], [179, 210]], "comments,_suggestions_and_typos": [[0, 43], [43, 107], [107, 190]]}}}]