[{"rid": "4dd88ab5e2b781c47a44fea8fb474eea99fcc9e899ddc5770953faa4a2fcd1b8126ca5b649a34ca1fe3c1853be6b274a4edcffff0820a080b2af0c0e46e4373b", "reviewer": "Bowei Zou", "report": {"paper_summary": "Since only minor revisions have been made to the paper, my views of the paper have not changed. For details, please see my previous review comments.\nThe author’s response has answered my previous questions very well and added relevant analysis to the revised draft. In my opinion, the analysis of the negative phenomenon on NLU corpora in this paper is comprehensive. But as its contribution is incremental, it is unlikely to be improved through minor modifications. In summary, I think it is a borderline paper of ACL, or as a Findings paper. ", "summary_of_strengths": "How to deal with negation semantic is one of the most fundamental and important issues in NLU, which is especially often ignored by existing models. This paper verifies the significance of the problem on multiple datasets, and in particular, proposes to divide the negations into important and unimportant types and analyzes them (Table 2). The work of the paper is comprehensive and solid. ", "summary_of_weaknesses": "However, I think the innovation of this paper is general. The influence of negation expressions on NLP/NLU tasks has been widely proposed in many specialized studies, as well as in the case/error analysis of many NLP/NLU tasks. In my opinion, this paper is the only integration of these points of view and does not provide deeper insights to inspire audiences in related fields. ", "comments,_suggestions_and_typos": "NA "}, "scores": {"overall": "3 = Good: This paper is of interest to the *ACL audience and could be published, but might not be appropriate for a top-tier publication venue. It would likely be a strong paper in a suitable workshop.", "best_paper": "No", "replicability": "5 = They could easily reproduce the results.", "datasets": "1 = No usable datasets submitted.", "software": "2 = Documentary: The new software will be useful to study or replicate the reported research, although for other purposes it may have limited interest or limited usability. (Still a positive rating)"}, "meta": {"license": "Copyright © 2021 administered by the Association for Computational Linguistics (ACL)\n                                on behalf of ACL content contributors: Bowei Zou, and other contributors who wish to remain anonymous.\n                                Content is made available under a Creative Commons Attribution 4.0 International Public License.", "author_identity_guess": "1 = I do not have even an educated guess about author identity.", "confidence": "5 = Positive that my evaluation is correct. I read the paper very carefully and am familiar with related work.", "sentences": {"paper_summary": [[0, 96], [96, 149], [149, 266], [266, 368], [368, 467], [467, 544]], "summary_of_strengths": [[0, 149], [149, 341], [341, 391]], "summary_of_weaknesses": [[0, 58], [58, 228], [228, 379]], "comments,_suggestions_and_typos": [[0, 3]]}}}, {"rid": "34a654d252d0bb72f0bd405e28bc8a2c52097ce0c2fc0293a544b3bd1929cfc5996e389971dc43791136d5d78b742372f89326f61ab0ae0fdb56d762335f5639", "reviewer": null, "report": {"paper_summary": "The paper analyzes the importance of negation in some natural language understanding tasks. It is highlighted that many of the corpora prepared for these tasks inherently contain fewer instances of negations than general English texts, moreover, a high percentage of these negations seem to be unimportant for NLU. ", "summary_of_strengths": "The main strengths of the paper are the following: It provides a meticulous and linguistically apt analysis of the role of negation in natural language understanding tasks. \nThe results of the analysis are somewhat counterintuitive, which underlines the significance of the research questions (i.e. how negation may affect the efficacy of NLU). \nThe results may have a wide effect in the NLU field (it might influence the architecture of NLU systems). ", "summary_of_weaknesses": "The main weaknesses of the paper are the following: More emphasis should be put on in which cases is negation important.\n****The authors have adequately answered most of the weaknesses mentioned in the previous review.***** ", "comments,_suggestions_and_typos": "****The authors have adequately answered most of the weaknesses mentioned in the previous review.***** "}, "scores": {"overall": "3.5 ", "best_paper": "No", "replicability": "4 = They could mostly reproduce the results, but there may be some variation because of sample variance or minor variations in their interpretation of the protocol or method.", "datasets": "1 = No usable datasets submitted.", "software": "1 = No usable software released."}, "meta": {"license": "Copyright © 2021 administered by the Association for Computational Linguistics (ACL)\n                                on behalf of ACL content contributors: None, and other contributors who wish to remain anonymous.\n                                Content is made available under a Creative Commons Attribution 4.0 International Public License.", "author_identity_guess": "1 = I do not have even an educated guess about author identity.", "confidence": "4 = Quite sure. I tried to check the important points carefully. It's unlikely, though conceivable, that I missed something that should affect my ratings.", "sentences": {"paper_summary": [[0, 92], [92, 315]], "summary_of_strengths": [[0, 51], [51, 173], [173, 345], [345, 452]], "summary_of_weaknesses": [[0, 52], [52, 121], [121, 224]], "comments,_suggestions_and_typos": [[0, 103]]}}}]