[{"rid": "a4fd8920152e81ea4015e5fbd227a306870e7afeb8f2567b1c0035ec89a13f0fffaef9efc8d7ccf5e4452bf1ac3a31645828572098795e9643cf07810c067d1e", "reviewer": null, "report": {"paper_summary": "This paper proposes a new pinyin input method with Chinese GPT. \nTheir method tries to output Chinese characters given perfect pinyin, which consists of both initials and finals, or abbreviated pinyin, which only uses characters' initials. \nAbbreviated pinyin input is user-friendly since the number of typing characters is fewer. Still, it is a more complex problem since the model has to search for the correct output from more candidates than perfect pinyin.\nTheir method uses Chinese GPT and adapts it by concatenating both contexts of Chinese characters and pinyin (PinyinGPT-Concat) or by using the embeddings of characters and pinyin (PinyinGPT-Embed). \nThey also construct a dataset called WD Dataset for evaluating their input methods.\nTheir experiments show that the Chinese GPT given perfect pinyin can output the correct characters even if the model is not fine-tuned for the task and surpasses previous baselines. \nHowever, their analysis shows that the vanilla GPT does not work well with the abbreviated pinyin. \nTheir proposed PinyinGPT-Concat method surpasses the vanilla GPT baseline on abbreviated pinyin settings. ", "summary_of_strengths": "1. They adapt Chinese GPT for the pinyin input method and the results show their method works well compared to the baselines.\n2. They created a new pinyin IME evaluation dataset called WD Dataset and it would be useful for further researches. ", "summary_of_weaknesses": "1. Their experiments compared methods trained with different datasets and different model parameters. It is still difficult to distinguish this model architecture is nice, or the larger dataset/parameters are good.\n2. They only compare the previous method in the prefect pinyin settings though several works on abbreviated pinyin IMEs are mentioned in the related work section. \nIt would be better to add a comparison of these.\n3. I could not fully understand why people want higher pinyin IME accuracy with full use of V100 GPU. It might be possible to run this on the standard laptops in the future, though. ", "comments,_suggestions_and_typos": "l.299, please add the explanation of the abbreviation of \"precision at top-K\"-> \"precision at top-k (P@K)\". ", "ethical_concerns": "No ethical concerns. "}, "scores": {"overall": "2.5 ", "best_paper": "No", "replicability": "4 = They could mostly reproduce the results, but there may be some variation because of sample variance or minor variations in their interpretation of the protocol or method.", "datasets": "3 = Potentially useful: Someone might find the new datasets useful for their work.", "software": "1 = No usable software released."}, "meta": {"license": "Copyright © 2021 administered by the Association for Computational Linguistics (ACL)\n                                on behalf of ACL content contributors: None, and other contributors who wish to remain anonymous.\n                                Content is made available under a Creative Commons Attribution 4.0 International Public License.", "author_identity_guess": "1 = I do not have even an educated guess about author identity.", "confidence": "3 =  Pretty sure, but there's a chance I missed something. Although I have a good feel for this area in general, I did not carefully check the paper's details, e.g., the math or experimental design.", "sentences": {"paper_summary": [[0, 64], [64, 240], [240, 331], [331, 462], [462, 660], [660, 745], [745, 927], [927, 1027], [1027, 1134]], "summary_of_strengths": [[0, 3], [3, 126], [126, 129], [129, 243]], "summary_of_weaknesses": [[0, 3], [3, 102], [102, 215], [215, 218], [218, 378], [378, 428], [428, 431], [431, 530], [530, 610]], "comments,_suggestions_and_typos": [[0, 108]], "ethical_concerns": [[0, 21]]}}}, {"rid": "31ffabcd4514d0e9d752684467f1a8b81ce5a6e875bb8a39ac20fcda680c141881857b67fd91827b7cf658c231d5b66efb01ddbc9505c3e5bd5e6a5db35e82e9", "reviewer": null, "report": {"paper_summary": "This paper explores adapting the Chinese GPT for pinyin input.  Their task settings are that the input of the model includes a sequence of Chinese characters as the context and a sequence of pinyin (perfect pinyin or abbreviated pinyin), and the output is a sequence of Chinese characters. The number and the pronunciation of output characters should be consistent with the input pinyin, and the meaning of output should fit the input context.\nTo adapt the Chinese GPT for pinyin input, they propose two methods. The first one is concatenating pinyin input to the context of  Chinese characters. The second one is adding a pinyin embedding layer at the bottom of GPT. Since the model needs to select the best one from characters pronounced with the same pinyin in the inference stage, they propose pinyin-constrained training.\nFor datasets, they use the common benchmark PD dataset for training and evaluation. They also propose a new WD dataset that contains 15 domains. Their results show that their approach improves the performance of abbreviated pinyin across all domains. They also conducted a series of additional experiments to understand the importance of pinyin context and pinyin constrained training. ", "summary_of_strengths": "This paper is well-written and well-organized; the readers could easily understand their methods and statements. The additional experiments are sufficient, which help the readers understand their method deeply. Moreover, the new evaluating dataset proposed in this paper is also very useful; it enables future work to evaluate their models across several domains. ", "summary_of_weaknesses": "The main weakness is that the novelty of the proposed method is somewhat limited. The pinyin-enhanced pre-trained models and processing the abbreviated pinyin have existed in previous works, and this paper only adapted them on a new pre-trained model. ", "comments,_suggestions_and_typos": "I am not sure why the paper used a probability of 50% to sample a target sequence with less than five words (in line 318). Is that because people tend to input short sequences in real-world situations? If so, it would be better to explain the reasons. "}, "scores": {"overall": "3.5 ", "best_paper": "No", "replicability": "4 = They could mostly reproduce the results, but there may be some variation because of sample variance or minor variations in their interpretation of the protocol or method.", "datasets": "4 = Useful: I would recommend the new datasets to other researchers or developers for their ongoing work.", "software": "1 = No usable software released."}, "meta": {"license": "Copyright © 2021 administered by the Association for Computational Linguistics (ACL)\n                                on behalf of ACL content contributors: None, and other contributors who wish to remain anonymous.\n                                Content is made available under a Creative Commons Attribution 4.0 International Public License.", "author_identity_guess": "1 = I do not have even an educated guess about author identity.", "confidence": "4 = Quite sure. I tried to check the important points carefully. It's unlikely, though conceivable, that I missed something that should affect my ratings.", "sentences": {"paper_summary": [[0, 63], [63, 64], [64, 290], [290, 444], [444, 513], [513, 596], [596, 668], [668, 827], [827, 911], [911, 972], [972, 1078], [1078, 1213]], "summary_of_strengths": [[0, 113], [113, 211], [211, 364]], "summary_of_weaknesses": [[0, 82], [82, 252]], "comments,_suggestions_and_typos": [[0, 123], [123, 202], [202, 252]]}}}, {"rid": "debf5134addd4de011069d05d32a522fece6c708c3e570db0932d7105f7ca093e86d49954d943c97bc4e7c07d49b1ded4588f15d9b58aa4f18deba615b73e631", "reviewer": null, "report": {"paper_summary": "This paper addresses a Chinese pinyin input method. Pinyin represents a pronunciation of a corresponding Chinese character. The Chinese pinyin input method converts an input pinyin sequence into a corresponding Chinese characters. This paper assumes two configurations for inputs. One receives all pinyin representations (perfect pinyin) and the other receives the initial characters of pinyin (abbreviated pinyin). \nThis paper indicates that the GPT model trained on Chinese corpora achieved good performance on the perfect pinyin configuration. In addition, this paper proposes two input strategies of pinyin, and the one is useful in the abbreviation pinyin configuration when the authors fine-tuned GPT parameters with the input strategy. ", "summary_of_strengths": "This paper reported state-of-the-art performance on the Chinese pinyin input method. \nAlthough the technical novelty is limited in my understanding, this paper might have a potential of good paper as a demo paper. ", "summary_of_weaknesses": "In my understanding, this paper doesn't contain any novel findings essentially. \nThis paper reports that a neural language model trained on a large amount of data can achieve better performance when we fine-tune the model on a target task. Recent studies [Peters et al., 18, Devlin et al., 19, Lewis et al., 20] have demonstrated that this pre-trained and fine-tuning strategy is effective in various tasks.\nThis paper applies the method to incorporate pinyin to the standard language modeling task, i.e., next word prediction task. This paper proposed two strategies. One is attaching the pinyin sequence to the input sequence. The other is combining the embeddings of pinyin with the input embeddings of characters. The former is a standard (straightforward) way, and the latter uses the idea in previous studies. For example, in abstractive summarization tasks, previous studies proposed the method which combines additional information such as length embeddings to embeddings of input tokens [Kikuchi et al., 16, Takase et al., 19].\nIn other words, this paper applies the exiting strategies to the Chinese pinyin input method but doesn't contain technical novelty.\nMoreover, this paper addresses the abbreviation pinyin configuration but I doubt this configuration is well justified. \nThis paper should describe whether human can solve this task because the abbreviation pinyin configuration seems too difficult. In addition, this paper should describe the importance of this configuration such as \"how frequent this configuration occurs\".\nPeters et al., 18: Deep Contextualized Word Representations.\nDevlin et al., 19: BERT: Pre-training of Deep Bidirectional Transformers for Language Understanding.\nLewis et al., 20: BART: Denoising Sequence-to-Sequence Pre-training for Natural Language Generation, Translation, and Comprehension.\nKikuchi et al., 16: Controlling Output Length in Neural Encoder-Decoders.\nTakase et al., 19: Positional Encoding to Control Output Sequence Length. ", "comments,_suggestions_and_typos": "The equation (2) is inconsistent with the task definition described in Section 2. \nSection 2 explains that the pinyin sequence starts from n+1 but the equation (2) uses pinyin sequence from 1 to n. To solve this inconsistency, the authors should prepare another variable such as N instead of using n+k in the equation (2). "}, "scores": {"overall": "1.5 ", "best_paper": "No", "replicability": "2 = They would be hard pressed to reproduce the results: The contribution depends on data that are simply not available outside the author's institution or consortium and/or not enough details are provided.", "datasets": "1 = No usable datasets submitted.", "software": "1 = No usable software released."}, "meta": {"license": "Copyright © 2021 administered by the Association for Computational Linguistics (ACL)\n                                on behalf of ACL content contributors: None, and other contributors who wish to remain anonymous.\n                                Content is made available under a Creative Commons Attribution 4.0 International Public License.", "author_identity_guess": "1 = I do not have even an educated guess about author identity.", "confidence": "3 =  Pretty sure, but there's a chance I missed something. Although I have a good feel for this area in general, I did not carefully check the paper's details, e.g., the math or experimental design.", "sentences": {"paper_summary": [[0, 52], [52, 124], [124, 231], [231, 281], [281, 416], [416, 547], [547, 743]], "summary_of_strengths": [[0, 85], [85, 214]], "summary_of_weaknesses": [[0, 80], [80, 240], [240, 408], [408, 533], [533, 569], [569, 629], [629, 718], [718, 816], [816, 1037], [1037, 1169], [1169, 1288], [1288, 1417], [1417, 1544], [1544, 1605], [1605, 1706], [1706, 1839], [1839, 1913], [1913, 1987]], "comments,_suggestions_and_typos": [[0, 82], [82, 323]]}}}]