[{"rid": "68a64013029ef250db764ebc154c1e2f8acc6cb4cacd62f781403688196c59364ca6bfa5f5d66708c48d27c19519bdbaf6833e5d649813d7405518a8917df086", "reviewer": "Nora Hollenstein", "report": {"paper_summary": "This paper analyses whether task-specific transformer models (i.e., fine-tuned BERT models) are successful at brain encoding tasks. The authors compare the performance of encoding models across a wide range of NLP tasks and discuss the differences between encoding fMRI stimuli from reading vs. from listening to stories. They also analyse the results for various language specific brain regions. ", "summary_of_strengths": "The paper provides initials answers to an important open questions the field of brain encoding tasks from language stimuli. \nThe methodology seems appropriate and sound. \nThe paper has a well written introduction that summarizes the current state of the field. The paper clearly distinguished between brain encoding and decoding tasks for clarification. ", "summary_of_weaknesses": "This is a revision of a previously submitted paper. I have read the author response and the new version of the paper. The weaknesses stated in my original review have been addressed and the writing has been improved.\nMy main concern was the reasoning behind the conclusions: It is very tricky to reach clear conclusions between reading and listening from two such different datasets. The differences might be due to the stimulus presentation, but could also arise from countless other factors such as experimental conditions, the text domain of the stimuli or the number of voxels. \nThis is clearly difficult to test due to the limited availability of such datasets, but therefore requires a careful discussion. While this still is a risk to the conclusions that are drawn, it is now described in the discussion. ", "comments,_suggestions_and_typos": "- Please put the equation in section 4.3 on separate lines for better readability - Capitalization of subsection titles is inconsistent. "}, "scores": {"overall": "3.5 ", "best_paper": "No", "datasets": "1 = No usable datasets submitted.", "software": "3 = Potentially useful: Someone might find the new software useful for their work."}, "meta": {"license": "Copyright © 2021 administered by the Association for Computational Linguistics (ACL)\n                                on behalf of ACL content contributors: Nora Hollenstein, and other contributors who wish to remain anonymous.\n                                Content is made available under a Creative Commons Attribution 4.0 International Public License.", "author_identity_guess": "1 = I do not have even an educated guess about author identity.", "confidence": "4 = Quite sure. I tried to check the important points carefully. It's unlikely, though conceivable, that I missed something that should affect my ratings.", "sentences": {"paper_summary": [[0, 132], [132, 322], [322, 397]], "summary_of_strengths": [[0, 124], [124, 170], [170, 261], [261, 354]], "summary_of_weaknesses": [[0, 52], [52, 118], [118, 217], [217, 384], [384, 582], [582, 712], [712, 813]], "comments,_suggestions_and_typos": [[0, 82], [82, 137]]}}}]