[{"rid": "164a2a4bcf38ea9d10889f35373e43faeed96e075c0cfb11ad0e670ee81c3a89728bcf5d695ac8e65b152684176158fd265b9f7dd8f83a1fb4ae13a4160094db", "reviewer": null, "report": {"paper_summary": "This paper studies the research problem of Adversarial Attack on text data. Specifically, it focused on fooling stock prediction models over the Tweet data. It proposes a Hierarchical perturbation to generate attack and formulates the attack generation problem as a combinatorial optimization problem. Experiments are conducted on real world datasets and the results over 3 prediction models are comprehensive. ", "summary_of_strengths": "S1. The research problem is important and useful in real world applications.\nS2. The experiment design is good.\nS3. The results are comprehensive. ", "summary_of_weaknesses": "Technical contribution is not so significant. ", "comments,_suggestions_and_typos": "I am aware that this paper is a re-submission of a paper that I have reviewed before. This time the presentation improves a lot and more details are added as attachment. So I insist on my previous positive rating. "}, "scores": {"overall": "3.5 ", "best_paper": "No", "datasets": "1 = No usable datasets submitted.", "software": "1 = No usable software released."}, "meta": {"license": "Copyright © 2021 administered by the Association for Computational Linguistics (ACL)\n                                on behalf of ACL content contributors: None, and other contributors who wish to remain anonymous.\n                                Content is made available under a Creative Commons Attribution 4.0 International Public License.", "author_identity_guess": "1 = I do not have even an educated guess about author identity.", "confidence": "3 =  Pretty sure, but there's a chance I missed something. Although I have a good feel for this area in general, I did not carefully check the paper's details, e.g., the math or experimental design.", "sentences": {"paper_summary": [[0, 76], [76, 157], [157, 302], [302, 411]], "summary_of_strengths": [[0, 4], [4, 77], [77, 81], [81, 112], [112, 116], [116, 147]], "summary_of_weaknesses": [[0, 46]], "comments,_suggestions_and_typos": [[0, 86], [86, 170], [170, 214]]}}}]