[{"rid": "86821d8c493ffc15ffecc911da6e92cfb9fce61e49e60eebd529f447645b51140aeece5cfd64ac1e54c2605b13e7785f6962d5a7b536d4cbbcfe7562726a8cb9", "reviewer": null, "report": {"paper_summary": "The paper introduces the Pragmatic Rational Speaker framework that allows a speaker to take the listener’s disparities into account when communicating. This framework is designed with a disparity adjustment layer into the working memory of the speaker, which would lead a speaker to adjust their lexical and semantic language while speaking, on top of the long-term memory. Through this, the working memory would be constantly updated to modify the speaker’s language based on the different listeners.  The paper’s authors create a dataset to imitate the two types of disparity, including “vocabulary limitation” and “visual access”. This is then used in experimentation which initially follows the Rational Speech Act (which this paper also extends), and the models are evaluated along the performance (measures the accuracy of the collaborative game), efficiency (measures time used for model training), and transparency (shift in vocabulary that is used in accordance with different speakers). In the end, the authors notice that the framework designed increases the game performance and shifts language to accommodate the listener’s understanding. The paper list several limitations, however, of the study that need future work, including how the generated captions do not entirely and accurately represent the image at hand due to various interactions within the image itself. ", "summary_of_strengths": "The paper is thorough and describes a novel method to understanding the listener’s disparity as the speaker communicates. This is also the first model that proves the shift in semantic and lexical dialogue of the speaker, when other studies do not provide this, and the empirical results clearly show this. The paper introduces both a dataset and collaborative game that allows the models to be tested in a simulated environment. In turn, this will be especially helpful to ACL readers.\nThe Related Work section is also especially helpful and introduces the concepts covered in the paper in an easy-to-follow format. It clearly shows the Rational Speaker Act, the previous work that the paper extends, and introduces why the authors of the paper applied the disparity adjustment layer to the working memory. ", "summary_of_weaknesses": "The methodology used in the paper to test the models is interesting, as the speaker and listener simulation is done in a collaborative game. However, how well does this game model the complexities of real-life communication and the speaker? The authors also list that the image captioning model does not entirely represent the image most accurately, which could bring concerns upon the “transparency” measurement of this simulation. Moreover, speakers adjust their thinking to accommodate listener disparity in many ways, some of which come from incoming people or the environment that they are in (this is acknowledged in the Conclusion and Future Work section). A lack of including this in the simulation may be a cause of concern. ", "comments,_suggestions_and_typos": "Line 122: “is a is a” -> “is a” "}, "scores": {"overall": "3 = Good: This paper is of interest to the *ACL audience and could be published, but might not be appropriate for a top-tier publication venue. It would likely be a strong paper in a suitable workshop.", "best_paper": "No", "replicability": "3 = They could reproduce the results with some difficulty. The settings of parameters are underspecified or subjectively determined, and/or the training/evaluation data are not widely available.", "datasets": "2 = Documentary: The new datasets will be useful to study or replicate the reported research, although for other purposes they may have limited interest or limited usability. (Still a positive rating)", "software": "2 = Documentary: The new software will be useful to study or replicate the reported research, although for other purposes it may have limited interest or limited usability. (Still a positive rating)"}, "meta": {"license": "Copyright © 2021 administered by the Association for Computational Linguistics (ACL)\n                                on behalf of ACL content contributors: None, and other contributors who wish to remain anonymous.\n                                Content is made available under a Creative Commons Attribution 4.0 International Public License.", "author_identity_guess": "1 = I do not have even an educated guess about author identity.", "confidence": "1 = Not my area, or paper is very hard to understand. My evaluation is just an educated guess.", "sentences": {"paper_summary": [[0, 152], [152, 374], [374, 502], [502, 503], [503, 634], [634, 997], [997, 1152], [1152, 1382]], "summary_of_strengths": [[0, 122], [122, 307], [307, 430], [430, 487], [487, 617], [617, 808]], "summary_of_weaknesses": [[0, 141], [141, 241], [241, 433], [433, 664], [664, 734]], "comments,_suggestions_and_typos": [[0, 32]]}}}]