[{"rid": "3ad7968944d1e22977fdf3e4d24a19b5b0552964051f860f0414eb090d0def5b7d6bd878079e78a13e5affb8e8b94720db69d27f77ca82511aa4fc9fd9ff79db", "reviewer": "Mengzhou Xia", "report": {"paper_summary": "The paper introduces a pre-trained vision language model (FewVLM) for prompt-based few-shot vision language tasks such as image captioning and vision question answering. The model is pre-trained with a combined objective of masked language modeling and prefix language modeling. Compared to giant pre-trained vision language models, FewVLM is relatively smaller, but it achieves significantly better zero-shot and few-shot performances, as reported. The authors also conducted a fine-grained analysis understanding the effect of different prompts, data sizes, and pre-training objectives. Their findings include that 1) zero-shot tasks are more sensitive to prompt crafting than few-shot tasks. 2) low-quality prompt also learn fast when increasing data size 3) the masked language modeling objective helps vqa more while the prefix language modeling objective boosts captioning performance. ", "summary_of_strengths": "- The idea is straightforward and the results presented are solid and strong. It shows that with the proper objective for pre-training, the pre-trained models could be more performant on zero-shot and few-shot tasks even when the model size is much smaller than those giant pre-trained vision language models - The analysis is comprehensive and interesting, and some of the conclusions align well with the findings in NLP tasks. For example, prompt crafting is essential for zero-shot prediction, which inspires better prompt searching. ", "summary_of_weaknesses": "- The baselines are not very well explained in the paper, making it hard to understand the difference between the proposed model and the baselines. It would be much better if the authors could add some brief introductions for each baseline model.  - The paper also lacks analysis or an intuitive explanation as to why the proposed model outperforms large pre-trained models like Frozen. The numbers look strong, but the analysis focus on how different factors affect FewVLM instead of why FewVLM outperforms baselines. ", "comments,_suggestions_and_typos": "- I also wonder why some numbers are missing from table 2-5? Is it because these numbers are not reported in the original papers? "}, "scores": {"overall": "3 = Good: This paper is of interest to the *ACL audience and could be published, but might not be appropriate for a top-tier publication venue. It would likely be a strong paper in a suitable workshop.", "best_paper": "No", "replicability": "4 = They could mostly reproduce the results, but there may be some variation because of sample variance or minor variations in their interpretation of the protocol or method.", "datasets": "1 = No usable datasets submitted.", "software": "4 = Useful: I would recommend the new software to other researchers or developers for their ongoing work."}, "meta": {"license": "Copyright © 2021 administered by the Association for Computational Linguistics (ACL)\n                                on behalf of ACL content contributors: Mengzhou Xia, and other contributors who wish to remain anonymous.\n                                Content is made available under a Creative Commons Attribution 4.0 International Public License.", "author_identity_guess": "1 = I do not have even an educated guess about author identity.", "confidence": "3 =  Pretty sure, but there's a chance I missed something. Although I have a good feel for this area in general, I did not carefully check the paper's details, e.g., the math or experimental design.", "sentences": {"paper_summary": [[0, 170], [170, 279], [279, 450], [450, 589], [589, 695], [695, 892]], "summary_of_strengths": [[0, 78], [78, 309], [309, 429], [429, 537]], "summary_of_weaknesses": [[0, 148], [148, 247], [247, 248], [248, 387], [387, 519]], "comments,_suggestions_and_typos": [[0, 61], [61, 130]]}}}, {"rid": "ce8f55e360259259ef79060481821ff273f34459af7816e3fdf94343755e7c1c71d255cf6aaf59122dbe315d17986fbcbff9a6c931c03fb0589383aa04ce3dbf", "reviewer": "Jialu Li", "report": {"paper_summary": "This paper proposes a moderate-sized vision-and-language model for low-resource learning of several vision-and-language tasks. Specifically, the proposed methods includes first pre-training a sequence to sequence transformer based model with prefix language modeling and masked language modeling. Then, the pre-trained model can be adapted to several vision-and-language tasks (e.g., VQAv2) in a zero-shot or few-shot manner with hand-craft prompts. Empirical results show that the proposed methods could achieve comparable results to PICa on VQA tasks. This paper also analyzes the effect of using different hand-craft prompts/noisy prompts for zero-shot/few-shot performance and the effect of two pre-training objectives on different tasks. ", "summary_of_strengths": "1. The proposed method is effective regarding zero-shot and few-shot performance, achieving comparable performance to larger vision-and-language models (i.e., PICa) on VQA tasks. On most tasks, the proposed method gets large improvement compared with VL-T5, which has almost the same architecture (same parameter number). \n2. Analysis shows that different prompt design will affect the zero-shot performance a lot. \n3. Interesting analysis demonstrating the effect of different pre-training objectives on different tasks, suggesting that the zero-shot and few-shot performance on downstream tasks can get better if including similar pre-training objective. ", "summary_of_weaknesses": "1. The few-shot performance is evaluated over 5 randomly sampled different training and dev splits, it's better to also report the performance variance across 5 splits. If the variance is high, it might be better to include an analysis of how to pick training/dev data for few-shot learning / what kind of data will be more helpful for the performance. \n2. The proposed method gets large improvement compared with VL-T5, which has almost the same architecture. I'm also interested in how much of the improvement comes from different pre-training objective and how much of the improvement comes from better hand-craft prompt design (if we consider VL-T5 as using dataset-specific prefixes as hand-craft prompt). ", "comments,_suggestions_and_typos": "Typos: Line 166: \"or significantly improves\", no \"or\"?\nSuggestions: Related paper: Learning to Prompt for Vision-Language Models. Zhou et al. "}, "scores": {"overall": "3.5 ", "best_paper": "No", "replicability": "4 = They could mostly reproduce the results, but there may be some variation because of sample variance or minor variations in their interpretation of the protocol or method.", "datasets": "1 = No usable datasets submitted.", "software": "1 = No usable software released."}, "meta": {"license": "Copyright © 2021 administered by the Association for Computational Linguistics (ACL)\n                                on behalf of ACL content contributors: Jialu Li, and other contributors who wish to remain anonymous.\n                                Content is made available under a Creative Commons Attribution 4.0 International Public License.", "author_identity_guess": "4 = From an allowed pre-existing preprint or workshop paper, I know/can guess at least one author's name.", "confidence": "3 =  Pretty sure, but there's a chance I missed something. Although I have a good feel for this area in general, I did not carefully check the paper's details, e.g., the math or experimental design.", "sentences": {"paper_summary": [[0, 127], [127, 297], [297, 450], [450, 554], [554, 743]], "summary_of_strengths": [[0, 3], [3, 179], [179, 322], [322, 326], [326, 415], [415, 419], [419, 657]], "summary_of_weaknesses": [[0, 3], [3, 169], [169, 353], [353, 357], [357, 461], [461, 711]], "comments,_suggestions_and_typos": [[0, 55], [55, 68], [68, 130], [130, 142]]}}}, {"rid": "0711fd7db80f8adb12c7af75880938904ac072de706cf04edb8ac8cdb1de1745eb8e2645ef188d30158729a4e038ec541d6b64f5d6d670ad595208692660cde9", "reviewer": null, "report": {"paper_summary": "In this paper, the author(s) propose a new method, FewVLM, for learning vision-language tasks using a few examples. FewVLM is pre-trained using a mixture of PrefixLM and MaskLM losses on the MDCOCO and Visual Genome datasets. When adapting to downstream tasks of VQA and Image Captioning, the author(s) study the role of prompts in improving performance in the zero-shot and few-shot settings. Their analyses reveal that zero-shot performance can vary significantly with different prompts, but the performance stabilizes with the availability of a few examples. In their main results, the author(s) show that FewVLM can outperform Frozen and PICa while having far fewer parameters. ", "summary_of_strengths": "- The paper studies an interesting question of low-resource adaptation of vision language models to downstream tasks. This is perhaps one of the first works to explore the role of prompts in vision language models.\n- FewVLM is a (relatively) small scale model that can be run in academic settings and still manages to significantly outperform Frozen that is about one order of magnitude larger. Further, it can achieve results almost on par with PICa which uses GPT-3 as a backbone.\n- Extensive ablation analysis of different prompts and settings in addition to the role of the pre-training objectives. ", "summary_of_weaknesses": "In section 6.3, the author(s) mention that Unified VLP underperforms FewVLM on the captioning task. However, the conjecture mentioned is not clear. Why does the architecture or the pre-training make the model underperform? Particularly when the objective seems well-aligned with the downstream task? ", "comments,_suggestions_and_typos": "line 47: model → model. \nline 275: to the text → to the text as in "}, "scores": {"overall": "4 = Strong: This paper is of significant interest (for broad or narrow sub-communities), and warrants acceptance in a top-tier *ACL venue if space allows.", "best_paper": "No", "replicability": "4 = They could mostly reproduce the results, but there may be some variation because of sample variance or minor variations in their interpretation of the protocol or method.", "datasets": "1 = No usable datasets submitted.", "software": "1 = No usable software released."}, "meta": {"license": "Copyright © 2021 administered by the Association for Computational Linguistics (ACL)\n                                on behalf of ACL content contributors: None, and other contributors who wish to remain anonymous.\n                                Content is made available under a Creative Commons Attribution 4.0 International Public License.", "author_identity_guess": "2 = From social media/a talk/other informal communication, I know/can guess at least one author's name.", "confidence": "4 = Quite sure. I tried to check the important points carefully. It's unlikely, though conceivable, that I missed something that should affect my ratings.", "sentences": {"paper_summary": [[0, 116], [116, 226], [226, 394], [394, 562], [562, 682]], "summary_of_strengths": [[0, 118], [118, 215], [215, 395], [395, 483], [483, 603]], "summary_of_weaknesses": [[0, 100], [100, 148], [148, 223], [223, 300]], "comments,_suggestions_and_typos": [[0, 24], [24, 67]]}}}]