[{"rid": "6695a2d16cadbaadac9a6a13d88ce4c37d0b78386799e141932cd2f36abca22fd324255f8bb1cae45c1f5eb66a945e0fcde3221c9e5cfabbde0339e17e30bebd", "reviewer": "Yilun Zhu", "report": {"paper_summary": "This paper proposes a neural pairwise ranking model to evaluate readability assessment. The model outperforms existing methods on two tasks - cross-corpus ranking and zero shot, cross-lingual ranking - based on ranking metrics. The paper also publish a new bilingual (English-French) readability dataset for cross-lingual evaluation. ", "summary_of_strengths": "1. The pairwise ranking method shows better robustness on various monolingual dataset and out-domain cross-lingual dataset than previous methods. \n2. The paper creates a new cross-lingual dataset for readability assessment. ", "summary_of_weaknesses": "1. The paper does not clearly introduce the dataset. For example, what is average length of each text in NewsEla? If the text is long, the paper should also mention how the text is encoded by BERT when it exceeds the maximum length. \n2. As the paper already pointed out, the nature of pairwise model restricts the inference for downstream applications, so that the contribution of this paper is not very strong. ", "comments,_suggestions_and_typos": "- L400: citation for \"for evaluating ranking or information-retrieval tasks in literature\"?\n- L502: Is NPRM (0.999, 0.995, 0.990, 0.948) better than regBERT (0.999, 0.997, 0.994, 0.977)?\n- L613: \"while\" -> \"\" "}, "scores": {"overall": "3 = Good: This paper is of interest to the *ACL audience and could be published, but might not be appropriate for a top-tier publication venue. It would likely be a strong paper in a suitable workshop.", "best_paper": "No", "replicability": "3 = They could reproduce the results with some difficulty. The settings of parameters are underspecified or subjectively determined, and/or the training/evaluation data are not widely available.", "datasets": "3 = Potentially useful: Someone might find the new datasets useful for their work.", "software": "3 = Potentially useful: Someone might find the new software useful for their work."}, "meta": {"license": "Copyright © 2021 administered by the Association for Computational Linguistics (ACL)\n                                on behalf of ACL content contributors: Yilun Zhu, and other contributors who wish to remain anonymous.\n                                Content is made available under a Creative Commons Attribution 4.0 International Public License.", "author_identity_guess": "1 = I do not have even an educated guess about author identity.", "confidence": "4 = Quite sure. I tried to check the important points carefully. It's unlikely, though conceivable, that I missed something that should affect my ratings.", "sentences": {"paper_summary": [[0, 88], [88, 228], [228, 334]], "summary_of_strengths": [[0, 3], [3, 146], [146, 150], [150, 224]], "summary_of_weaknesses": [[0, 3], [3, 53], [53, 114], [114, 233], [233, 237], [237, 412]], "comments,_suggestions_and_typos": [[0, 92], [92, 187], [187, 209]]}}}, {"rid": "d60ff492ac6bf5bdf7d28a9a93c1bb33a8484c0369070afcc4da9a0a87725aa38a8440a708841aa1603bcaeb528ff9730ffe1fa22f4231e5afbeb10efc8218d4", "reviewer": "Matthew Mulholland", "report": {"paper_summary": "This paper explores the topic of automatic readability assessment, specifically reframing the task as one of pairwise ranking. The authors experiment with neural and other baseline models. ", "summary_of_strengths": "- A number of data-sets are used, some for testing only - Cross-corpus and cross-lingual experiments are done to show generalizability - A number of baseline systems are used, such as traditional classification- and regression-based systems (where possible) for comparison - A data-set is being released along with this work, which may lead to more development opportunities in the future ", "summary_of_weaknesses": "- For the regression-based systems, I see that OLS was used while for the classification-based systems, SVM was used. Why not use SVR for the former? It would seem to be a closer comparison and it might prove to be better baseline against NPRM, etc.\n- For the cross-linguistic analyses, multilingual BERT is used. I would assume French and Spanish are included here, so claiming that this does well cross-linguistically assumes that too, right? ", "comments,_suggestions_and_typos": "- Are \"slugs\" restricted to being only in either test/train for the cross-validation experiments? I'm a little unclear on if this would be necessary or not. It might be good to address whether this is a concern.\n- \"In this background\" - This phrase is used a couple of times and it's unclear what is meant. Consider rephrasing, e.g. \"With this background\", \"Given this background\", etc.\n- 2 Related Work - \"result in\" --> \"results in\" - 4.4 Evaluation - \"w\" --> \"we\"? It's unclear what is meant.\n- Limitations of NPRM - \"while\" --> \"why\" (or just get rid of \"while\") "}, "scores": {"overall": "3.5 ", "best_paper": "No", "replicability": "5 = They could easily reproduce the results.", "datasets": "4 = Useful: I would recommend the new datasets to other researchers or developers for their ongoing work.", "software": "3 = Potentially useful: Someone might find the new software useful for their work."}, "meta": {"license": "Copyright © 2021 administered by the Association for Computational Linguistics (ACL)\n                                on behalf of ACL content contributors: Matthew Mulholland, and other contributors who wish to remain anonymous.\n                                Content is made available under a Creative Commons Attribution 4.0 International Public License.", "author_identity_guess": "1 = I do not have even an educated guess about author identity.", "confidence": "3 =  Pretty sure, but there's a chance I missed something. Although I have a good feel for this area in general, I did not carefully check the paper's details, e.g., the math or experimental design.", "sentences": {"paper_summary": [[0, 127], [127, 189]], "summary_of_strengths": [[0, 56], [56, 135], [135, 273], [273, 389]], "summary_of_weaknesses": [[0, 118], [118, 150], [150, 250], [250, 314], [314, 445]], "comments,_suggestions_and_typos": [[0, 98], [98, 157], [157, 212], [212, 307], [307, 387], [387, 435], [435, 468], [468, 496], [496, 567]]}}}, {"rid": "da389b316edeba40a6455a3d78a9801d6c40eeca422c96cb5ed9da63c8e6d26742ac851d37777d2b9f0ce187f8d6e9ff5457c3444e4fa409188e582e8cf878bb", "reviewer": "Qinlan Shen", "report": {"paper_summary": "This paper proposes to examine the problem of Automatic Readability Assessment (ARA) as a neural pairwise ranking task, with the goal of addressing multiple transferability issues with classification-based ARA.  The paper compares a pairwise neural ranking model with existing non-ranking ARA methods and explores the monolingual and cross-lingual transferability of their ARA ranking model.  From a technical contributions standpoint, the paper mostly provides benchmarking results for ranking vs. other ARA paradigms, rather than a new model. ", "summary_of_strengths": "The paper is thorough in what ARA experiments are run across different paradigms (classification, regression, ranking) and transferability settings (monolingual/cross-lingual transfer).  The paper also provides a well-motivated argument for the benefits of using a ranking-based paradigm for readability assessment, especially for settings involving transfer. ", "summary_of_weaknesses": "The paper lacks significance tests in their comparisons between models, which may draw some of the conclusions in the paper into question.  The results themselves could be presented more clearly with a little more reflection on why certain methods seem to work better than others.  Most of my concerns are covered in more detail in Comments, Suggestions, and Typos. ", "comments,_suggestions_and_typos": "Lines 207-208: Isn't this just mathematically equivalent to taking Binary Cross Entropy loss over the sigmoid?\nLines 225-232: One limitation of the current ranking based approach is that while it's easier to compare across different datasets with potentially different label scales, running comparisons over multiple instances may be less efficient.  For example, if we want to get an idea of the absolute readability for a new document compared to a set of S other documents that have \"already been scored\", we would have to re-run the NPRM over the S documents in your comparison basis.  Have you thought of methods of aggregating or scaling the NPRM score to get around this drawback?  Or are there particular applications you can see where this comparison problem as not being as much of an efficiency issue.\nSection 5.3: One suggestion I had to make things a little easier to follow in this section is to add a table comparing the performance of the best models for each paradigm (classification, regression, pairwise-ranking) on the ranking metrics.  Currently, it's a little hard to follow the written results here because the reader has to check between multiple tables to make the comparison.\nTables 1-6: I would recommend bolding the best performance numbers in these tables.\nResults: Overall, did you run any significance tests when making comparisons between two different models?  Some of the numbers, such as the pairwise ranking evaluations and the comparisons between classification, regression, and ranking on the ranking metrics are quite close.  I would recommend adding a note in the text whenever you make a comparison between two models as to whether the difference in results is significant.\nLine 559-561: Do you think the drop in performance for Vikidia-Fr is because of the domain difference between Newsela and Vikidia? "}, "scores": {"overall": "3 = Good: This paper is of interest to the *ACL audience and could be published, but might not be appropriate for a top-tier publication venue. It would likely be a strong paper in a suitable workshop.", "best_paper": "No", "replicability": "4 = They could mostly reproduce the results, but there may be some variation because of sample variance or minor variations in their interpretation of the protocol or method.", "datasets": "3 = Potentially useful: Someone might find the new datasets useful for their work.", "software": "3 = Potentially useful: Someone might find the new software useful for their work."}, "meta": {"license": "Copyright © 2021 administered by the Association for Computational Linguistics (ACL)\n                                on behalf of ACL content contributors: Qinlan Shen, and other contributors who wish to remain anonymous.\n                                Content is made available under a Creative Commons Attribution 4.0 International Public License.", "author_identity_guess": "1 = I do not have even an educated guess about author identity.", "confidence": "3 =  Pretty sure, but there's a chance I missed something. Although I have a good feel for this area in general, I did not carefully check the paper's details, e.g., the math or experimental design.", "sentences": {"paper_summary": [[0, 211], [211, 392], [392, 545]], "summary_of_strengths": [[0, 186], [186, 360]], "summary_of_weaknesses": [[0, 139], [139, 281], [281, 366]], "comments,_suggestions_and_typos": [[0, 111], [111, 350], [350, 589], [589, 688], [688, 813], [813, 1056], [1056, 1202], [1202, 1286], [1286, 1393], [1393, 1564], [1564, 1715], [1715, 1846]]}}}, {"rid": "0a5b410ba117cc9ddc6bb41d9c83d86e2e1d2a15a2b3a22d69803e9bba81a7bead1f8b59d3c63553e3a69616a6210727e0f5336ef2d2bd6be906a0a79414116b", "reviewer": null, "report": {"paper_summary": "The paper proposes a new pairwise ranking approach for the task of automatic readability assessment (ARA). The proposed approach is compared against other modeling paradigms used in the ARA literature, namely classification and regression across 3 languages (English, French and Spanish). The experiments show that the approach works competitively in monolingual settings and gets strong results in cross-corpus and zero shot cross-lingual settings. The paper also releases a new parallel bilingual ARA dataset for future research. ", "summary_of_strengths": "1. Clear motivation for need of such a technique with cross-corpus compatibility being a realistic desired property for ARA approaches.\n2. Well defined research questions, adequately answered through experiments.  3. Thorough experimentation, spanning 3 languages and different modeling approaches.\n4. New dataset (and the first of its kind) for a relatively understudied task of ARA. ", "summary_of_weaknesses": "1. Not clear if the contribution of the paper are sufficient for a long *ACL paper. By tightening the writing and removing unnecessary details, I suspect the paper will make a nice short paper, but in its current form, the paper lacks sufficient novelty.  2. The writing is difficult to follow in many places and can be simplified. ", "comments,_suggestions_and_typos": "1. Line 360-367 are occupying too much space than needed.  2. It was not clear to me that Vikidia is the new dataset that was introduced by the paper until I read the last section :)   3. Too many metrics used for evaluation. While I commend the paper’s thoroughness by using different metrics for evaluation, I believe in this case the multiple metrics create more confusion than clarity in understanding the results. I recommend using the strictest metric (such as RA) because it will clearly highlight the differences in performance. Also consider marking the best results in each column/row using boldface text.  4. I suspect that other evaluation metrics NDCG, SRRR, KTCC are unable to resolve the differences between NPRM and the baselines in some cases. For e.g., Based on the extremely large values (>0.99) for all approaches in Table 4, I doubt the difference between NPRM’s 0.995 and Glove+SVMRank 0.992 for Avg. SRR on NewsEla-EN is statistically significant.  5. I did not understand the utility of presenting results in Table 2 and Table 3. Why not simplify the presentation by selecting the best regression based and classification based approaches for each evaluation dataset and compare them against NPRM in Table 4 itself?  6. From my understanding, RA is the strictest evaluation metric, and NPRM performs worse on RA when compared to the baselines (Table 4) where simpler approaches fare better.  7. I appreciate the paper foreseeing the limitations of the proposed NPRM approach. However, I find the discussion of the first limitation somewhat incomplete and ending abruptly. The last sentence has the tone of “despite the weaknesses, NPRM is useful'' but it does not flesh out why it’s useful.  8. I found ln616-632 excessively detailed for a conclusion paragraph. Maybe simply state that better metrics are needed for ARA evaluation? Such detailed discussion is better suited for Sec 4.4 9. Why was a classification based model not used for the zero shot experiments in Table 5 and Table 6? These results in my opinion are the strongest aspect of the paper, and should be as thorough as the rest of the results.  10. Line 559: “lower performance on Vikidia-Fr compared to Newsela-Es …” – Why? These are different languages after all, so isn’t the performance difference in-comparable? "}, "scores": {"overall": "3.5 ", "best_paper": "No", "replicability": "4 = They could mostly reproduce the results, but there may be some variation because of sample variance or minor variations in their interpretation of the protocol or method.", "datasets": "2 = Documentary: The new datasets will be useful to study or replicate the reported research, although for other purposes they may have limited interest or limited usability. (Still a positive rating)", "software": "2 = Documentary: The new software will be useful to study or replicate the reported research, although for other purposes it may have limited interest or limited usability. (Still a positive rating)"}, "meta": {"license": "Copyright © 2021 administered by the Association for Computational Linguistics (ACL)\n                                on behalf of ACL content contributors: None, and other contributors who wish to remain anonymous.\n                                Content is made available under a Creative Commons Attribution 4.0 International Public License.", "author_identity_guess": "1 = I do not have even an educated guess about author identity.", "confidence": "3 =  Pretty sure, but there's a chance I missed something. Although I have a good feel for this area in general, I did not carefully check the paper's details, e.g., the math or experimental design.", "sentences": {"paper_summary": [[0, 107], [107, 289], [289, 450], [450, 532]], "summary_of_strengths": [[0, 3], [3, 136], [136, 139], [139, 213], [213, 214], [214, 217], [217, 299], [299, 302], [302, 385]], "summary_of_weaknesses": [[0, 3], [3, 84], [84, 255], [255, 256], [256, 259], [259, 332]], "comments,_suggestions_and_typos": [[0, 3], [3, 58], [58, 59], [59, 62], [62, 185], [185, 188], [188, 226], [226, 419], [419, 537], [537, 616], [616, 617], [617, 620], [620, 761], [761, 923], [923, 971], [971, 972], [972, 975], [975, 1054], [1054, 1240], [1240, 1241], [1241, 1244], [1244, 1415], [1415, 1416], [1416, 1419], [1419, 1500], [1500, 1596], [1596, 1715], [1715, 1716], [1716, 1719], [1719, 1786], [1786, 1856], [1856, 1910], [1910, 1913], [1913, 2013], [2013, 2134], [2134, 2135], [2135, 2139], [2139, 2215], [2215, 2307]]}}}]