[{"rid": "03d50264956d1b95e18b6b73c37ffb71ebeb7a23cd5e397e26f76fa2543da31df5b4b30a00fea5fee7c9e3157c8a52e14e63e37cc1e1640950ebb790676107f3", "reviewer": "Meishan Zhang", "report": {"paper_summary": "The paper is targeted to NER, where named entities are very unbalanced for the task, presenting sentence-level resampling strategies to solve the imbalance problem. This paper is well-motivated, technically sound, and intuitively better than previous token-level methods. The resampling approach can be adapted to different NER model structures. Experimental results show its effectiveness on different models and different domain datasets, especially on small datasets. ", "summary_of_strengths": "1. The proposed method is interesting, and shows improved performance on a wide range of datasets.     2. Experiments are solid, and analysises are comprehensive. ", "summary_of_weaknesses": "1. The improvements are marginal, inparticular the ConLL.    2. The method can be regarded as data reweighting, where the important data point is with large weight.  Thus, the paper should compare with this line of work. ", "comments,_suggestions_and_typos": "1. It seems that the four proposed resampling methods behave differently in different settings.  The paper might be stronger if there exists one method better than the others.       2. Significance test might be needed.      3. See the weakness 2. "}, "scores": {"overall": "3.5 ", "best_paper": "No", "datasets": "1 = No usable datasets submitted.", "software": "3 = Potentially useful: Someone might find the new software useful for their work."}, "meta": {"license": "Copyright © 2021 administered by the Association for Computational Linguistics (ACL)\n                                on behalf of ACL content contributors: Meishan Zhang, and other contributors who wish to remain anonymous.\n                                Content is made available under a Creative Commons Attribution 4.0 International Public License.", "author_identity_guess": "1 = I do not have even an educated guess about author identity.", "confidence": "4 = Quite sure. I tried to check the important points carefully. It's unlikely, though conceivable, that I missed something that should affect my ratings.", "sentences": {"paper_summary": [[0, 165], [165, 272], [272, 346], [346, 471]], "summary_of_strengths": [[0, 3], [3, 99], [99, 106], [106, 163]], "summary_of_weaknesses": [[0, 3], [3, 58], [58, 64], [64, 165], [165, 221]], "comments,_suggestions_and_typos": [[0, 3], [3, 96], [96, 176], [176, 185], [185, 220], [220, 228], [228, 248]]}}}]