[{"rid": "e775acc875915a0dd898817152efd4e5ed6a618e4704a2b66369412f0aed265c8b4648b81b840e2f1b8cc8fb0450634bc4ebdcc423402c718c18b03f38db0d70", "reviewer": null, "report": {"paper_summary": "This paper proposed a method to elicit knowledge from language models and used the generated knowledge to enhance commonsense reasoning tasks’ performance. Specifically, they designed templates for each task they consider and prompted GPT3 to produce relevant knowledge for each question. The generated knowledge is then appended to the question individually and sent to the inference model (T5 11B or its finetuned version). They show that the additional knowledge improves the performance for both zero-shot and finetuned models. ", "summary_of_strengths": "1. The proposed method is simple and straightforward to implement, yet it achieves performance gain compared to several baselines and got SOTA results on 3 tasks. \n2. The analysis showed that the model gets better performance with more knowledge (up to 20) and the improvements on smaller inference models are even larger. The human evaluation also suggests that the generated knowledge correlated well with human judgment in terms of helpfulness. ", "summary_of_weaknesses": "1. Since this paper is proposing a knowledge prompting method, the only real comparison is with self-talk method, however in table 3, only CSQA results are reported (because self-talk templates are only available for CSQA).  Thus advantage over other knowledge prompting methods is less well supported. Also, I think the results of self-talk+UnifiedQA should be included. \n2. Intuitively, I’m not surprised that GPT3 can produce helpful knowledge for these tasks, however it’s unclear whether the proposed method would still be effective when using a smaller LM (as the knowledge source)? ", "comments,_suggestions_and_typos": "It would be great to address the weaknesses above. "}, "scores": {"overall": "3.5 ", "best_paper": "No", "replicability": "5 = They could easily reproduce the results.", "datasets": "1 = No usable datasets submitted.", "software": "3 = Potentially useful: Someone might find the new software useful for their work."}, "meta": {"license": "Copyright © 2021 administered by the Association for Computational Linguistics (ACL)\n                                on behalf of ACL content contributors: None, and other contributors who wish to remain anonymous.\n                                Content is made available under a Creative Commons Attribution 4.0 International Public License.", "author_identity_guess": "4 = From an allowed pre-existing preprint or workshop paper, I know/can guess at least one author's name.", "confidence": "5 = Positive that my evaluation is correct. I read the paper very carefully and am familiar with related work.", "sentences": {"paper_summary": [[0, 156], [156, 289], [289, 426], [426, 532]], "summary_of_strengths": [[0, 3], [3, 163], [163, 167], [167, 323], [323, 448]], "summary_of_weaknesses": [[0, 3], [3, 224], [224, 303], [303, 372], [372, 376], [376, 589]], "comments,_suggestions_and_typos": [[0, 51]]}}}]