[{"rid": "1e1d69c391f257d35080fce1bae332c727b6f405b06665a731904ea571266f56a70259babd6ba6c0d3a063828b866009ecc5a6b20ae3336df51ac207902554fd", "reviewer": null, "report": {"paper_summary": "This paper adopts consistent representation with contrastive learning and knowledge distillation to maintain the stability of the relation mebedding. The resulsts on two dataset prove the effectiveness of the method. ", "summary_of_strengths": "The method of using contrastive learning and knowledge distillation is interesting. There was a slight improvement in the experiment. The method proposed is easy to reproduce. ", "summary_of_weaknesses": "1. Less experimental improvement. The effectiveness of the KL is unclear. \n2. Analyses of experiments are standard but inadequate. ", "comments,_suggestions_and_typos": "1. Can you explained more about the relationship of Memory, Memory Bank, Memory Knowledge and Embedding Knowledge in your paper? \n2. How ia the positive samples of comparative learning constructed in Section 3.6? \n3. There is an error in bold T4 in the lower table of Table1. So the promotion on the TACRED dataset is not consistent. \n4. Why does CRL (w/o KL) sometimes perform better than CRL in Table1? Is knowledge distillation really always effective? \n5. In line490-492, the explanation of why CRL (w/o CR) will degrade performance seems to conflict with the reason why using knowledge differentiation(see line 341-346). \n6. It is suggested that some quantitative analysis can be given, for example, the distance of inter-class. "}, "scores": {"overall": "2.5 ", "best_paper": "No", "replicability": "4 = They could mostly reproduce the results, but there may be some variation because of sample variance or minor variations in their interpretation of the protocol or method.", "datasets": "1 = No usable datasets submitted.", "software": "1 = No usable software released."}, "meta": {"license": "Copyright © 2021 administered by the Association for Computational Linguistics (ACL)\n                                on behalf of ACL content contributors: None, and other contributors who wish to remain anonymous.\n                                Content is made available under a Creative Commons Attribution 4.0 International Public License.", "author_identity_guess": "1 = I do not have even an educated guess about author identity.", "confidence": "3 =  Pretty sure, but there's a chance I missed something. Although I have a good feel for this area in general, I did not carefully check the paper's details, e.g., the math or experimental design.", "sentences": {"paper_summary": [[0, 150], [150, 217]], "summary_of_strengths": [[0, 84], [84, 134], [134, 176]], "summary_of_weaknesses": [[0, 3], [3, 34], [34, 74], [74, 78], [78, 131]], "comments,_suggestions_and_typos": [[0, 3], [3, 129], [129, 133], [133, 213], [213, 217], [217, 276], [276, 334], [334, 338], [338, 405], [405, 456], [456, 460], [460, 626], [626, 630], [630, 734]]}}}]