[{"rid": "d8eba0a50dbf0d510674530ccffd1a8086be10e7ce3a069173ca04bfed6e539caa770621b48054d2d78fe897e61a2da069a2f544860f9272e126f2146e839a97", "reviewer": null, "report": {"paper_summary": "This work proposes to explicitly model sentence-level representations of both the source and target side of unsupervised machine translation. The authors utilize normalizing flows to model the sentence representations in a flexible space as transformed from a (shared between languages) simple base distribution. At translation time the invertibility of normalizing flows can be used to map between sentence representations in different languages. In experiments the authors test the methods' viability on many language pairs and show competitive performance across the board. ", "summary_of_strengths": "- The proposed method seems sound and novel.\n- The authors run extensive experiments on unsupervised machine translation and show moderate improvements across the board. Applying the method on top of XLM seems to result in good improvements over existing techniques, except for MASS.\n- The paper is mostly well-written except for one crucial point mentioned below in the weaknesses. ", "summary_of_weaknesses": "- The unsupervised translation tasks are all quite superficial, taking existing datasets of similar languages (e.g. En-De Multi30k, En-Fr WMT) and editing them to an unsupervised MT corpus.\n- Improvements on Multi30k are quite small (< 1 BLEU) and reported over single runs and measuring BLEU scores alone. It would be good to report averages over multiple runs and report some more modern metrics as well like COMET or BLEURT.\n- It is initially quite unclear from the writing where the sentence-level representations come from. As they are explicitly modeled, they need supervision from somewhere. The constant comparison to latent variable models and calling these sentence representations latent codes does not add to the clarity of the paper. I hope this will be improved in a revision of the paper. ", "comments,_suggestions_and_typos": "Some typos: - 001: \"The latent variables\" -> \"Latent variables\" - 154: \"efficiently to compute\" -> \"efficient to compute\" - 299: \"We denote the encoder and decoder for encoding and generating source-language sentences as the source encoder and decoder\" - unclear - 403: \"langauge\" -> \"language\" "}, "scores": {"overall": "3.5 ", "best_paper": "No", "replicability": "4 = They could mostly reproduce the results, but there may be some variation because of sample variance or minor variations in their interpretation of the protocol or method.", "datasets": "1 = No usable datasets submitted.", "software": "1 = No usable software released."}, "meta": {"license": "Copyright © 2021 administered by the Association for Computational Linguistics (ACL)\n                                on behalf of ACL content contributors: None, and other contributors who wish to remain anonymous.\n                                Content is made available under a Creative Commons Attribution 4.0 International Public License.", "author_identity_guess": "1 = I do not have even an educated guess about author identity.", "confidence": "3 =  Pretty sure, but there's a chance I missed something. Although I have a good feel for this area in general, I did not carefully check the paper's details, e.g., the math or experimental design.", "sentences": {"paper_summary": [[0, 142], [142, 313], [313, 448], [448, 577]], "summary_of_strengths": [[0, 45], [45, 170], [170, 284], [284, 383]], "summary_of_weaknesses": [[0, 190], [190, 307], [307, 428], [428, 529], [529, 599], [599, 747], [747, 804]], "comments,_suggestions_and_typos": [[0, 12], [12, 64], [64, 122], [122, 263], [263, 295]]}}}]