[{"rid": "1576b8dd8d9c8f76255acbcfdd27cf9c945b7563f0ee6a97d4f46e0604057850c9754efe9f2924d190e2723237d36c572baf6e8971f85ed0dfab74289106c835", "reviewer": "Xianchao Wu", "report": {"paper_summary": "This paper proposes a cluster based compact network and a cluster-based pruning strategy for k-nearest-neighbor machine translation for domain adaptation. The proposed methods are able to achieve low latency and keep the BLEU scores of translation accuracies. Experiments on a couple of datasets show the good performance of the methods described in this paper. ", "summary_of_strengths": "Strong: 1. \tNovel cluster-based compact network and pruning strategies for non-parameter domain adaptation in machine translation; 2. \tBetter results of balancing decoding latency and accuracy. ", "summary_of_weaknesses": "Weak: 1. \tMore examples are preferred to understand the motivations, the novel part of the proposed method and the baselines (see “detailed questions and comments”); 2. \tSome higher level comparisons, such as between parametric and non- parametric solutions are preferred. Currently, most baselines are in the same technical line of kNN-MT which is too narrow to reflect the strength of the proposed algorithms/networks. ", "comments,_suggestions_and_typos": "Detailed questions and comments: 1. \tTable 1, what are the hardware used? Model sizes? For “speed comparison”. \n2. \tFigure 1, what are the labels for horizontal and vertical axis? \n3. \tLines 088 to 089, hard to understand why it is “intuitively” since the figure 1 is a 2D description of high-dimension features/distributions, do you have any detailed data/experiments to support this “intuitively”? \n4. \tCan you give real-world examples and attach them to your Figure 2? \n5. \tFigure 3, can you give example real tokens, instead of “token A”, “token B”? it is a bit difficult to understand what are the “negative, positive, pivot” arrows in this figure. \n6. \tLines 170 to 171, “unreliable neighbors” any examples of “unreliable neighbors”? \n7. \tLine 458, is “0.18 BLEU” a significant improvement? Do not understand if it is “impressive result” or not. \n8. \tTable 6 is a bit difficult to understand. Can you first give references of using SP, LTP, HTP, and RP? Also why there are quite limit number of BLEU scores achieved by your “Ours method” higher than others? Can you also give speed/decoding comparison? Since based on this table, I am not sure why we shall rank your method to be higher than the other baselines. There is a big drop of from 46.94 to 46.03 of from “CKMT*” to “CKMT*+Ours”, any detailed analysis of this or any future work plan of this direction? \n9. \tTable 11, why “adaptive kNN-MT” output so many “wrong translations”? how there examples are selected? \n10. \tSection 2 “related work and background” is hard to understand. Intuitively, can you simply give a simple example of the difficulties of cross-domain translation (such as vocabulary difference, grammar difference and technical terms) and show that cluster based methods are helpful for this cross-domain translation. In addition, besides cluster based methods, can you also briefly summarize the major directions of dealing with “domain adaption for NMT”? if there is a comparison of among the major directions (not only other cluster-based methods), this paper will be ranked even higher (e.g., non-parameter solution vs. parameter solution for “domain adaption of MT”). "}, "scores": {"overall": "3 = Good: This paper is of interest to the *ACL audience and could be published, but might not be appropriate for a top-tier publication venue. It would likely be a strong paper in a suitable workshop.", "best_paper": "No", "replicability": "4 = They could mostly reproduce the results, but there may be some variation because of sample variance or minor variations in their interpretation of the protocol or method.", "datasets": "1 = No usable datasets submitted.", "software": "4 = Useful: I would recommend the new software to other researchers or developers for their ongoing work."}, "meta": {"license": "Copyright © 2021 administered by the Association for Computational Linguistics (ACL)\n                                on behalf of ACL content contributors: Xianchao Wu, and other contributors who wish to remain anonymous.\n                                Content is made available under a Creative Commons Attribution 4.0 International Public License.", "author_identity_guess": "1 = I do not have even an educated guess about author identity.", "confidence": "3 =  Pretty sure, but there's a chance I missed something. Although I have a good feel for this area in general, I did not carefully check the paper's details, e.g., the math or experimental design.", "sentences": {"paper_summary": [[0, 155], [155, 260], [260, 362]], "summary_of_strengths": [[0, 11], [11, 134], [134, 194]], "summary_of_weaknesses": [[0, 9], [9, 169], [169, 273], [273, 421]], "comments,_suggestions_and_typos": [[0, 36], [36, 74], [74, 87], [87, 111], [111, 115], [115, 180], [180, 184], [184, 400], [400, 404], [404, 472], [472, 476], [476, 554], [554, 654], [654, 658], [658, 740], [740, 744], [744, 797], [797, 852], [852, 856], [856, 899], [899, 960], [960, 1064], [1064, 1109], [1109, 1219], [1219, 1368], [1368, 1372], [1372, 1442], [1442, 1475], [1475, 1480], [1480, 1544], [1544, 1797], [1797, 1936], [1936, 2152]]}}}, {"rid": "69bb60db767b1f3b654e386328ad7e999ed4c5d859acab874093065396063803040a6b164a1c8184cc3682fc0d3ffa3b3f6860661c61bfd5b9881aaa251e9984", "reviewer": null, "report": {"paper_summary": "This paper propose a more efficient KNN-based MT approach to non-parametric models for machine translation. Instead of learning extra no. of parameters to fine-tune / adapt a model, KNN-based MT learns a smaller meta network without unfreezing the pre-trained base model. The proposed method uses clustering to reduce the features that has to be retrieved through NCE. Further pruning on the reduced dimension of the datastore before the KNN retrieval. ", "summary_of_strengths": "1. It's really great to see the authors put effort into component analysis, e.g. notable mentions: 1a: Table 3, comparing the NCE compression to SVD and PCA (it's an arduous effort to run SVD and PCA on features on MT-tasks size datasets). \n1b. Section 4.4.2. comparing different pruning methods 2. [ Double edge point] It's an incremental improvement to K-NN based MT approach, little novelty but large engineering and execution effort, backed by good experimental design ", "summary_of_weaknesses": "1. [ Double edge point] It's an incremental improvement to K-NN based MT approach, little novelty but large engineering and execution effort, backed by good experimental design. This weakness is a little nitpicking esp when I personally execution (replicable) beats idea (novelty); but if there's no code release is produced after the revision process, then this weakness stands given the next.\n2. Replicability of method is not clear, there's no indication that the code will be released. ", "comments,_suggestions_and_typos": "- I might have missed the specific in the paper; hopefully, I get CKMT = \"Compact-network K-nearest-neighbor MT\" correct. If it is, it'll be good to have the the abbreviation explicit in its full form somewhere in the paper. Otherwise some clarification on the abbreviation would be good. Same for PCKMT = \"Pruned CKMT\", hope I get that right too. "}, "scores": {"overall": "3.5 ", "best_paper": "No", "replicability": "2 = They would be hard pressed to reproduce the results: The contribution depends on data that are simply not available outside the author's institution or consortium and/or not enough details are provided.", "datasets": "1 = No usable datasets submitted.", "software": "3 = Potentially useful: Someone might find the new software useful for their work."}, "meta": {"license": "Copyright © 2021 administered by the Association for Computational Linguistics (ACL)\n                                on behalf of ACL content contributors: None, and other contributors who wish to remain anonymous.\n                                Content is made available under a Creative Commons Attribution 4.0 International Public License.", "author_identity_guess": "1 = I do not have even an educated guess about author identity.", "confidence": "4 = Quite sure. I tried to check the important points carefully. It's unlikely, though conceivable, that I missed something that should affect my ratings.", "sentences": {"paper_summary": [[0, 108], [108, 272], [272, 369], [369, 453]], "summary_of_strengths": [[0, 3], [3, 240], [240, 245], [245, 260], [260, 296], [296, 301], [301, 473]], "summary_of_weaknesses": [[0, 5], [5, 178], [178, 395], [395, 398], [398, 490]], "comments,_suggestions_and_typos": [[0, 122], [122, 225], [225, 289], [289, 348]]}}}]