[{"rid": "c2a349441a32e604b97f48a3fadc9b79306bd9b4da5b287af47e32bf65d87caca2e16816aa69b2181616018360705af16c43b45015161cf006a34d3e489b9145", "reviewer": null, "report": {"paper_summary": "This submission proposed a model for offensive span detection (OSD). Specifically, the authors train GPT-2 in a dual-training setting with reinforcing learning to generate synthetic training data for OSD. ", "summary_of_strengths": "- Good writing and well organized - Interesting topic of offensive span detection ", "summary_of_weaknesses": "- Limited novelty: simple application via utilizing GPT-2 to generate data of a specific domain - Insufficient evaluation:    - only one dataset is used   - lack of detailed dataset statistics   - the comparison is not persuasive ", "comments,_suggestions_and_typos": "Although OSD is an interesting topic, the submission should address the following issues before it can be published: - Only one dataset is used for evaluation, is there anything more?\n- Is it possible to add more evaluations about the synthetic data itself? In the current paper, the comparison is between the whole pipeline and other baselines. Not sure how much performance is made by the data itself, or the training mode itself?\n- Is it possible to generalize the application? For example, from the OSD to general opinion and aspect detection?  - The method needs the manual labels as the start (the BIO labels mentioned in the experiments), is it possible to add more statistics about this label set?\n- The definitions of usefulness and diversity seem quite intuitive. Any motivations to justify this definition, or is there any alternative form of definition? "}, "scores": {"overall": "2 = Borderline: This paper has some merit, but also significant flaws. It does not warrant publication at top-tier venues, but might still be a good pick for workshops.", "best_paper": "No", "replicability": "2 = They would be hard pressed to reproduce the results: The contribution depends on data that are simply not available outside the author's institution or consortium and/or not enough details are provided.", "datasets": "1 = No usable datasets submitted.", "software": "1 = No usable software released."}, "meta": {"license": "Copyright © 2021 administered by the Association for Computational Linguistics (ACL)\n                                on behalf of ACL content contributors: None, and other contributors who wish to remain anonymous.\n                                Content is made available under a Creative Commons Attribution 4.0 International Public License.", "author_identity_guess": "1 = I do not have even an educated guess about author identity.", "confidence": "3 =  Pretty sure, but there's a chance I missed something. Although I have a good feel for this area in general, I did not carefully check the paper's details, e.g., the math or experimental design.", "sentences": {"paper_summary": [[0, 69], [69, 205]], "summary_of_strengths": [[0, 34], [34, 82]], "summary_of_weaknesses": [[0, 96], [96, 230]], "comments,_suggestions_and_typos": [[0, 117], [117, 184], [184, 258], [258, 346], [346, 433], [433, 481], [481, 548], [548, 549], [549, 706], [706, 774], [774, 866]]}}}]