[{"rid": "1b46053fcca8334550cb43d651abb7de45548ed6c394b8e2537e26c0d5f0fda5b398db6a469dd8a8300d9f88279d5bcdf6841f3609fab5d21439e802f393db77", "reviewer": null, "report": {"paper_summary": "In an effort to advance research for question answering and natural language generation on tables, the authors introduce a new dataset HiTab (Hierarchical Tables), a collection of 3,597 complex tables (w/ several levels of headers for either rows or columns) from 25+ domains with manually-derived fine-grained annotations of quantity and entity alignments between the table cells and the natural language text descriptions that accompany the tables (in their original reports). Entity alignments map entities mentioned in text to corresponding row/column headers/subheaders and quantities are mapped to with single-cell quantities or to multiple cell via an operator that should be applied to the multiple cell values (e.g., average, difference, etc.). Moreover, QA pairs are created from these source declarative sentences and are included in the dataset. ", "summary_of_strengths": "- the dataset is compared to similar datasets - in addition to creating the dataset, baseline performance is established using existing models as-is or adapted for the new dataset; along with some error analysis.\n- for Table QA, the means of representing the table's header hierarchy in a logical-form is novel.\n- data and software made available to the research community ", "summary_of_weaknesses": "- while this dataset format/type is not mainstream, it is relevant for Table QA and NLG tasks ", "comments,_suggestions_and_typos": "The paper is well-written. I like the use of the initial example throughout the paper. The order of the Tables/Figures shown in the Appendices is somewhat confusing, having to jump back and forth across pages (although this may be due to their size and latex's automatic layout). Appendix B.3 is not referenced in the main paper.\nPlease revisit the following sentences for readability: line 137, 301, 498, 550 For Table 1, where examples are shown, why is the % not aligned as well for the 1st example (to E3/G3) while is is aligned for the 3rd (where proportion aligns to E3, shouldn't this be G3)? "}, "scores": {"overall": "3.5 ", "best_paper": "No", "replicability": "5 = They could easily reproduce the results.", "datasets": "4 = Useful: I would recommend the new datasets to other researchers or developers for their ongoing work.", "software": "4 = Useful: I would recommend the new software to other researchers or developers for their ongoing work."}, "meta": {"license": "Copyright © 2021 administered by the Association for Computational Linguistics (ACL)\n                                on behalf of ACL content contributors: None, and other contributors who wish to remain anonymous.\n                                Content is made available under a Creative Commons Attribution 4.0 International Public License.", "author_identity_guess": "1 = I do not have even an educated guess about author identity.", "confidence": "4 = Quite sure. I tried to check the important points carefully. It's unlikely, though conceivable, that I missed something that should affect my ratings.", "sentences": {"paper_summary": [[0, 479], [479, 754], [754, 858]], "summary_of_strengths": [[0, 46], [46, 213], [213, 312], [312, 373]], "summary_of_weaknesses": [[0, 94]], "comments,_suggestions_and_typos": [[0, 27], [27, 87], [87, 280], [280, 330], [330, 410], [410, 600]]}}}, {"rid": "bc6b2a09a1aa8ae1b059b4b757d1c9540233d3b49f5a150a2894390df7c14436a0824e05146bda04d5025821b0e00df7181f41219c6912f15b9f641ea5aa097b", "reviewer": null, "report": {"paper_summary": "This paper presents a new dataset namely HiTab with 3,597 hierarchical tables and 10,686 questions. They construct this dataset by collecting a wealth of statistical reports and Wikipedia pages, and then asking human annotators to convert sentence descriptions into question-answer pairs. Nearly all tables in the dataset are hierarchical, with fine-grained annotations of quantity and entity alignment. They evaluate two tasks on this dataset: table QA and natural language generation. They show that complex hierarchical structures increase the difficulty of both table QA and text generation. ", "summary_of_strengths": "In general, I think there are some unique features to make this HiTab dataset valuable to the NLP community, including 1) this is the first dataset that focuses on hierarchical tables, 2) it contains a detailed annotation of entity and quantity alignment for each table-question pair, and 3) instead of crowd-sourcing, HiTab obtain the questions from real sentence descriptions of each table. This avoids annotation artifacts and bias to some extent.  There are some other strengths as follows:  - Good efforts are spent to build this dataset, with 18 annotators and 2400 working hours. Besides the hierarchical tables,  - Automatic Evaluation (Section 2.4) and Human Inspections (Section 2.5) are conducted in the dataset construction process to ensure the data quality.  - The details of dataset construction are well-presented in the paper and the Appendix. The authors also provide a good comparison with existing Table QA datasets.  - The dataset and codes are provided alongside with the paper. I randomly checked some data samples, and they are in high quality. ", "summary_of_weaknesses": "It is still not quite obvious to me what additional challenges are posed by the hierarchical table structure in table QA. Although the authors mentioned three challenges in the introduction, it seems that they are not well-reflected in the experiments. I think Appendix B.4 is a good example to empirically show hierarchical structures indeed increases the difficulty of table QA. I suggest the authors put this part into the main paper, and I expect to see more results and analysis towards this direction to reveal how SOTA QA models fail in facing with complex hierarchical structures. ", "comments,_suggestions_and_typos": "I am not an expert of table QA. But to me, the authors seem to miss a straightforward baseline, that is to firstly flat the table into a text sequence like Figure 7 and then train a text-based QA model on it. For example, we can fine-tune the pretrained QA models like SpanBERT for table QA after flatting the table into a text sequence. In this case, we might be able to learn the hierarchical information through the self-attention mechanism built in Transformers. "}, "scores": {"overall": "4 = Strong: This paper is of significant interest (for broad or narrow sub-communities), and warrants acceptance in a top-tier *ACL venue if space allows.", "best_paper": "No", "replicability": "4 = They could mostly reproduce the results, but there may be some variation because of sample variance or minor variations in their interpretation of the protocol or method.", "datasets": "4 = Useful: I would recommend the new datasets to other researchers or developers for their ongoing work.", "software": "4 = Useful: I would recommend the new software to other researchers or developers for their ongoing work."}, "meta": {"license": "Copyright © 2021 administered by the Association for Computational Linguistics (ACL)\n                                on behalf of ACL content contributors: None, and other contributors who wish to remain anonymous.\n                                Content is made available under a Creative Commons Attribution 4.0 International Public License.", "author_identity_guess": "1 = I do not have even an educated guess about author identity.", "confidence": "3 =  Pretty sure, but there's a chance I missed something. Although I have a good feel for this area in general, I did not carefully check the paper's details, e.g., the math or experimental design.", "sentences": {"paper_summary": [[0, 100], [100, 289], [289, 404], [404, 487], [487, 596]], "summary_of_strengths": [[0, 393], [393, 451], [451, 452], [452, 496], [496, 587], [587, 621], [621, 772], [772, 773], [773, 861], [861, 937], [937, 938], [938, 1001], [1001, 1069]], "summary_of_weaknesses": [[0, 122], [122, 253], [253, 381], [381, 589]], "comments,_suggestions_and_typos": [[0, 32], [32, 209], [209, 338], [338, 467]]}}}]