[{"rid": "7b615d609f85242d0bfcc1c31465512c1392c92758410e60ee31f24a7a307e552ad59858bc5a10774f88d28e1ea4bfd7eafb244a25cd8dc62ee7058ebd7aa9c1", "reviewer": "Sanqiang Zhao", "report": {"paper_summary": "The paper proposes a method to incorporate hierarchical structure information into text summarization tasks. The method encodes hierarchical structure information, such as section titles, sentence positions, and section positions. The method achieves SOTA Rouge performance for three public popular summarization datasets. ", "summary_of_strengths": "The performance of the proposed model achieves SOTA Rouge performance on three public popular summarization datasets. ", "summary_of_weaknesses": "I am concerned about the novelty of the methods. This method simply encodes additional structure information into the Transformer models in a standard way. In this paper, both hierarchical position embedding and section title embedding are borrowed from other papers, so I would say the contribution of this paper is not substantial.\nThe paper has some unclear parts: (1) In the line 232, I think DPE is never defined. \n(2) Segment Embeddings in Figure 1 is not discussed. I believe it is not same to the segment embedding in BERT. \n(3) Regarding section title embedding, I believe section titles are not single vector, how to add it to BOS? ", "comments,_suggestions_and_typos": "Since this is a text generation task and automatic metrics (such as rouge) are not very reliable, I was wondering if you had a human evaluation result? "}, "scores": {"overall": "3 = Good: This paper is of interest to the *ACL audience and could be published, but might not be appropriate for a top-tier publication venue. It would likely be a strong paper in a suitable workshop.", "best_paper": "No", "replicability": "4 = They could mostly reproduce the results, but there may be some variation because of sample variance or minor variations in their interpretation of the protocol or method.", "datasets": "1 = No usable datasets submitted.", "software": "1 = No usable software released."}, "meta": {"license": "Copyright © 2021 administered by the Association for Computational Linguistics (ACL)\n                                on behalf of ACL content contributors: Sanqiang Zhao, and other contributors who wish to remain anonymous.\n                                Content is made available under a Creative Commons Attribution 4.0 International Public License.", "author_identity_guess": "1 = I do not have even an educated guess about author identity.", "confidence": "2 =  Willing to defend my evaluation, but it is fairly likely that I missed some details, didn't understand some central points, or can't be sure about the novelty of the work.", "sentences": {"paper_summary": [[0, 109], [109, 231], [231, 323]], "summary_of_strengths": [[0, 118]], "summary_of_weaknesses": [[0, 49], [49, 156], [156, 334], [334, 419], [419, 473], [473, 532], [532, 642]], "comments,_suggestions_and_typos": [[0, 152]]}}}, {"rid": "d702266401cd2a77c941a20b270c580fe07ebddfacea9118330e1453d987198958ba943d32e8658dc342233045372c3a3db39a964679c0429bb0cc2f1571a74e", "reviewer": null, "report": {"paper_summary": "This paper proposes to incorporate the hierarchical structure of source sentences into the extractive summarization system models. This hierarchy would allow for modeling inter-sentence relationships, which should be captured to improve the final system as the authors claim. Specifically, the authors propose to utilize hierarchical position (HP) and Section title (ST) of sentences to refine the output embeddings based on the inter sentential and sectional information. They run their model on three datasets, namely CNN/DM, arXiv, and Pubmed, showing their system staying competitive (in some cases outperforms model-wise baselines). ", "summary_of_strengths": "While the idea of hierarchical modeling the input documents has a long history (Cohan et al., 2018), this paper has approached the problem with a novel way of utilizing section titles, as well as hierarchical position (HP) information of the sentences. \nThe paper is well-structured and well-written in most parts. \nPromising results are reported when comparing with the baseline without injection of HiStruct information (e.g., longformer-base/large vs. HiStruct+ longformer-base/large and etc.). ", "summary_of_weaknesses": "-Why did the authors decide to experiment with their model on CNN/DM? Hierarchical modeling of documents make sense on long documents such as arXiv and Pubmed. Is there any reason to indicate that it also work on shorter input documents such as CNN/DM…?\n-In the analysis section, BERTSUMEXT has been compared with HiStruct+ (Roberta-base) with the claim that HiStruct+ improves the SOTA. Is it a fair comparison as the BERTSUMEXT and HiStruct+ (Roberta-base) do not use the same LMS. In other words, it is still unclear where the improvements of HiStruct+ (Roberta-base) vs. BERTSUMEXT are coming from? Are they because of the hierarchical info injection, or simply because of Roberta-base LM?\n-The paper does not include the human evaluation process, which is an integral part of the summarization system setup. This gets, especially, higher priority as the results of the HiStruct+ model vs. baselines are close to each other. \n  -While results are promising when comparing HiStruct+ with the reproduced baselines (Table 2), the proposed model still does nor outperform the abstractive SOTA. ", "comments,_suggestions_and_typos": "The methodology section needs re-working and ideas could be better presented. \nSome important information such as the number of extracted oracle sentences should come directly under the experimental setup, not in the Appendix. "}, "scores": {"overall": "3 = Good: This paper is of interest to the *ACL audience and could be published, but might not be appropriate for a top-tier publication venue. It would likely be a strong paper in a suitable workshop.", "best_paper": "No", "replicability": "3 = They could reproduce the results with some difficulty. The settings of parameters are underspecified or subjectively determined, and/or the training/evaluation data are not widely available.", "datasets": "1 = No usable datasets submitted.", "software": "3 = Potentially useful: Someone might find the new software useful for their work."}, "meta": {"license": "Copyright © 2021 administered by the Association for Computational Linguistics (ACL)\n                                on behalf of ACL content contributors: None, and other contributors who wish to remain anonymous.\n                                Content is made available under a Creative Commons Attribution 4.0 International Public License.", "author_identity_guess": "1 = I do not have even an educated guess about author identity.", "confidence": "4 = Quite sure. I tried to check the important points carefully. It's unlikely, though conceivable, that I missed something that should affect my ratings.", "sentences": {"paper_summary": [[0, 131], [131, 276], [276, 473], [473, 638]], "summary_of_strengths": [[0, 253], [253, 315], [315, 498]], "summary_of_weaknesses": [[0, 70], [70, 160], [160, 254], [254, 388], [388, 484], [484, 603], [603, 694], [694, 813], [813, 929], [929, 1094]], "comments,_suggestions_and_typos": [[0, 78], [78, 227]]}}}]