[{"rid": "0eca541313bb789a31f0a7e5967fa597c64bfcada1c25d2e5dec25887158a31aa4c1ed517dd7fc417b521fee28b2bfafc7811c9535ddf25b887cd53958f47afa", "reviewer": null, "report": {"paper_summary": "This work proposes a pipeline for combining existing general knowledge resources with domain specific knowledge extracted from the web via constructed query templates and evaluates the contributions of the domain specific knowledge in two training approaches: a) selecting relevant sentences and b) generated relevant sentences in the context of counseling dialogue applications. ", "summary_of_strengths": "+A well written paper with clear organization, goals, and results +Clear task definition +Reasonable choices for different aspects of the process and justification for each of the pipeline elements.  +Good understanding of models, resources and prior work.\n+A pipeline that can inspire others to replicate and improve. ", "summary_of_weaknesses": "-The chosen evaluation metrics are neither appropriate nor insightful for the task. However, I understand that the authors made the best they could to provide some evaluation based on standard and community accepted metrics and that there are no standard metrics for the task. It is still unsatisfying that a well thought out pipeline has not been convincingly evaluated.\n-The human evaluation helps somewhat but is very limited because it lacks comparisons with other methods.\n-Use of existing resources -- lack of scientific novelty ", "comments,_suggestions_and_typos": "I would strongly advise the authors to provide a discussion/comparison with respect to: https://aclanthology.org/2020.sigdial-1.2.pdf Consider improving the work with a more sophisticated human evaluation on the actual dialogue task. Can you recruit volunteer patients? ", "ethical_concerns": "It is not clear to me if the following paper is not cited and compared with to preserve anonymity (i.e., some authors are the same). \nhttps://aclanthology.org/2020.sigdial-1.2.pdf If not, it's an important omission in related work and comparison of models. If this is the case, I would lower my overall rating. "}, "scores": {"overall": "4 = Strong: This paper is of significant interest (for broad or narrow sub-communities), and warrants acceptance in a top-tier *ACL venue if space allows.", "best_paper": "No", "replicability": "4 = They could mostly reproduce the results, but there may be some variation because of sample variance or minor variations in their interpretation of the protocol or method.", "datasets": "1 = No usable datasets submitted.", "software": "1 = No usable software released."}, "meta": {"license": "Copyright © 2021 administered by the Association for Computational Linguistics (ACL)\n                                on behalf of ACL content contributors: None, and other contributors who wish to remain anonymous.\n                                Content is made available under a Creative Commons Attribution 4.0 International Public License.", "author_identity_guess": "3 = From the contents of the submission itself, I know/can guess at least one author's name.", "confidence": "4 = Quite sure. I tried to check the important points carefully. It's unlikely, though conceivable, that I missed something that should affect my ratings.", "sentences": {"paper_summary": [[0, 380]], "summary_of_strengths": [[0, 66], [66, 89], [89, 199], [199, 200], [200, 257], [257, 319]], "summary_of_weaknesses": [[0, 84], [84, 277], [277, 372], [372, 478], [478, 535]], "comments,_suggestions_and_typos": [[0, 234], [234, 270]], "ethical_concerns": [[0, 133], [133, 257], [257, 311]]}}}, {"rid": "5f9df67495c17db90e7bfcce611efe8b65edcb225b9fb603e5b7e3d30b198f39a36e0c38f66bc04a063129ecdaf2e387b1cb42291be7cf83de659b9fb091736c", "reviewer": null, "report": {"paper_summary": "The paper studies methods for incorporating knowledge in generating reflective listening responses in psychological counseling conversations. The contribution is trifold: a) the authors proposed a counseling knowledge dataset as well as the pipeline to automatically collect it. b) the authors proposed two methods for incorporating knowledge: a retrieval setup based on embedding similarity; a generation setup that completes knowledge triplets with COMET. c) an analysis of the effects of different types of knowledge on generation quality. ", "summary_of_strengths": "- The task proposed is novel. Using generative models for producing reflective listening responses in counseling conversations is a task that is being actively tackled in the psychological counseling domain, and the authors are being innovative in proposing to incorporate common sense and domain knowledge to further improve the quality of generated utterances.\n- The analysis of the importance of different types of commonsense knowledge to the task is interesting. ", "summary_of_weaknesses": "- The core contribution of the work is unclear: this work is a collection of work the authors done around reflective listening: a dataset and the pipeline to collect it; two methods for incorporating knowledge; a series of vastly different experiments. The authors are advised to limit the scope to one of the contributions and elaborate on just that.\n- Each individual contribution is limited in significance:     - The dataset itself is not carefully curated and the highlight instead is the automation of dataset creation process from Google search, which is also a complex collection of several trivial steps itself and is prone to propagated errors. \n    - The two methods proposed are mostly based on pre-existing libraries along with a series of engineering techniques (e.g., turning triplets into sentences using templates, masking out part of the input, combining K-BERT with BART, etc.). No novel architecture tailored to the studied task is being proposed. \n    - The evaluation metrics are not well-motivated thus it is not entirely clear how well do they reflect the usefulness of the proposed techniques. The human evaluation was performed by just 2 annotations with their professional background unspecified. \n    - Again, additional experiments in Section 4.5 is an overly detailed piece of information and is not super relevant to rest of the writing. ", "comments,_suggestions_and_typos": "See weaknesses "}, "scores": {"overall": "2 = Borderline: This paper has some merit, but also significant flaws. It does not warrant publication at top-tier venues, but might still be a good pick for workshops.", "best_paper": "No", "replicability": "2 = They would be hard pressed to reproduce the results: The contribution depends on data that are simply not available outside the author's institution or consortium and/or not enough details are provided.", "datasets": "1 = No usable datasets submitted.", "software": "1 = No usable software released."}, "meta": {"license": "Copyright © 2021 administered by the Association for Computational Linguistics (ACL)\n                                on behalf of ACL content contributors: None, and other contributors who wish to remain anonymous.\n                                Content is made available under a Creative Commons Attribution 4.0 International Public License.", "author_identity_guess": "1 = I do not have even an educated guess about author identity.", "confidence": "3 =  Pretty sure, but there's a chance I missed something. Although I have a good feel for this area in general, I did not carefully check the paper's details, e.g., the math or experimental design.", "sentences": {"paper_summary": [[0, 142], [142, 279], [279, 458], [458, 543]], "summary_of_strengths": [[0, 30], [30, 363], [363, 468]], "summary_of_weaknesses": [[0, 253], [253, 352], [352, 655], [655, 898], [898, 968], [968, 1119], [1119, 1224], [1224, 1369]], "comments,_suggestions_and_typos": [[0, 15]]}}}, {"rid": "7729b516d59a80fdcc230efda3594e7d74199b23fd1c8974e00b689d1986a774d0e91cdc18f67334ff5251574a41be2b1aa7c5c2ab713c5070debaaf89a6617e", "reviewer": null, "report": {"paper_summary": "The authors present an approach for knowledge enhanced counseling reflection generation. It uses dialogue context as well as commonsense and domain knowledge for generating responses in counseling conversations. Two methods for knowledge integration are proposed: a retrieval-based method and a generative method. Experimental results show that both methods for knowledge incorporation improve the system's performance.\nCONTRIBUTIONS: (1) The authors propose a pipeline that collects domain knowledge (medical) through web mining and apply it to build up a counseling knowledge base. \n(2) The authors use the domain knowledge they collected along with commonsense knowledge bases for the task of reflection generation. \n(3) The authors analyze different types of commonsense and domain knowledge, as well as their effect on the generation task. ", "summary_of_strengths": "- Overall, the paper is clear in its objectives and methodology followed. The work is well structured, easy to read and follow.\n- The authors show empirical success of their approach.\n- The overall story is convincing. The proposed approach is tested with reasonable models and appropriate experiments. The experimental results are promising, demonstrating the effectiveness of the proposed method. Thus, the paper makes valuable contributions to the field.\n- The approach is well motivated and addresses a problem that is relevant to the community. ", "summary_of_weaknesses": "- Lack of illustrative examples regarding the model outputs.\n- Some details regarding the knowledge collection process have been omitted (see \"Questions\" below). ", "comments,_suggestions_and_typos": "QUESTIONS: - Fig. 2: Why did you discard the \"anatomy\" category?\n- l. 221: How many query templates did you specify in total?\n- l. 227: What's the size of the set of knowledge candidates?\n- l. 550: Did you calculate the agreement between the annotators? Were the annotators authors of the paper?\nMINOR: - Try to better align the figures with the text.\n- fix punctuation: l. 336, l. 433, l. 445, l. 534 - Table 2: The highlighting of the numbers does not correspond to the caption (\"highest scores are in bold, second highest scores in italic\") "}, "scores": {"overall": "4 = Strong: This paper is of significant interest (for broad or narrow sub-communities), and warrants acceptance in a top-tier *ACL venue if space allows.", "best_paper": "No", "replicability": "4 = They could mostly reproduce the results, but there may be some variation because of sample variance or minor variations in their interpretation of the protocol or method.", "datasets": "3 = Potentially useful: Someone might find the new datasets useful for their work.", "software": "3 = Potentially useful: Someone might find the new software useful for their work."}, "meta": {"license": "Copyright © 2021 administered by the Association for Computational Linguistics (ACL)\n                                on behalf of ACL content contributors: None, and other contributors who wish to remain anonymous.\n                                Content is made available under a Creative Commons Attribution 4.0 International Public License.", "author_identity_guess": "1 = I do not have even an educated guess about author identity.", "confidence": "3 =  Pretty sure, but there's a chance I missed something. Although I have a good feel for this area in general, I did not carefully check the paper's details, e.g., the math or experimental design.", "sentences": {"paper_summary": [[0, 89], [89, 212], [212, 314], [314, 420], [420, 584], [584, 719], [719, 845]], "summary_of_strengths": [[0, 74], [74, 128], [128, 184], [184, 219], [219, 303], [303, 399], [399, 458], [458, 550]], "summary_of_weaknesses": [[0, 61], [61, 162]], "comments,_suggestions_and_typos": [[0, 11], [11, 65], [65, 126], [126, 188], [188, 254], [254, 296], [296, 303], [303, 352], [352, 402], [402, 544]]}}}]