[{"rid": "17895a29154ef932b798525a3fdd7daff03be79bde1e53998bfd0955be1720f0a3151d0ddc1d02683ccd1bdab897ee17ad96bd9cc0f54486f77e05bdcd142729", "reviewer": null, "report": {"paper_summary": "This paper introduces a momentum method in the DR training process to improve the generalization ability of zero-shot dense retrieval via a combination of a document classifier and an adversarially trained encoder. ", "summary_of_strengths": "• a novel  momentum-based adversarial training method for the domain invariant representation. \n    • 10 plus  boost of performance over baselines on public benchmark datasets. ", "summary_of_weaknesses": "It is understandable the authors relate their work to dense retrieval  and adversarial training but it is dubious why not similar applications of momentum are not discussed given that  the authors themselves did not  equal  this proposed method to the latter. ", "comments,_suggestions_and_typos": "No obvious errors of writing is noticed. "}, "scores": {"overall": "4 = Strong: This paper is of significant interest (for broad or narrow sub-communities), and warrants acceptance in a top-tier *ACL venue if space allows.", "best_paper": "No", "replicability": "3 = They could reproduce the results with some difficulty. The settings of parameters are underspecified or subjectively determined, and/or the training/evaluation data are not widely available.", "datasets": "4 = Useful: I would recommend the new datasets to other researchers or developers for their ongoing work.", "software": "1 = No usable software released."}, "meta": {"license": "Copyright © 2021 administered by the Association for Computational Linguistics (ACL)\n                                on behalf of ACL content contributors: None, and other contributors who wish to remain anonymous.\n                                Content is made available under a Creative Commons Attribution 4.0 International Public License.", "author_identity_guess": "4 = From an allowed pre-existing preprint or workshop paper, I know/can guess at least one author's name.", "confidence": "3 =  Pretty sure, but there's a chance I missed something. Although I have a good feel for this area in general, I did not carefully check the paper's details, e.g., the math or experimental design.", "sentences": {"paper_summary": [[0, 215]], "summary_of_strengths": [[0, 95], [95, 177]], "summary_of_weaknesses": [[0, 260]], "comments,_suggestions_and_typos": [[0, 41]]}}}]