[{"rid": "909d810280c389fbd65d9ab5193a36916d1a35e5d47692e9152de3d8527715d28852c525bd8b0383fad6a91ab83691c7a06f221f01a62ff712995ae103c4b842", "reviewer": null, "report": {"paper_summary": "This paper proposes a bidimensional leaderboard, or Billboard, that measures progress both on generation tasks and automatic evaluation of NLG simultaneously. The authors observe that while much progress has been made on automatic evaluation metrics, NLG modeling papers often still report very old metrics like BLEU and ROUGE. The Billboard is an attempt to bring the best practices of the metrics and modeling communities into one place. Generation models submitted to the Billboard would automatically get evaluated on new metrics as they are submitted, and a global ensemble metric (chosen to maximize correlation with human judgments) would also update as metrics are submitted, thus updating the ranking of generation systems. The paper presents Billboards for translation, summarization, and image captioning, as well as initial results on which metrics contribute most to the best ensemble metric.\nThis is an excellent idea and I think could be very impactful for the community. The paper is well-written and thorough, for example conducting a meta-analysis of which human annotations to use when learning the global ensemble metric. I see no significant risks in accepting this paper. ", "summary_of_strengths": "- Great idea to organize generation and metrics into a single joint leaderboard - Has potential to improve community practices, in particular making it easier to use better evaluation metrics when writing generation papers - Insights into which existing metrics today perform best, in terms of correlation with human judgments - Paper is well-written and clear ", "summary_of_weaknesses": "- Less of a weakness, but I do slightly disagree with the authors' focus on instance-level rather than system-level correlation (see below) ", "comments,_suggestions_and_typos": "In Section 2.4, the authors argue that metrics should be ranked in terms of instance-level judgments. While I acknowledge the clear advantages of this, particularly related to sample size, I would encourage the authors to also include system-level scores in the leaderboard. Ultimately, in the other half of the leaderboard, metrics will be used to make system-level comparisons. Even if there is high instance-level correlation, there could be different patterns at the system-level, for example if a metric has a small but consistent bias for or against a particular system's outputs. I wonder if perhaps there is some sort of compromise way to rank metrics that incorporates both instance-level and system-level scores. "}, "scores": {"overall": "4.5 ", "best_paper": "Yes", "datasets": "1 = No usable datasets submitted.", "software": "4 = Useful: I would recommend the new software to other researchers or developers for their ongoing work."}, "meta": {"license": "Copyright © 2021 administered by the Association for Computational Linguistics (ACL)\n                                on behalf of ACL content contributors: None, and other contributors who wish to remain anonymous.\n                                Content is made available under a Creative Commons Attribution 4.0 International Public License.", "author_identity_guess": "1 = I do not have even an educated guess about author identity.", "confidence": "4 = Quite sure. I tried to check the important points carefully. It's unlikely, though conceivable, that I missed something that should affect my ratings.", "sentences": {"paper_summary": [[0, 159], [159, 328], [328, 440], [440, 733], [733, 906], [906, 987], [987, 1142], [1142, 1194]], "summary_of_strengths": [[0, 80], [80, 223], [223, 327], [327, 361]], "summary_of_weaknesses": [[0, 140]], "comments,_suggestions_and_typos": [[0, 102], [102, 275], [275, 380], [380, 587], [587, 723]]}}}, {"rid": "ebfe58b10dee02a1cb830e85ec7993f381fa88e9d1e70ec9eba24417b92fdbe8d20ae561d42fbcbdb17d4380fde7845f5850c3fd769aa20c15003fe18fcdfbf0", "reviewer": "Nora Hollenstein", "report": {"paper_summary": "This paper proposes a leaderboard to join the progress reporting of the two important factors in automatic text generation: the output of generation models and the metrics used to evaluate the output. The authors propose a leaderboard were both model outputs and metrics can be submitted. The strength of submitted metrics is analyzed by their complementarity to human-based metrics. The current version of the leaderboard includes three downstream tasks, including machine translation, summarization and image captioning. Such a multidimensional leaderboard is a good idea especially for tasks such as language generation, where more than one criterion is important to be evaluated. ", "summary_of_strengths": "- Design choices are based on an extensive case study that emphasises the gap between model developers and the use of recently proposed evaluation metrics.\n- New submitted metrics are aligned to human judgements rather than to ROUGE.\n- Reproducibility to previous versions is ensured.\n- The paper takes in account the differences between experts and crowd-workers.\n- The paper is well structured and written clearly. ", "summary_of_weaknesses": "- Number of instances in a test set: Did the authors analyze if this affects the rankings?\n- Section 3: There are no baselines presented for summarisation and image captioning.\n- It does not become clear why automatic metrics tend to overrate machine-generated text? ", "comments,_suggestions_and_typos": "Line 473: missing word - “depending on the downstream task of interest” "}, "scores": {"overall": "4.5 ", "best_paper": "Maybe", "datasets": "4 = Useful: I would recommend the new datasets to other researchers or developers for their ongoing work.", "software": "4 = Useful: I would recommend the new software to other researchers or developers for their ongoing work."}, "meta": {"license": "Copyright © 2021 administered by the Association for Computational Linguistics (ACL)\n                                on behalf of ACL content contributors: Nora Hollenstein, and other contributors who wish to remain anonymous.\n                                Content is made available under a Creative Commons Attribution 4.0 International Public License.", "author_identity_guess": "1 = I do not have even an educated guess about author identity.", "confidence": "2 =  Willing to defend my evaluation, but it is fairly likely that I missed some details, didn't understand some central points, or can't be sure about the novelty of the work.", "sentences": {"paper_summary": [[0, 201], [201, 289], [289, 384], [384, 523], [523, 684]], "summary_of_strengths": [[0, 156], [156, 234], [234, 285], [285, 365], [365, 417]], "summary_of_weaknesses": [[0, 91], [91, 177], [177, 267]], "comments,_suggestions_and_typos": [[0, 72]]}}}]