[{"rid": "20e43a0613cdb728b178bc6ee7a9404d334de1188a7b263b5d2cb14704cd60ad8e52984f1cf1ca942eda7991044795d171860d6de7d69cbc384ebebd6f4f0bf0", "reviewer": null, "report": {"paper_summary": "The paper proposes a neural model computing local coherence on the basis of entities, by constraining the input to noun phrases and proper names. This allows modeling the notion of focus. This approach is presented as more linguistically sound, it outperforms previous models in applications and leads to better explainability. ", "summary_of_strengths": "The paper introduces a new model for computing local coherence that outperforms previous models on three applications. The approach is well-motivated and the authors provide a clear picture of how the paper relates to previous work. The methodology appears sound and is described in detail.  Besides the overall results in the end tasks, through further analyses, the authors show 1) that their method leads to more interpretable explanations about model behavior, and 2) patterns underlying the model's behavior. ", "summary_of_weaknesses": "In the introduction, the authors say that computing coherence on the basis of words or subwords is incorrect from a linguistic perspective and that their approach is more sound. However, they do not directly state why this is the case. One way of achieving this would be, for instance, by commenting on an example, which would also serve as an introduction to the concept of discourse coherence. This would improve the readability of the paper, especially for a reader that is not so familiar with the research area. ", "comments,_suggestions_and_typos": "The font in Figure 1 is very small. "}, "scores": {"overall": "4 = Strong: This paper is of significant interest (for broad or narrow sub-communities), and warrants acceptance in a top-tier *ACL venue if space allows.", "best_paper": "Maybe", "replicability": "4 = They could mostly reproduce the results, but there may be some variation because of sample variance or minor variations in their interpretation of the protocol or method.", "datasets": "1 = No usable datasets submitted.", "software": "4 = Useful: I would recommend the new software to other researchers or developers for their ongoing work."}, "meta": {"license": "Copyright © 2021 administered by the Association for Computational Linguistics (ACL)\n                                on behalf of ACL content contributors: None, and other contributors who wish to remain anonymous.\n                                Content is made available under a Creative Commons Attribution 4.0 International Public License.", "author_identity_guess": "1 = I do not have even an educated guess about author identity.", "confidence": "3 =  Pretty sure, but there's a chance I missed something. Although I have a good feel for this area in general, I did not carefully check the paper's details, e.g., the math or experimental design.", "sentences": {"paper_summary": [[0, 146], [146, 188], [188, 328]], "summary_of_strengths": [[0, 119], [119, 233], [233, 291], [291, 292], [292, 514]], "summary_of_weaknesses": [[0, 178], [178, 236], [236, 396], [396, 517]], "comments,_suggestions_and_typos": [[0, 36]]}}}]