[{"rid": "534dd4d039e9277fd00d16e3f1cdf7b7ce3d9bf240f6b3db32d966ede32db1ff6121fa15bfe1ba49c20bf8fe510e0805c0d4cc63da74ec69523a1bab60678fa0", "reviewer": null, "report": {"paper_summary": "This paper provides a large new dataset written in Hanja, an old Korean language not fully understood yet by modern Korean speakers. This dataset comprises three datasets: AJD, DRS, DRRI (DRRI was proposed in this work). The authors investigate the performance of two pretrained language models (PLMs) based on BERT on this data by first continuing the pretraining of the PLMs and later finetuning them to perform a series of supervised tasks. \nThe authors considered two such models: mBERT and AnchiBERT (pretrained on ancient Chinese data). As for the tasks, the authors propose extracting labels from the dataset structure and realizing supervised learning for king prediction (era prediction), topic classification, NER, and summary retrieval. \nThe paper provides a thoughtful set of experiments evaluating the performance of these models with and without finetuning on Hanja data, including zero-shot experiments on DRRI. Later, the authors also investigate the impact of time and historical events using the best performant model (finetuned AnchiBERT). ", "summary_of_strengths": "- The paper provides a large new dataset for a low-resource language (Hanja) - The paper does an excellent job at using state-of-the-art approaches for investigating linguistic structures of the datasets, including the impact of name entities and document ages on classification - The presentation of the results is simple and yet comprehensive ", "summary_of_weaknesses": "- The paper would be easy to follow with an English-proofreading even though the overall idea is still understandable.\n- The new proposed dataset, DRRI, could have been explored more in the paper.\n- It is not clear how named entities were extracted from the datasets. ", "comments,_suggestions_and_typos": "An English-proofreading would significantly improve the readability of the paper. "}, "scores": {"overall": "3.5 ", "best_paper": "No", "datasets": "4 = Useful: I would recommend the new datasets to other researchers or developers for their ongoing work.", "software": "2 = Documentary: The new software will be useful to study or replicate the reported research, although for other purposes it may have limited interest or limited usability. (Still a positive rating)"}, "meta": {"license": "Copyright © 2021 administered by the Association for Computational Linguistics (ACL)\n                                on behalf of ACL content contributors: None, and other contributors who wish to remain anonymous.\n                                Content is made available under a Creative Commons Attribution 4.0 International Public License.", "author_identity_guess": "1 = I do not have even an educated guess about author identity.", "confidence": "2 =  Willing to defend my evaluation, but it is fairly likely that I missed some details, didn't understand some central points, or can't be sure about the novelty of the work.", "sentences": {"paper_summary": [[0, 133], [133, 221], [221, 444], [444, 543], [543, 748], [748, 927], [927, 1059]], "summary_of_strengths": [[0, 77], [77, 279], [279, 345]], "summary_of_weaknesses": [[0, 119], [119, 197], [197, 268]], "comments,_suggestions_and_typos": [[0, 82]]}}}, {"rid": "1bfcb4def70d12c57ccdb42cca9d080fa5b2a22145f457c877091f8505973ebbba7e8a21d9e666421f4d700c07f226e76f3f8c4788a8a9d72632048b2ade2491", "reviewer": null, "report": {"paper_summary": "This paper presents a 'HUE' dataset and pre-trained Hanja language models, which aim to help to analyze the Korean historical documents written in Hanja, an extinct language based on Chinese characters.\nAs a great amount of the ancient Korean documents were written in Hanja, that is hard to understand now. The author(s) thus provide a  dataset comprising three corpora of records written in Hanja during the Joseon dynasty; four models for four tasks (King prediction, topic classification, named entity recognition, summary retrieval); as well as a language model pretrained on the Hanja documents.\nThey then conduct experiments on HUE corpora with the LM model, taking BERT as the baseline. \nOverall, models pretrained on time-specific specific corpus data achieve the best performance in these four tasks. By providing additional information as input, the extended experiments show further improvement on KP, TC and NER tasks. Finally, a zero-shot experiment is conducted to demonstrate the effectiveness of the models on information extraction from unseen data. ", "summary_of_strengths": "The proposed HUE would be the first resource for the processing and understanding of ancient Korean texts in Hanja. In light of combining with advanced language models, this approach has a lot of potential in computational classical languages and scripts. ", "summary_of_weaknesses": "I understand that Section 6 tries to getting more factors involved in the interpretation of the modal's capability. However, the target theses seem reasonable (to get a quick yes answer) yet require much more pages. They are two of the big questions in digital humanities, and I don't see any convincing arguments/reviews on the extended analysis that contributes. ", "comments,_suggestions_and_typos": "In general, I think this is a great pioneering work and could be fed into a much more interesting resources in the future. \nIt would be better to introduce more about the background for readers who are not familiar with (ancient) Korean. For instance,  why is Hanja an extinct 'language' instead of a 'script'? If ancient Korean only wrote Hanja, why do we call it a 'language'? \nIn addition, Table 4 would need more explanation which might really help classical humanities studies, e.g., why naive AnchiBERT only outperforms others on NER? etc. ", "ethical_concerns": "no ethical concerns in this paper. "}, "scores": {"overall": "4 = This paper represents solid work, and is of significant interest for the (broad or narrow) sub-communities that might build on it.", "best_paper": "No", "datasets": "4 = Useful: I would recommend the new datasets to other researchers or developers for their ongoing work.", "software": "4 = Useful: I would recommend the new software to other researchers or developers for their ongoing work."}, "meta": {"license": "Copyright © 2021 administered by the Association for Computational Linguistics (ACL)\n                                on behalf of ACL content contributors: None, and other contributors who wish to remain anonymous.\n                                Content is made available under a Creative Commons Attribution 4.0 International Public License.", "author_identity_guess": "1 = I do not have even an educated guess about author identity.", "confidence": "2 =  Willing to defend my evaluation, but it is fairly likely that I missed some details, didn't understand some central points, or can't be sure about the novelty of the work.", "sentences": {"paper_summary": [[0, 203], [203, 308], [308, 602], [602, 695], [695, 811], [811, 932], [932, 1068]], "summary_of_strengths": [[0, 116], [116, 256]], "summary_of_weaknesses": [[0, 116], [116, 216], [216, 365]], "comments,_suggestions_and_typos": [[0, 123], [123, 238], [238, 311], [311, 379], [379, 541], [541, 546]], "ethical_concerns": [[0, 35]]}}}]