[{"rid": "9322fb74f7ab53a6795b49fe971a7c7b47f0a6b096390f8d87e46b4d9a732a3f1f6b1afaca5ea79f9ad759a2bfd4902ca96e2b15b7ea27814f3d9ba82f767985", "reviewer": "Mahmoud Mohammadi", "report": {"paper_summary": "The main contribution area of the authors is studying the impact of Trojan tracks on language models internals depicting the following specific contributions: Analyzing the effect of Trojan attacks on attention behaviors of BERT models and highlighting the attention focus drifting effect on Trojaned models. \nProposing a technique to detect the Trojaned BERT models using attention behavior analysis called Attention-based Trojan Detector Preparing and sharing a repository of the Trojaned and clean models with corresponding data and triggers. ", "summary_of_strengths": "Authors have formulated the attention focus drifting ( in page 4) which helps a lot in shaping a mathematical base to understand the attention focus drifting problem they are working on. \nAuthors also have done an organized investigation and framed a methodology for quantifying the effect of attention focus drifting for Trojaned models and classifying different token types. This provides a strong base to build both the Trojaned model detectors and possible defense mechanisms. \nThe analysis (table 2) showing the significance of different attention drifting problems for both Trojaned and clean models provides an meaningful insight on quantification and understating  of the attention drifting behavior. ", "summary_of_weaknesses": "Attention attribution and entropy terms in section 3.2.1 needs a little more context or definition or example. \nDifference between adversarial perturbation and Triggers is not clear in section 4 and why perturbations cannot cause attention focus drifting while can change the classification changes. \nWhy Phrase Candidate Generator and Non-Phrase Candidate Generator are required is not clear. \nSeems the section 3.3 be not very relevant or required to both attention monitor and Trojan perturbation generation on section 4.1. The space can be used to add more clarity and more examples for section 4.1. \nAlso needs more clarity on how the thresholds/ stats detailed in section 3 on quantifying the attention drifting have been utilized in section 4.1 for attention monitor. More examples and references to those attention drifting will provide much stronger utilizing them in shaping the architecture of the attention monitor. \nSection 4.1 as the main section to generate Triggers and Trojan detection needs some examples for clarification or at least in Appendix. \nSection 4.1: It is not clear whether all possible perturbation candidates are used for all clean samples or a subset of perturbations? Applying all neutral words to a full dataset can make the whole pipeline of Figure 6 not feasible, or maybe I missed anything? Or maybe by reaching the beta=15 you will stop searching for each sample? Does any under/overfitting problem can happen for Trojan detection when evaluating the ASR on unseen Trojan perturbation?\nRegarding table 5: Is not clear how the ASR is calculated. For example 96% for IMDB shows that the we had a posinoied/purturbed dataset ( with injected triggers) and trained our model ( to have a Trojaned model and then evaluated that model with another unseen poisoned test dataset and the result is called ASR ( same for clean) ? The percentages are for all data samples, 96% of how many data samples? More clarity is very useful here. \nRegarding Table 6: It is also not clear to what performance the numbers ( acc or auc) refer to? Data samples, Trojaned models? ", "comments,_suggestions_and_typos": "More examples on section 4 in comparison to attention focus formulating efforts done in section 3 will add extra visibility and application to the entire research "}, "scores": {"overall": "3.5 ", "best_paper": "No", "datasets": "4 = Useful: I would recommend the new datasets to other researchers or developers for their ongoing work.", "software": "5 = Enabling: The newly released software should affect other people's choice of research or development projects to undertake."}, "meta": {"license": "Copyright © 2021 administered by the Association for Computational Linguistics (ACL)\n                                on behalf of ACL content contributors: Mahmoud Mohammadi, and other contributors who wish to remain anonymous.\n                                Content is made available under a Creative Commons Attribution 4.0 International Public License.", "author_identity_guess": "1 = I do not have even an educated guess about author identity.", "confidence": "3 =  Pretty sure, but there's a chance I missed something. Although I have a good feel for this area in general, I did not carefully check the paper's details, e.g., the math or experimental design.", "sentences": {"paper_summary": [[0, 309], [309, 546]], "summary_of_strengths": [[0, 187], [187, 377], [377, 481], [481, 709]], "summary_of_weaknesses": [[0, 111], [111, 300], [300, 394], [394, 527], [527, 604], [604, 775], [775, 928], [928, 1066], [1066, 1202], [1202, 1329], [1329, 1403], [1403, 1525], [1525, 1584], [1584, 1857], [1857, 1929], [1929, 1963], [1963, 2060], [2060, 2091]], "comments,_suggestions_and_typos": [[0, 163]]}}}]