[{"rid": "7857e9075c709a7704a6fdd434af951ac67f25b4d13c1b2ce04da7adc5a47e5319f650fc743ce47578cd458503cf3f4f36bc80b61d81ef7058feaf8060b58c32", "reviewer": "Gabriella Lapesa", "report": {"paper_summary": "The paper tackles the known issue of multi-label hierarchical extreme classification, the scenario in which each item can be assigned to multiple classes from a large set of possible classes (in the order of thousands) which are hierarchically structured. The paper surveys existing metrics very thoroughly and then proceeds to define the formal desiderata for metrics designed for the targeted problem and evaluates existing metrics with respect to these properties. A new metric is proposed, ICM, which is based on information content and satisfies all desiderata but one (which is already an improvement with respect to existing metrics. The proposed metric is then evaluated on synthetic data and in a case study from the automatic encoding of discharge reports.  I really like the paper and I think should be accepted. More detailed feedback is nevertheless provided below. ", "summary_of_strengths": "- Very clear and useful survey, accompanied by a formal definition and assessment of the desiderata for a proper evaluation metric - Novel metric proposed - Evaluation on both synthetic data and a real-world case study ", "summary_of_weaknesses": "The case study does not provide very strong evidence for the superiority of ICM with respect to the other measures. A paper like this one, whose  ambition is to make a strong methodological contribution, should have a better coverage of real-world evaluation.  It would be made stronger if the authors could test their metric in one or two further domains, and extend the pool of evaluated classifiers to architecture in which the distribution of labels in the development set also plays a role. ", "comments,_suggestions_and_typos": "While defining the formal desiderata, probably for reasons of space, the authors do not provide enough intuitive description of what the target of the different principles is. I believe that the paper would be made much stronger if the authors would keep the somewhat didactic attitude that characterizes the overview. "}, "scores": {"overall": "4 = Strong: This paper is of significant interest (for broad or narrow sub-communities), and warrants acceptance in a top-tier *ACL venue if space allows.", "best_paper": "No", "replicability": "4 = They could mostly reproduce the results, but there may be some variation because of sample variance or minor variations in their interpretation of the protocol or method.", "datasets": "1 = No usable datasets submitted.", "software": "1 = No usable software released."}, "meta": {"license": "Copyright © 2021 administered by the Association for Computational Linguistics (ACL)\n                                on behalf of ACL content contributors: Gabriella Lapesa, and other contributors who wish to remain anonymous.\n                                Content is made available under a Creative Commons Attribution 4.0 International Public License.", "author_identity_guess": "1 = I do not have even an educated guess about author identity.", "confidence": "3 =  Pretty sure, but there's a chance I missed something. Although I have a good feel for this area in general, I did not carefully check the paper's details, e.g., the math or experimental design.", "sentences": {"paper_summary": [[0, 256], [256, 468], [468, 641], [641, 767], [767, 768], [768, 824], [824, 879]], "summary_of_strengths": [[0, 131], [131, 155], [155, 219]], "summary_of_weaknesses": [[0, 116], [116, 260], [260, 496]], "comments,_suggestions_and_typos": [[0, 176], [176, 319]]}}}, {"rid": "5e3486ca3ce459c4bbfc00392cf8cbdbdff7c2e1533100ecb6dea298e880a3ea6ac1ff9c580cbf727c63835f97f28080a98b6b8f73f760a40fea557bb239f616", "reviewer": null, "report": {"paper_summary": "This paper first stipulates desirable properties for metrics measuring the performance of multi-label classification systems where the label set has a hierarchical structure. Then it introduces the Information Contrast Model (ICM) and compares it with other metrics which are commonly used in the literature to evaluate multi-label classification.  It is argued ICM satisfies more of the desirable properties than others.\nThe paper presents two experiments using synthetic and real-world text classification datasets. The synthetic data experiment results shows ICM distinguished better class assignments from worse assignments robustly for various types of differences. The real-world data experiment shows ICM ranked tested classifiers similar to the existing metrics but penalizes them differently. ", "summary_of_strengths": "1. The paper made explicit desirable properties of an evaluation metric for hierarchical multi-label classification tasks, and analyzed existing and proposed metrics using the concepts. I think it is an important contribution for metric research, which often ends up in a competition for better correlations to another “golden” metric. The formulation can facilitate in-depth discussions based on metric aspects and allow metric users to choose one based on their demands. ", "summary_of_weaknesses": "1. I cannot fully understand the settings for the synthetic data experiments, thus cannot be sure what kind of evidence these experiments provide. \n    * For the “Sensitivity to Error Rate” test, the authors wrote “we randomly remove selected (i, c) assignments” but didn’t explain how they selected. They might mean removing assignments with a probability X but I cannot tell for sure if my understanding is correct from the statement. \n    * For the “Hierarchical Similarity” test, the authors mentioned “single labeled items with leaf categories”, which implies there are items with non-leaf categories. But non-leaf categories never seemed to be assigned when  generating the synthesized datasets. I’m confused. \n    * For the “Item Specificity” test, the authors wrote “For the worst output, we randomly select an item i, and we take one if its assignments (i, c).” The “if” clause looks unfinished and I cannot guess what was, probably unintentionally, dropped.\n2. I cannot see what kind of new values ICM will have practically for selecting and/or designing multi-label classifiers. The real-world data experiment showed ICM’s ranking is aligned with some other existing metrics. It is argued that ICM penalizes some classifiers differently after score normalization. But the normalization seems to depend on absolute scores of compared classifiers thus the penalty statement may not hold when more classifiers are added to comparison. ", "comments,_suggestions_and_typos": "I have nothing to mention here. "}, "scores": {"overall": "2 = Borderline: This paper has some merit, but also significant flaws. It does not warrant publication at top-tier venues, but might still be a good pick for workshops.", "best_paper": "No", "replicability": "2 = They would be hard pressed to reproduce the results: The contribution depends on data that are simply not available outside the author's institution or consortium and/or not enough details are provided.", "datasets": "1 = No usable datasets submitted.", "software": "1 = No usable software released."}, "meta": {"license": "Copyright © 2021 administered by the Association for Computational Linguistics (ACL)\n                                on behalf of ACL content contributors: None, and other contributors who wish to remain anonymous.\n                                Content is made available under a Creative Commons Attribution 4.0 International Public License.", "author_identity_guess": "1 = I do not have even an educated guess about author identity.", "confidence": "4 = Quite sure. I tried to check the important points carefully. It's unlikely, though conceivable, that I missed something that should affect my ratings.", "sentences": {"paper_summary": [[0, 175], [175, 348], [348, 422], [422, 518], [518, 671], [671, 802]], "summary_of_strengths": [[0, 3], [3, 186], [186, 336], [336, 473]], "summary_of_weaknesses": [[0, 3], [3, 147], [147, 301], [301, 437], [437, 607], [607, 702], [702, 716], [716, 871], [871, 968], [968, 971], [971, 1090], [1090, 1187], [1187, 1275], [1275, 1443]], "comments,_suggestions_and_typos": [[0, 32]]}}}]