[{"rid": "0483e42a23383462a9176b05a14c1c4813f4ec64f35f470307774b37e1bb5c1b720cb37e62341f0279aff5fb6104aeb10d479280128a5c1e0251f70ec4c35e28", "reviewer": "Shuyang Cao", "report": {"paper_summary": "This paper studies efficiently processes long input sequences for conditional language generation with Transformer. In addition to local attentions where each token attends to its neighbors within a limited distance, their proposed efficient efficient attention mechanism dynamically constructs global tokens by aggregating representations for input tokens that are divided into even blocks (Transient Global Attention). The global tokens can be attended by all input tokens and thus enable long-range interaction. They adopt the design of T5 for other components of the Transformer and pre-train the model using the gap sentence prediction objective by Pegasus. The resulting model, LongT5, outperforms existing models designed for long sequences on long document summarization with arXiv, PubMed, BigPatent, and MediaSum. On NaturalQuestion and TriviaQA, their largest model also outperforms existing models. Their additional experiments show that increasing the input length and model size usually lead to improved performance. ", "summary_of_strengths": "- Their pre-trained models are helpful for the research community.\n- Their proposed efficient Transformer model (LongT5) performs better than the model with the original attention mechanism (T5) across different input lengths. It also achieves better performance on different datasets than results reported by existing work. ", "summary_of_weaknesses": "While I appreciate their effort in building pre-trained models for long sequences, I do have the following concerns: - The results by other models (Table 2, Table 4 bottom) are taken from the original papers whose experiments might not be conducted under the same computational limit (i.e., GPU/TPU memory). It is likely that the improved performance is due to the authors' better computational resource that allows longer inputs. Also, it is unclear if techniques that can reduce memory usage (e.g., gradient checkpointing) are used by the authors in this paper to reach longer inputs.\n- In Table 4 and Figure 2, due to the lack of T5 models pre-trained with the Gap Sentence Prediction objective, It is unclear the better performance by LongT5 is due to the Transient Global Attention or the Gap Sentence Prediction pre-training objective.\n- There lacks some ablation studies for the Transient Global Attention (e.g., is it necessary to use all global tokens?). ", "comments,_suggestions_and_typos": "- Would be better if the input lengths used by different comparisons are listed. "}, "scores": {"overall": "3 = Good: This paper makes a reasonable contribution, and might be of interest for some (broad or narrow) sub-communities, possibly with minor revisions.", "best_paper": "No", "datasets": "1 = No usable datasets submitted.", "software": "5 = Enabling: The newly released software should affect other people's choice of research or development projects to undertake."}, "meta": {"license": "Copyright © 2021 administered by the Association for Computational Linguistics (ACL)\n                                on behalf of ACL content contributors: Shuyang Cao, and other contributors who wish to remain anonymous.\n                                Content is made available under a Creative Commons Attribution 4.0 International Public License.", "author_identity_guess": "4 = From an allowed pre-existing preprint or workshop paper, I know/can guess at least one author's name.", "confidence": "4 = Quite sure. I tried to check the important points carefully. It's unlikely, though conceivable, that I missed something that should affect my ratings.", "sentences": {"paper_summary": [[0, 116], [116, 421], [421, 515], [515, 663], [663, 824], [824, 911], [911, 1031]], "summary_of_strengths": [[0, 67], [67, 227], [227, 325]], "summary_of_weaknesses": [[0, 117], [117, 308], [308, 431], [431, 587], [587, 842], [842, 964]], "comments,_suggestions_and_typos": [[0, 81]]}}}]