[{"rid": "e720868dc986e40c40c00c14a79ca6e977bc7e1c7db9423bbcd27f2331be3b2283e9c420beabf11b1bfc7f1a46b9b5503698216903c307f81e40a9b579b728a4", "reviewer": null, "report": {"paper_summary": "This paper proposes to use the synonyms of the ICD codes to enrich the code representations. A multiple synonyms matching network (MSMN) is proposed to encode multiple synonyms and improve the task of automatic ICD coding. Experimental results show that the proposed method improves the performance over the baseline methods, especially when evaluated using AUC.  The idea of using synonyms of the ICD codes is simple and effective. The paper is well-written and concise. The experimental results show promising improvement over previous work. I like that the authors include discussion of varying m and different scoring functions in the paper to make it more complete. Overall, I think this paper introduces a simple but effective method to improve automatic ICD coding and conducts experiments to verify its effectiveness. I think the material presented is well-suited for a short paper. ", "summary_of_strengths": "- The idea of using synonyms of the ICD codes is simple.\n- The paper is well-written and concise.\n- The experimental results show promising improvement over previous work. ", "summary_of_weaknesses": "I have some questions regarding the results, see Questions below ", "comments,_suggestions_and_typos": "- The proposed method obtains larger gains on the top-50 setting. My intuition was that the top codes would be benefited less since we have enough training data for those codes. Why do you think this happens?\n- For the full setting, AUC and precision improved a lot, but not F1. Do you have any observation or explanation for this? "}, "scores": {"overall": "4 = Strong: This paper is of significant interest (for broad or narrow sub-communities), and warrants acceptance in a top-tier *ACL venue if space allows.", "best_paper": "No", "replicability": "5 = They could easily reproduce the results.", "datasets": "1 = No usable datasets submitted.", "software": "2 = Documentary: The new software will be useful to study or replicate the reported research, although for other purposes it may have limited interest or limited usability. (Still a positive rating)"}, "meta": {"license": "Copyright © 2021 administered by the Association for Computational Linguistics (ACL)\n                                on behalf of ACL content contributors: None, and other contributors who wish to remain anonymous.\n                                Content is made available under a Creative Commons Attribution 4.0 International Public License.", "author_identity_guess": "1 = I do not have even an educated guess about author identity.", "confidence": "3 =  Pretty sure, but there's a chance I missed something. Although I have a good feel for this area in general, I did not carefully check the paper's details, e.g., the math or experimental design.", "sentences": {"paper_summary": [[0, 93], [93, 223], [223, 363], [363, 364], [364, 433], [433, 472], [472, 544], [544, 671], [671, 826], [826, 891]], "summary_of_strengths": [[0, 57], [57, 98], [98, 172]], "summary_of_weaknesses": [[0, 65]], "comments,_suggestions_and_typos": [[0, 66], [66, 178], [178, 209], [209, 279], [279, 332]]}}}, {"rid": "d81677a8c643c5a3ddf00a01bdde9732dd9e033dc0d590d5c0ba2820905b94928bddda79dbbfb81802b7773039b24e94cb1bea7620a4fd84ec56f448a720731d", "reviewer": null, "report": {"paper_summary": "This paper addresses a text classification task: assigning ICD-9-CM codes to a clinical text.  This is a difficult task because only short spans of the input text are relevant to a given target code, hence the use of attention mechanisms in recent work.  In the present work, multiple synonyms are used in the attention mechanism in order to attend to all descriptions of a code.  Furthermore, a biaffine transformation is learnt to help compare synonym representations to the representation of the input text for a given code. \nThat combination of using multiple synonyms in the attention mechanism and a biaffine transformation in the architecture is novel to the best of my knowledge.  On the MIMIC-III ICD9 coding dataset (full and top-50 codes), both sub-methods are shown to improve results over using a single term per code or learning independent code representations as in previous work. \nThe paper finally explores the space of synonym representations. ", "summary_of_strengths": "- The introduction of multiple synonyms and of the biaffine transformation in the architecture is motivated.\n- Each are shown to bring improvements.\n- Improves over previous state of the art, represented by five published systems.\n- Short exploration of the resulting synonym representation space. ", "summary_of_weaknesses": "- Experiments are performed only once, with no test of multiple random seeds.  Performing experiments N times and reporting mean and standard deviation is good practice.\n- Tests should be performed to check whether the observed differences are significant. ", "comments,_suggestions_and_typos": "- The basic principle of using multiple synonyms of ICD terms is quite common in earlier work: using the presence of ICD in the UMLS makes it straightforward to obtain more terms for the same ICD code, and terms can then be used to help concept extraction and normalization from text.  In a way, it is therefore surprising that recent work using deep learning methods does not use this simple resource. \n  - Note that in the related task of entity linking, for instance BioSyn (Sung et al., ACL 2020) uses multiple synonyms for each concept.\n- How did you sample the synonyms when not all of them are selected: fully randomly? \n  - what if less synonyms are available than the required number $m$?  Does this happen in the performed experiments?\n- More synonyms probably increase the memory and time requirements: can you say more about the complexity of the method relative to the number of synonyms?\n- \"Deep learning methods usually treat this task as a multi-label classification problem\": this is the case more generally of supervised machine learning methods, and is not specific to deep learning methods.\n- \"A d-layer bi-directional LSTM layer with output size h /is followed by/ word embeddings to obtain text hidden representations H.\" -> I assume that the LSTM takes word embeddings as input instead?\n- \"We notice that the macro F1 has large variance in MIMIC-III full setting\": please explain what you mean by variance here.  This does not seem to be visible in Table 1.\n@inproceedings{Sung:ACL2020,     title = \"Biomedical Entity Representations with Synonym Marginalization\",     author = \"Sung, Mujeen  and       Jeon, Hwisang  and       Lee, Jinhyuk  and       Kang, Jaewoo\",     booktitle = \"Proceedings of the 58th Annual Meeting of the Association for Computational Linguistics\",     month = jul,     year = 2020,     address = \"Online\",     publisher = \"Association for Computational Linguistics\",     url = \"https://aclanthology.org/2020.acl-main.335\",     doi = \"10.18653/v1/2020.acl-main.335\",     pages = \"3641--3650\" } "}, "scores": {"overall": "3.5 ", "best_paper": "No", "replicability": "4 = They could mostly reproduce the results, but there may be some variation because of sample variance or minor variations in their interpretation of the protocol or method.", "datasets": "1 = No usable datasets submitted.", "software": "3 = Potentially useful: Someone might find the new software useful for their work."}, "meta": {"license": "Copyright © 2021 administered by the Association for Computational Linguistics (ACL)\n                                on behalf of ACL content contributors: None, and other contributors who wish to remain anonymous.\n                                Content is made available under a Creative Commons Attribution 4.0 International Public License.", "author_identity_guess": "1 = I do not have even an educated guess about author identity.", "confidence": "3 =  Pretty sure, but there's a chance I missed something. Although I have a good feel for this area in general, I did not carefully check the paper's details, e.g., the math or experimental design.", "sentences": {"paper_summary": [[0, 94], [94, 254], [254, 380], [380, 528], [528, 688], [688, 897], [897, 963]], "summary_of_strengths": [[0, 109], [109, 149], [149, 231], [231, 298]], "summary_of_weaknesses": [[0, 78], [78, 170], [170, 257]], "comments,_suggestions_and_typos": [[0, 285], [285, 403], [403, 542], [542, 627], [627, 698], [698, 746], [746, 902], [902, 1111], [1111, 1310], [1310, 1435], [1435, 1481], [1481, 2042]]}}}]