[{"rid": "ae97f0c9dfb463df7f69b60b7297495113e32a1370beee6732301d7e4d2885d67032ee6207ac850d25d471747b5c24e08c534f35ddd572f7c03cd453803a3517", "reviewer": null, "report": {"paper_summary": "This paper works on personalized language modeling in case that there is limited data for the target user (i.e. a new user). The authors propose that leveraging the data from similar users extracted from the corpus to enhance the personalized language modeling for a new user. They first introduce three methods to calculate the similarity between a target user and the selected anchor users, and then either leverage the data of similar anchor users to fine-tune the language model or interpolate the anchor user models based on the similarity. The experiments show that their methods can improve the perplexity and accuracy, and more analysis explores the trade-off between the amount of available data from similar users. ", "summary_of_strengths": "1. The paper explores an interesting topic of personalized language modeling. \n2. The proposed methods are easy to implement. ", "summary_of_weaknesses": "The overall writing is poor. The whole paper lacks logic when organizing their content and is poorly structured, making it difficult to read, especially when they describe their experimental results. It is hard to learn something useful because of the writing. ", "comments,_suggestions_and_typos": "Suggestions: 1. Add more figures to clarify the ideas. \n2. Leave the training details (like how many hours it takes to train) in a single section like \"implementation details\". \n3. Organize the results in a more reasonable way, e.g., highlight what we can learn from each result. "}, "scores": {"overall": "2.5 ", "best_paper": "No", "replicability": "3 = They could reproduce the results with some difficulty. The settings of parameters are underspecified or subjectively determined, and/or the training/evaluation data are not widely available.", "datasets": "1 = No usable datasets submitted.", "software": "1 = No usable software released."}, "meta": {"license": "Copyright © 2021 administered by the Association for Computational Linguistics (ACL)\n                                on behalf of ACL content contributors: None, and other contributors who wish to remain anonymous.\n                                Content is made available under a Creative Commons Attribution 4.0 International Public License.", "author_identity_guess": "1 = I do not have even an educated guess about author identity.", "confidence": "4 = Quite sure. I tried to check the important points carefully. It's unlikely, though conceivable, that I missed something that should affect my ratings.", "sentences": {"paper_summary": [[0, 125], [125, 277], [277, 546], [546, 725]], "summary_of_strengths": [[0, 3], [3, 78], [78, 82], [82, 126]], "summary_of_weaknesses": [[0, 29], [29, 200], [200, 261]], "comments,_suggestions_and_typos": [[0, 16], [16, 55], [55, 59], [59, 177], [177, 181], [181, 280]]}}}]