[{"rid": "3c700b87b28663e2240f3c1c35d19f41294f37cc002b8029603ef4f54d9d968c949cb010838cddcb298ea403508341a8703094385f49d73d8ff0a789c613ac86", "reviewer": "Zi Lin", "report": {"paper_summary": "In biaffine graph-based architecture for semantic dependency parsing, arcs are predicted independently from each other. This paper proposed auxiliary tasks that introduce some form of interdependence of arc decisions. The experimental results on English and French show that training recurrent word-token representations both for the SDP tasks and auxiliary tasks are systematically beneficial. ", "summary_of_strengths": "- The motivation of adding the auxiliary tasks is clear to me.\n- Most part of the paper is easy to follow. ", "summary_of_weaknesses": "- It seems that how to choose the set of auxiliary tasks for French and English are based on empirical results. An analysis section is highly recommended to validate why some set of auxiliary can work better than others.\n- It take some while for me to understand the auxiliary tasks, so I suggest adding a SDP graph examples and have the description of auxiliary tasks based on the example.\n- If the results of FG and HC are not fully comparable to the proposed methods, comparing the numbers in table 3 is not that informative. It is hard for me to conclude that the proposed methods is strong enough to compete with others. I suggest doing the experiment in the same settings as FG and HC, or using the proposed auxiliary tasks with their system and show the difference in section 4.4. ", "comments,_suggestions_and_typos": "Please see summary of weaknesses. "}, "scores": {"overall": "3 = Good: This paper is of interest to the *ACL audience and could be published, but might not be appropriate for a top-tier publication venue. It would likely be a strong paper in a suitable workshop.", "best_paper": "No", "replicability": "5 = They could easily reproduce the results.", "datasets": "1 = No usable datasets submitted.", "software": "1 = No usable software released."}, "meta": {"license": "Copyright © 2021 administered by the Association for Computational Linguistics (ACL)\n                                on behalf of ACL content contributors: Zi Lin, and other contributors who wish to remain anonymous.\n                                Content is made available under a Creative Commons Attribution 4.0 International Public License.", "author_identity_guess": "1 = I do not have even an educated guess about author identity.", "confidence": "4 = Quite sure. I tried to check the important points carefully. It's unlikely, though conceivable, that I missed something that should affect my ratings.", "sentences": {"paper_summary": [[0, 120], [120, 218], [218, 395]], "summary_of_strengths": [[0, 63], [63, 107]], "summary_of_weaknesses": [[0, 112], [112, 221], [221, 391], [391, 529], [529, 626], [626, 788]], "comments,_suggestions_and_typos": [[0, 34]]}}}, {"rid": "70873263db44d699ed7ff42a825a15425a96c66899479c2b26a739291755923ed16b1f2fc588b7faca6255af263567a20438f83bf0cf7597bc2ec2e0d9543f35", "reviewer": null, "report": {"paper_summary": "This paper proposed the use of a set of auxiliary tasks to capture some form of interdependency between arcs in semantic dependency parsing in order to provide a simpler implementation that can obtain robust performance, which achieved near-SOTA and systematic performance on one English SemEval-2015 dataset and one French deep syntactic cyclic graphs. ", "summary_of_strengths": "For a short paper, this paper is well organized and written. The main research question is motivated by efficiently and clearly discussing pros and cons of the previous work and how the current work is related and differs from them. The overall flow of the presentation of the motivations and arguments is smooth, making it easy to follow. The description of the experiments and the discussion of the results are clear and succinct. The use of auxiliary tasks to capture some form of interdependence between arcs for semantic dependency parsing while remaining a reasonable complexity and competitive results seems a contribution to me. ", "summary_of_weaknesses": "1. A more explicit definition / description / explanation of what is meant by “systematic” performance gains or improvements seems to be necessary since this is one of the proposed advantages of the proposed method, and it would also be better if you could explicitly describe the connection between \"systematic performance gain\" and the robustness of model performance. The aforementioned two aspects could make the contribution of the proposed method more obvious and salient.   2. A brief discussion of the motivation and selection of the auxiliary tasks seem needed in Section 3. Some of the issues were described in the first paragraph of Section 3, which could be viewed as implicitly motivating the use of the auxiliary tasks, but it still seems not very sufficient: the jump from problem description to “Hence the idea of using auxiliary tasks taking into account all the heads'' seems abrupt. I think a brief elaboration on why these 4 tasks are designed and chosen would make the picture clearer and would also echo the argument mentioned at the beginning, which is to capture some form of interdependence between arcs. ", "comments,_suggestions_and_typos": "Content: 1. Line 027: what did you mean by “plain dependency parsing”? Syntactic dependency? It would be clearer if a reference is added here to provide an example.  2. Line 047: it would be better and more explicit if the task and/or dataset is mentioned as part of the “achieve state-of-the-art results” statement.  3. Lines 078-079 / Line 08: For clarity, it would be better if the evaluation metric is mentioned here to better understand the scale of the improvement; this would also be helpful to understand the results reported in this paper for comparability: the expression “labelled F-measure scores (LF1) (including ROOT arcs)” was used in Fernández-González and Gómez-Rodríguez (2020).  4. Line 079: Since ID and OOD are not widely used acronyms and this is the first time of them being used, it would be better to define them first and use ID or OOD thereafter: e.g. in-domain (ID) and out-of-domain (OOD)  5. Lines 130-135: The example wrt the mwe label can probably benefit from a visualization of the description, if the space is allowed. Also, the clause “which never happens in the training set” may benefit from a little rephrasing - if I’m not mistaken, this example was mentioned here to support the claim that “impossible sets of labels for the set of heads of a given dependent”. Does this mean that such a combination is incorrect and thus not possible? If so, saying that such scenarios never happen in the training set could mean that it is likely to conceptually have such combinations exist, but it’s just that it’s not seen in the training data.   6. Is there a specific reason for choosing 9 as the number of runs? ( Conventionally, 3, 5, or 10 are common).  Typos: - Line 018: near-soa > did you mean “near-state-of-the-art (sota)”? Define before using an acronym - Line 036: decision > decisions  - Line 062: propose > proposes   - Line 097: biafine > biaffine  - footnote2: a dot (.) is missing after “g” in “e.g” - only pointed this out as a typo as you used “e.g.” throughout the paper as in Lines 157 / 225 / 230 / 231  - Line 202: experimented > experiment - only pointed this out as a typo as you seem to use present tense to describe other people’s work as in Lines 047 / 078 / 081 - Line 250: provide > provides/provided; significative > significant (also caption in Table 1) Miscellaneous: 1. Inconsistent use of uppercase / lowercase in the title: tasks > Task; boost > Boost 2. Inconsistent intext citation styles:     - Lines 077-078 & 277-278: (Fernández-González and Gómez-Rodríguez, 2020) > Fernández-González and Gómez-Rodríguez (2020)     - Lines 276-277: (He and Choi, 2020) > He and Choi (2020) 3. Placement of footnotes: the footnotes follow the ending punctuation, as shown in the *ACL Template Section 4.1: Lines 104 / 166 / 170 / 231 / 239 / 249 / 250 / 266.  4. FYI - the link to the code in footnote 5 didn’t seem to work; it said “Transfer expired: Sorry, this transfer has expired and is not available any more”. Not sure if I need to register an account to get to the code.   5. Add the abbreviation “LF” after “labeled Fscore” on Line 245 so that the use of “LF” later can be attributed to. "}, "scores": {"overall": "3 = Good: This paper is of interest to the *ACL audience and could be published, but might not be appropriate for a top-tier publication venue. It would likely be a strong paper in a suitable workshop.", "best_paper": "No", "replicability": "4 = They could mostly reproduce the results, but there may be some variation because of sample variance or minor variations in their interpretation of the protocol or method.", "datasets": "1 = No usable datasets submitted.", "software": "4 = Useful: I would recommend the new software to other researchers or developers for their ongoing work."}, "meta": {"license": "Copyright © 2021 administered by the Association for Computational Linguistics (ACL)\n                                on behalf of ACL content contributors: None, and other contributors who wish to remain anonymous.\n                                Content is made available under a Creative Commons Attribution 4.0 International Public License.", "author_identity_guess": "1 = I do not have even an educated guess about author identity.", "confidence": "3 =  Pretty sure, but there's a chance I missed something. Although I have a good feel for this area in general, I did not carefully check the paper's details, e.g., the math or experimental design.", "sentences": {"paper_summary": [[0, 354]], "summary_of_strengths": [[0, 61], [61, 233], [233, 340], [340, 433], [433, 637]], "summary_of_weaknesses": [[0, 3], [3, 371], [371, 479], [479, 481], [481, 484], [484, 584], [584, 902], [902, 1130]], "comments,_suggestions_and_typos": [[0, 12], [12, 71], [71, 93], [93, 165], [165, 166], [166, 169], [169, 317], [317, 318], [318, 321], [321, 697], [697, 698], [698, 701], [701, 919], [919, 922], [922, 1054], [1054, 1302], [1302, 1377], [1377, 1574], [1574, 1576], [1576, 1579], [1579, 1646], [1646, 1687], [1687, 1688], [1688, 1695], [1695, 1763], [1763, 1794], [1794, 1828], [1828, 1861], [1861, 1893], [1893, 1916], [1916, 2055], [2055, 2220], [2220, 2315], [2315, 2333], [2333, 2417], [2417, 2420], [2420, 2645], [2645, 2648], [2648, 2813], [2813, 2814], [2814, 2817], [2817, 2971], [2971, 3033], [3033, 3035], [3035, 3038], [3038, 3151]]}}}, {"rid": "fa94bed3bbc96280dc3b98466265c78b317b246d3e86a68e0e4e342ae683a71685264427a80693ea4c82caae2deb33bbc15e71930c843ffac162fb15a7d09086", "reviewer": null, "report": {"paper_summary": "This paper proposes to use multi-task learning to improve semantic dependency parsing. Based on the baseline biaffine dependency parser (Dozat and Manning, 2017), four auxiliary tasks are proposed: H (predicting the number of governors for each token), D (predicting the number of dependents for each token), S (predicting all the arc labels for each token in a classification manner), and B (predicting the number of incoming arcs with each label for each token). They evaluate the best configurations of multi-task learning (combinations of auxiliary tasks and final prediction flows) on one French and three English datasets and find that their methods outperform the vanilla biaffine parser.\nOverall, the paper is clear to understand and seems to perform solid empirical experiments. However, the proposed method seems too trivial and underperforms the state-of-the-art parser on the English datasets by a large margin. More in-depth analyses are also needed. ", "summary_of_strengths": "- Solid empirical experiments: Four datasets are used. Each result is averaged from 9 runs, and significance tests are performed.\n- Clear writing: While some typos exist and the overall writing can be improved, the paper is very clear to understand. ", "summary_of_weaknesses": "- Trivial method: These all four auxiliary tasks seem too trivial to achieve the objective of improving arc consistency prediction since all these tasks are still performed on each token independently.\n- Lack of in-depth analysis: Using the B+H auxiliary tasks designed to predict the number of governors and dependents for each token only improves the prediction of the number of heads by 0.6 points. This improvement seems pretty trivial. It would be better if the authors could provide more thorough analyses of why these auxiliary tasks are helpful.\n- Underperform SOTA by a large margin: The methods underperform the SOTA parsers by a large margin because no POS or lemma information is used, and the authors claim their methods are directly usable with their system. The paper would be much more solid if the authors could verify this hypothesis. ", "comments,_suggestions_and_typos": "- Line 079: Explain ID and OOD.\n- Line 130: Explain DM dataset.\n- Line 138-144: Why the accuracy of predicting the number of heads is related to the observation that zero-head tokens are predicted too frequently.  - Footnote 1: Why use the representation of the first subword of a word? Did you try using the average of all the subwords?\n- Code link seems to be expired. "}, "scores": {"overall": "2.5 ", "best_paper": "No", "replicability": "4 = They could mostly reproduce the results, but there may be some variation because of sample variance or minor variations in their interpretation of the protocol or method.", "datasets": "1 = No usable datasets submitted.", "software": "1 = No usable software released."}, "meta": {"license": "Copyright © 2021 administered by the Association for Computational Linguistics (ACL)\n                                on behalf of ACL content contributors: None, and other contributors who wish to remain anonymous.\n                                Content is made available under a Creative Commons Attribution 4.0 International Public License.", "author_identity_guess": "1 = I do not have even an educated guess about author identity.", "confidence": "4 = Quite sure. I tried to check the important points carefully. It's unlikely, though conceivable, that I missed something that should affect my ratings.", "sentences": {"paper_summary": [[0, 87], [87, 465], [465, 696], [696, 788], [788, 924], [924, 964]], "summary_of_strengths": [[0, 55], [55, 130], [130, 250]], "summary_of_weaknesses": [[0, 202], [202, 402], [402, 441], [441, 554], [554, 773], [773, 853]], "comments,_suggestions_and_typos": [[0, 32], [32, 64], [64, 213], [213, 214], [214, 287], [287, 338], [338, 371]]}}}]