[{"rid": "2ea1d4c58dad5df2829588b117f4cc70bb1a2c104c9a327f31a11d4a897674c3dfd6fa849b1aa747cec96c59367591f4eabf813fd201d598cb3f7f7da4ca97e0", "reviewer": null, "report": {"paper_summary": "This paper presents the residue detection approach, which is specific to NLP adversarial attacks. The method leverages a linear classifier operating on the residue of sentence embedding to detect the adversary.\nIn the empirical evaluation, they detect substitution attacks on four classification datasets, and a targeted universal concatenation attack on a regression dataset. Results show the proposed method can outperform state-of-the-art detection approaches, such as FGWS, on most datasets. ", "summary_of_strengths": "The proposed residue detection method is novel, which leverages the residue of sentence embeddings and feeds the residue into a linear classifier to identify adversarial attacks.  The study proposes two hypotheses of the residue properties in NLP adversarial samples. It further provides the rationale analysis and empirical evaluations to validate these properties.\nThe evaluations cover two types of adversarial attacks on five datasets. Besides, they conducted experiments on both NLP and image tasks. ", "summary_of_weaknesses": "In section 3, some contents are basically introducing previous work, such as PGD, which are not closely related to the proposed method. I would suggest putting these parts into related work section.  Figure2 provides insightful findings on the residue properties. However, they are evaluated only on one dataset. It would be great to apply it to more datasets. ", "comments,_suggestions_and_typos": "Please see the suggestions and comments in the summary of weaknesses. ", "ethical_concerns": "I have no ethical concerns related to this paper. "}, "scores": {"overall": "3.5 ", "best_paper": "No", "datasets": "1 = No usable datasets submitted.", "software": "3 = Potentially useful: Someone might find the new software useful for their work."}, "meta": {"license": "Copyright © 2021 administered by the Association for Computational Linguistics (ACL)\n                                on behalf of ACL content contributors: None, and other contributors who wish to remain anonymous.\n                                Content is made available under a Creative Commons Attribution 4.0 International Public License.", "author_identity_guess": "1 = I do not have even an educated guess about author identity.", "confidence": "4 = Quite sure. I tried to check the important points carefully. It's unlikely, though conceivable, that I missed something that should affect my ratings.", "sentences": {"paper_summary": [[0, 98], [98, 211], [211, 377], [377, 496]], "summary_of_strengths": [[0, 179], [179, 180], [180, 268], [268, 367], [367, 440], [440, 505]], "summary_of_weaknesses": [[0, 136], [136, 199], [199, 200], [200, 264], [264, 313], [313, 361]], "comments,_suggestions_and_typos": [[0, 70]], "ethical_concerns": [[0, 50]]}}}]