[{"rid": "3157d8a8980d26bab69c208803b2e28cfb897da55fe2f26c7bc2b13323adf33ac953adff54c60aa83ba1dc97c6fb586ddc58637cbcaedbd7899bfdc4c3c35021", "reviewer": "Xian-Ling Mao", "report": {"paper_summary": "In this paper, the authors challenge the basis of the seq2seq-based ABSA framework and propose the simple yet effective Seq2Path framework. By carefully designing the output format and discriminator tokens, the Seq2Path could generate multiple semantic tuples from the input sentences. The training methods and the decoding algorithm are reasonable and sound. Extensive experimental results demonstrate its superiority over the previous baselines. ", "summary_of_strengths": "- the problem of the previous Seq2Seq model for the ABSA model is reasonable   - experimental results are rich to prove the effectiveness of the proposed Seq2Path framework. The baselines are very detailed. \n  - Seq2Path is simple yet effective for the ABSA tasks. ", "summary_of_weaknesses": "It makes me confused to understand the meaning of Figure 2. In Figure2, why do the searched results point to the augmented dataset? ", "comments,_suggestions_and_typos": "What is the purpose of your paragraphing in the abstract section? "}, "scores": {"overall": "3.5 ", "best_paper": "No", "replicability": "4 = They could mostly reproduce the results, but there may be some variation because of sample variance or minor variations in their interpretation of the protocol or method.", "datasets": "4 = Useful: I would recommend the new datasets to other researchers or developers for their ongoing work.", "software": "4 = Useful: I would recommend the new software to other researchers or developers for their ongoing work."}, "meta": {"license": "Copyright © 2021 administered by the Association for Computational Linguistics (ACL)\n                                on behalf of ACL content contributors: Xian-Ling Mao, and other contributors who wish to remain anonymous.\n                                Content is made available under a Creative Commons Attribution 4.0 International Public License.", "author_identity_guess": "1 = I do not have even an educated guess about author identity.", "confidence": "3 =  Pretty sure, but there's a chance I missed something. Although I have a good feel for this area in general, I did not carefully check the paper's details, e.g., the math or experimental design.", "sentences": {"paper_summary": [[0, 140], [140, 286], [286, 360], [360, 448]], "summary_of_strengths": [[0, 174], [174, 207], [207, 265]], "summary_of_weaknesses": [[0, 60], [60, 132]], "comments,_suggestions_and_typos": [[0, 66]]}}}]