[{"rid": "217a8d9fbdc29525938d0d7617a33310132b1cdea2c27638c8dac3ce9630355e12e631a78648efd9aeef02bef0a31d93dcacfc368754740b0522e182ed8caaff", "reviewer": "Di Jin", "report": {"paper_summary": "This work has created a benchmark dataset for multi-task learning for biomedical datasets. Based on this new benchmark dataset, this work has proposed instruction learning based multi-task learning, which has shown to outperform single-task learning as well as vallina multi-task learning. ", "summary_of_strengths": "1. This work has newly aggregated more than 20 biomedical datasets in 9 categories into a new multi-task paradigm and formalize them into a text to text format so that we can build one unified model for all different tasks. \n2. This work has proposed using manually created instructions for multi-task learning so that the model can be instructed to perform each task without confusion. And this method has been shown to outperform a lot the vanilla multi-task learning and also outperform single-task learning in some cases. ", "summary_of_weaknesses": "1. In the proposed method, the BI would be concatenated with instances as the input to the BART model, and in the BI, examples are provided. Actually these examples are extracted from those instances, then why should we still have examples in BI? How about just having those instructions in the BI? \n2. One important baseline is missing: in those methods proposed for DecaNLP and UnifiedQA, etc., other types of tokens or phrases are used to indicate which task/dataset each input instance belongs to, which is very important to let the model know what the input instance it is. However, in the baseline of vanilla multi-task learning (V-BB), no such kinds of special tokens are used at all, which forms a very unfair baseline to be compared with. The model are fed by so many instances from various kinds of tasks without any differentiation, which for sure would lead to deteriorate performance. For this reason, the effectiveness or the necessity of BI is questionable. \n3. More deep analysis over the impacts of different kinds of designs of the BI is needed, since such designs can vary a lot among different designers or writers. If so, the performance would be very unstable due to the variance of BI, which makes this type of method not applicable to real-world problems. \n4. Only Rouge-L is used for evaluation, which makes the evaluation not that reliable. Especially for some classification tasks, Rouge-L is not sensitive enough. ", "comments,_suggestions_and_typos": "1. In lines 382-384, it is mentioned that \"We have discarded long samples (>1024 token length) from validation and testing data as well.\". I think it is not appropriate to throw any examples from the test set. "}, "scores": {"overall": "2.5 ", "best_paper": "No", "datasets": "4 = Useful: I would recommend the new datasets to other researchers or developers for their ongoing work.", "software": "4 = Useful: I would recommend the new software to other researchers or developers for their ongoing work."}, "meta": {"license": "Copyright © 2021 administered by the Association for Computational Linguistics (ACL)\n                                on behalf of ACL content contributors: Di Jin, and other contributors who wish to remain anonymous.\n                                Content is made available under a Creative Commons Attribution 4.0 International Public License.", "author_identity_guess": "1 = I do not have even an educated guess about author identity.", "confidence": "4 = Quite sure. I tried to check the important points carefully. It's unlikely, though conceivable, that I missed something that should affect my ratings.", "sentences": {"paper_summary": [[0, 91], [91, 290]], "summary_of_strengths": [[0, 3], [3, 224], [224, 228], [228, 387], [387, 526]], "summary_of_weaknesses": [[0, 3], [3, 141], [141, 247], [247, 299], [299, 303], [303, 397], [397, 579], [579, 748], [748, 898], [898, 973], [973, 977], [977, 1136], [1136, 1280], [1280, 1284], [1284, 1367], [1367, 1442]], "comments,_suggestions_and_typos": [[0, 3], [3, 139], [139, 210]]}}}]