[{"rid": "7d67dcb3c0915c610966de8dda039a0aac770a85ffab1827c2aaaa109c3fd8dd46c6878e1e47f1df147297581639cc911b34dc4f0d3f7246a0698a56dd450756", "reviewer": null, "report": {"paper_summary": "This paper proposes an LM pre-training method for bi-encoder models. The formal definition of their pre-training task includes: 1. the pre-training task is the same as the task definition used in extractive QA models 2. the model architecture is the bi-encoder architecture. First, one encoder computes contextualized vector representation of tokens in the given passage. Next, the other encoder computes vector representation of the given question. Then the model predicts the start and end indices by computing the dot-product similarity between the question vector and the token vectors. \n3. The pre-training dataset is generated jointly using question generation and a student-teacher framework. The generated question-answer pairs are then used for the pre-training.\nThis paper evaluates their pre-trained encoder on five downstream tasks: extractive QA, zero-shot paraphrase ranking, few-shot paragraph classification, few-shot named entity recognition, zero-shot sentiment analysis. The results show that the proposed pre-training method is sufficient to be used by bi-encoders in zero/few-shot settings. ", "summary_of_strengths": "1. The importance of bi-encoder in QA and other NLP fields is increasing. This paper proposes a novel pre-training approach for bi-encoder models. \n2. The experimental results of this paper show the efficacy of their pre-training method. \n3. This paper shows an interesting finding on their proposed pre-training method; in the zero-shot setting, pre-training bi-encoders with the proposed pre-training method is better than using cross-encoder     1. Evidence: Table2 (QUIP + cross-encoder vs QUIP)     2. Evidence: Table 4 (QUIP + Cross-student vs QUIP)     3. Evidence: Table 5 4. This paper provides prompt methods for using their pre-trained encoder to downstream tasks. ", "summary_of_weaknesses": "The motivation described in this paper is not well aligned with some experimental designs of this paper. For example, it is unclear why some downstream tasks are in zero/few-shot settings. ", "comments,_suggestions_and_typos": "It would be great if the authors provided experimental analysis on the reason bi-encoders outperform cross-encoders when the encoders are pre-trained on their method. "}, "scores": {"overall": "3.5 ", "best_paper": "No", "replicability": "3 = They could reproduce the results with some difficulty. The settings of parameters are underspecified or subjectively determined, and/or the training/evaluation data are not widely available.", "datasets": "1 = No usable datasets submitted.", "software": "1 = No usable software released."}, "meta": {"license": "Copyright © 2021 administered by the Association for Computational Linguistics (ACL)\n                                on behalf of ACL content contributors: None, and other contributors who wish to remain anonymous.\n                                Content is made available under a Creative Commons Attribution 4.0 International Public License.", "author_identity_guess": "1 = I do not have even an educated guess about author identity.", "confidence": "4 = Quite sure. I tried to check the important points carefully. It's unlikely, though conceivable, that I missed something that should affect my ratings.", "sentences": {"paper_summary": [[0, 69], [69, 128], [128, 131], [131, 220], [220, 275], [275, 372], [372, 450], [450, 591], [591, 595], [595, 700], [700, 772], [772, 990], [990, 1112]], "summary_of_strengths": [[0, 3], [3, 74], [74, 147], [147, 151], [151, 238], [238, 242], [242, 452], [452, 507], [507, 563], [563, 584], [584, 676]], "summary_of_weaknesses": [[0, 105], [105, 189]], "comments,_suggestions_and_typos": [[0, 167]]}}}, {"rid": "4eeedac91e83ad9a9dd5c33f4eb351f59106fc0d805db0f6728c7915e7a2d23a9568c1c771f1a7ee23acac720540f9a4e5ffb3c4d4d5b38e272dc530e0fc4ed4", "reviewer": null, "report": {"paper_summary": "This paper propose a new pre-training objective for train Bi-encoder based QA model. The main claim is that the proposed pre-training objectives helps in improving the model's performance on non-QA downstream tasks like paraphrase detection, sentiment analysis etc. without extensive finetuing.  The main hypothesis is that the proposed way of pre-training helps the model in learning better token level representation needed for zero shot and few shot tasks. ", "summary_of_strengths": "Synthetically generated questions have been nicely used for pre-training QA model to improve performance on tasks like Sentiment analysis, paraphrase detection in a zero shot, few shot setup. A good analysis of using QA as the pre-training objective rather than MLM. ", "summary_of_weaknesses": "The paper has incremental or limited novelty as the question generation from passages using BART is already a known, Bi-encoder for QA already exists. \nContributions of the paper are quite trivial. \nBi-encoder+Unsupervised QA didn't perfrom great. So whether choosing QA as the pre-training is helping QA task or not is not very clear. \nwhat is the motivation behind independently encoding questions and passage is not very clear. isn't that a shared common encoder would help the model learning better question tokens to passage token matching? \nFor QA task, It seems that the cross-encoder + MRQA is doing better than proposed QUIP. ", "comments,_suggestions_and_typos": "Highlight the best numbers in table 7.  - Have a strategy to filter out best quality question from the set of synthetically generated questions.\n- May be design a curriculum learning paradigm for pre-training so that the batch sampling is done in a manner that helps the pre-training learn from easy to complex questions. "}, "scores": {"overall": "3 = Good: This paper is of interest to the *ACL audience and could be published, but might not be appropriate for a top-tier publication venue. It would likely be a strong paper in a suitable workshop.", "best_paper": "No", "replicability": "4 = They could mostly reproduce the results, but there may be some variation because of sample variance or minor variations in their interpretation of the protocol or method.", "datasets": "1 = No usable datasets submitted.", "software": "1 = No usable software released."}, "meta": {"license": "Copyright © 2021 administered by the Association for Computational Linguistics (ACL)\n                                on behalf of ACL content contributors: None, and other contributors who wish to remain anonymous.\n                                Content is made available under a Creative Commons Attribution 4.0 International Public License.", "author_identity_guess": "4 = From an allowed pre-existing preprint or workshop paper, I know/can guess at least one author's name.", "confidence": "4 = Quite sure. I tried to check the important points carefully. It's unlikely, though conceivable, that I missed something that should affect my ratings.", "sentences": {"paper_summary": [[0, 85], [85, 266], [266, 295], [295, 460]], "summary_of_strengths": [[0, 192], [192, 267]], "summary_of_weaknesses": [[0, 151], [151, 198], [198, 248], [248, 336], [336, 431], [431, 546], [546, 635]], "comments,_suggestions_and_typos": [[0, 39], [39, 40], [40, 145], [145, 322]]}}}, {"rid": "a08c0e0dafb5d74615009802dfc40b3801cc6a3f779b82e40b03a3f4c3f3bef3a4186e50fbbc8ec1a5364e61382882c08f2d7b7d4689d743a8b74728f99da313", "reviewer": null, "report": {"paper_summary": "This paper proposes a pre-training objective based on QA, aiming at learning general-purpose contextual representations. They use BART model to generate QA pairs with context passages and use a cross-encoder RoBERTa to relabel the examples. After that, bi-encoder model is trained to match the cross-encoder predictions on the generated questions. And this paper conducts many experiments on multiple datasets of four downstream tasks. ", "summary_of_strengths": "1. The experimental effect is considerable under four different downstream tasks. \n2. Experiments require a lot of computing resources and time. ", "summary_of_weaknesses": "1. The article is very trivial and didn't write a paragraph to summarize the contribution of the paper, which makes it difficult to focus on the core ideas. \n2. It is suggested to combine pictures and other forms to assist the description, which will be clearer to understand. \n3. Will the code and dataset of this paper be published? ", "comments,_suggestions_and_typos": "Please see my comments and questions in the core review. "}, "scores": {"overall": "3 = Good: This paper is of interest to the *ACL audience and could be published, but might not be appropriate for a top-tier publication venue. It would likely be a strong paper in a suitable workshop.", "best_paper": "No", "replicability": "3 = They could reproduce the results with some difficulty. The settings of parameters are underspecified or subjectively determined, and/or the training/evaluation data are not widely available.", "datasets": "4 = Useful: I would recommend the new datasets to other researchers or developers for their ongoing work.", "software": "1 = No usable software released."}, "meta": {"license": "Copyright © 2021 administered by the Association for Computational Linguistics (ACL)\n                                on behalf of ACL content contributors: None, and other contributors who wish to remain anonymous.\n                                Content is made available under a Creative Commons Attribution 4.0 International Public License.", "author_identity_guess": "1 = I do not have even an educated guess about author identity.", "confidence": "3 =  Pretty sure, but there's a chance I missed something. Although I have a good feel for this area in general, I did not carefully check the paper's details, e.g., the math or experimental design.", "sentences": {"paper_summary": [[0, 121], [121, 241], [241, 348], [348, 436]], "summary_of_strengths": [[0, 3], [3, 82], [82, 86], [86, 145]], "summary_of_weaknesses": [[0, 3], [3, 157], [157, 161], [161, 277], [277, 281], [281, 335]], "comments,_suggestions_and_typos": [[0, 57]]}}}]