[{"rid": "0f595b4bd968ef5daacc88c4edb581bf7f683af30b6874ba157c6d2282aabead577041409b949924e4bc5ef54c543d85a10e962be8e70304dea65e1b18441bdb", "reviewer": null, "report": {"paper_summary": "The authors use a variety of NLP methods to answer a number of linguistic questions regarding the phonology-syntax interface. Specifically, they use machine learning methods (varying the kinds of information available to the models) to demonstrate the learnability of well-researched word-pairing phenomena in Southeast Asian languages, namely \"coordinate compounds\" and \"elaborate expressions\". Their results are highly suggestive that \"although language users may use phonological hierarchies like those proposed in Mortensen (2006) to select appropriate orders for EEs and CCs, it is clearly not the case that they must (though they will perform a bit better if they do)\". ", "summary_of_strengths": "The paper is very clearly written, both from the perspective of language use and argument structure. The flow of the article is easy to follow, and the logic is methodical and explicit. The methods used are all well-established in the NLP community, which makes interpretation and evaluation straightforward, but the application is novel and the results are very interesting from a linguistic standpoint. The authors do an excellent job of situating their argument in the context of other published research, and it seems clear that their results are an important contribution to that dialog. ", "summary_of_weaknesses": "None. ", "comments,_suggestions_and_typos": "None. ", "ethical_concerns": "None. "}, "scores": {"overall": "4.5 ", "best_paper": "No", "datasets": "5 = Enabling: The newly released datasets should affect other people's choice of research or development projects to undertake.", "software": "4 = Useful: I would recommend the new software to other researchers or developers for their ongoing work."}, "meta": {"license": "Copyright © 2021 administered by the Association for Computational Linguistics (ACL)\n                                on behalf of ACL content contributors: None, and other contributors who wish to remain anonymous.\n                                Content is made available under a Creative Commons Attribution 4.0 International Public License.", "author_identity_guess": "3 = From the contents of the submission itself, I know/can guess at least one author's name.", "confidence": "4 = Quite sure. I tried to check the important points carefully. It's unlikely, though conceivable, that I missed something that should affect my ratings.", "sentences": {"paper_summary": [[0, 126], [126, 396], [396, 676]], "summary_of_strengths": [[0, 101], [101, 186], [186, 405], [405, 593]], "summary_of_weaknesses": [[0, 6]], "comments,_suggestions_and_typos": [[0, 6]], "ethical_concerns": [[0, 6]]}}}, {"rid": "95d0d98c551f861dc8a31c514dee5b6bb5de72f3a5cc59d8b77b924a289dab6d2af696ec44ab922d3dcad4be9940c4a7f72393b9d709504b1f5e0a02f41bb73b", "reviewer": null, "report": {"paper_summary": "This paper concerns compounds and elaborate expressions (EEs) in Hmong, Lahu, and Chinese. An elaborate expression is an expression ABAC (A B1 A B2 in the paper but i prefer ABAC to indicate the identity of the words so swill use that) like “people pile people lump” fo ra throng of people. It starts with the prior observation that there is a phonological hierarchy that dictates the ordering of the B and C words (or for compounds the A and B words). It then fits SVMs/decision trees/etc to see if you can predict the ordering based on phonology, which is successful as a classifier.  It then looks to see if you can predict (out of sample) based on a neural embedding model. This classifier also works very well. ", "summary_of_strengths": "It is nice to see a paper investigating a specific linguistic phenomenon of theoretical interest in a non-English, non-Indo-European language. There seems to be a rich prior literature on EEs in Hmong, Lahu, and Chinese and this paper contributes to that literature. ", "summary_of_weaknesses": "The paper is framed as pitting, to some extent, distributional information against the phonological hierarchy. But these kinds of phonological constraints tend to be soft and violable. So I was not convinced by the takeaway of the first set of experiments using the phonological classifiers. What does this add on top of just examining the distributional patterns of phonological features in the compounds and EEs?  The motivation for the neural experiment was also a bit confusing to me. Essentially, it shows that you can predict the ordering of B and C in ABAC based on the training data, because B and C occur in that same ordering elsewhere in the corpus. This doesn’t seem particularly informative as a result.\nAs the paper points out, there seem to be two routes to learning this information: (soft?) phonological constraints and the distributions in texts. But I’m not fully convinced that this work breaks ground theoretically or methodologically. ", "comments,_suggestions_and_typos": "Might want to check out work by Emily Morgan and Roger Levy on binomial pairs, predicting the ordering of items in a phrase like “peanut butter and jelly”. ", "ethical_concerns": "NA "}, "scores": {"overall": "2 = Revisions Needed: This paper has some merit, but also significant flaws, and needs work before it would be of interest to the community.", "best_paper": "No", "datasets": "3 = Potentially useful: Someone might find the new datasets useful for their work.", "software": "3 = Potentially useful: Someone might find the new software useful for their work."}, "meta": {"license": "Copyright © 2021 administered by the Association for Computational Linguistics (ACL)\n                                on behalf of ACL content contributors: None, and other contributors who wish to remain anonymous.\n                                Content is made available under a Creative Commons Attribution 4.0 International Public License.", "author_identity_guess": "1 = I do not have even an educated guess about author identity.", "confidence": "3 =  Pretty sure, but there's a chance I missed something. Although I have a good feel for this area in general, I did not carefully check the paper's details, e.g., the math or experimental design.", "sentences": {"paper_summary": [[0, 91], [91, 291], [291, 453], [453, 586], [586, 678], [678, 716]], "summary_of_strengths": [[0, 143], [143, 267]], "summary_of_weaknesses": [[0, 111], [111, 185], [185, 292], [292, 415], [415, 416], [416, 489], [489, 661], [661, 717], [717, 808], [808, 865], [865, 957]], "comments,_suggestions_and_typos": [[0, 156]], "ethical_concerns": [[0, 3]]}}}]