[{"rid": "21d02d860d3c41a735ba26f974a0e310c16baafcfc7a8ce82f79b125122ddf18c34e8c4a93e91bfd5acec84719467f191b3c255adae45ad158f391824de7d33e", "reviewer": null, "report": {"paper_summary": "This paper presents a new dataset called FairytaleQA, which consists of 10,580 expert-annotated questions from 278 children-friendly stories. One key feature of this dataset is that each question is annotated with the specific reading comprehension skill required to answer it. The authors run several versions of BART-based QA models to show that the model cannot obtain human performance. Additionally, they use FairytaleQA for training question generation models and show that it can be used to ask high-quality reading comprehension questions. ", "summary_of_strengths": "- This paper introduces a reasonable-sized dataset for QA in narratives. The dataset (if available) would be a useful resource for the NLP community.  - A good review of existing datasets that focused on stories and narratives. It covers all the related datasets that I am aware of.  - The categorization of reading comprehension skills in Section 3.2 is useful.  - The paper is fairly easy to follow. ", "summary_of_weaknesses": "- One major concern is that the contribution of this paper to the QA and NLP community seems mediocre. To me, the difference between FairytaleQA and other reading comprehension datasets on stories and narratives is not obvious. Although the additional annotations about reading skills could be counted as one highlight, this categorization is still coarse-grained to me since it seems nothing more than question types (I assume the categorization might be easily inferred from the question surface form, e.g., \"How did ... feel?\" belongs to the \"Feeling\" category).  - Some details of the annotation process are still vague to me. In Line 342, it claims that the \"texts were broken down into small sections based on their semantic content by our annotators.\" The annotation details for this part seems not revealed. For the question annotation, how many annotators work for each article? What is the detailed annotation guideline? How many questions are required for each article? How the annotators are paid? How to avoid annotation bias?\n- Another worrying fact is that: from Table 5, we see the performance gap between the QA model and the human is not very big. The BART model fine-tuned on FairytaleQA is 0.533 Rouge and 0.536 F1, which is already around 82% of the human performance (0.651 / 0.644). This suggests that FairytaleQA might not be challenging enough. The possibility is that, with some additional engineering efforts on the QA model, FairytaleQA becomes yet another QA dataset that gets solved within a matter of weeks that does not truly evaluate the phenomena it sets out to. ", "comments,_suggestions_and_typos": "Minor Suggestions:  - I think explicit and implicit questions might not be a good naming. Factual detail questions and inductive questions might be more clear?  Putting together all the strengths and weaknesses, I suggest this paper would benefit from another round of revision to address the above concerns before publishing. Otherwise, it might become yet another incremental reading comprehension dataset that might be addressed within a couple of months. "}, "scores": {"overall": "2 = Borderline: This paper has some merit, but also significant flaws. It does not warrant publication at top-tier venues, but might still be a good pick for workshops.", "best_paper": "No", "replicability": "3 = They could reproduce the results with some difficulty. The settings of parameters are underspecified or subjectively determined, and/or the training/evaluation data are not widely available.", "datasets": "4 = Useful: I would recommend the new datasets to other researchers or developers for their ongoing work.", "software": "1 = No usable software released."}, "meta": {"license": "Copyright © 2021 administered by the Association for Computational Linguistics (ACL)\n                                on behalf of ACL content contributors: None, and other contributors who wish to remain anonymous.\n                                Content is made available under a Creative Commons Attribution 4.0 International Public License.", "author_identity_guess": "1 = I do not have even an educated guess about author identity.", "confidence": "4 = Quite sure. I tried to check the important points carefully. It's unlikely, though conceivable, that I missed something that should affect my ratings.", "sentences": {"paper_summary": [[0, 142], [142, 278], [278, 391], [391, 548]], "summary_of_strengths": [[0, 73], [73, 150], [150, 151], [151, 228], [228, 283], [283, 284], [284, 363], [363, 364], [364, 402]], "summary_of_weaknesses": [[0, 103], [103, 228], [228, 530], [530, 566], [566, 567], [567, 631], [631, 759], [759, 816], [816, 888], [888, 931], [931, 981], [981, 1010], [1010, 1040], [1040, 1166], [1166, 1306], [1306, 1370], [1370, 1597]], "comments,_suggestions_and_typos": [[0, 20], [20, 90], [90, 160], [160, 161], [161, 327], [327, 459]]}}}]