[{"rid": "93f2dbcf1adfb64891da4b3d647b5b93e5bc9bef019adfe68983a764eafa5ce16f7b16a14cc54a8522b5c9c7534ef42d0a763a4a2c949645aec3f8303fa466c4", "reviewer": null, "report": {"paper_summary": "The authors introduce a new annotated event detection dataset that is focused on annotation suicidal events. \nThe annotation focuses on the following event types: suicide-related actions, thoughts/ideation, risk factors related to life, relationship, health, and other, in addition to protective factors related to positive activities such as taking medication. \nThe author apply state-of-the-art event detection models on their dataset, where the performance is poorer in comparison to more established event detection domains. As a result, the authors are calling the community to build models that can improve the performance. ", "summary_of_strengths": "- The developed dataset is interesting and the task is very important to NLPers who work on mental health. I see its impact going beyond the event detection task to other tasks in the same domain that are related to understanding what kind of triggers affect suicidality. This, hopefully, would yield better performance of the suicide risk assessment and other mental-health related classifiers.  - The fact that the annotators are mental health domain experts makes of a more reliable data.  - I find the discussion of the challenges of annotations very valuable and it resonates with many previous research where cases of someone talking about a friend trying to committing suicide should be differentiated than the person who is posting attempting suicide.  - The baseline models that the authors use are strong and recent.  - Thorough reproducibility check list (e.g model parameters, annotation examples) ", "summary_of_weaknesses": "- Although it is not uncommon to see the \"OTHER\" label in annotation schema as a candidate label when the annotators cannot find a better mapping with the rest of the labels, I think OTHER label makes the annotations weaker. The annotators would default to it in many cases and as a result the number of annotations for that label become much higher in comparison to the other labels (in your case 15343 for OTHER vs. 21635 for the rest of the labels). This would generate problems such as data imbalance, potential noisy labels where the model might over predict the OTHER label.  - The call to the community by the authors for better performance models is a valid one, but we cannot eliminate putting some burden of the poor performance on the dataset itself. This might be due to embedded annotations' issues that can be simply a result of the domain itself. Did the authors do a thorough analysis to confirm that hypothesis?\n- I think it is very important to see the performance of the models on each label separately. For instance, a valuable analysis would be to compare the performance per label with the annotation challenges. ", "comments,_suggestions_and_typos": "- Please check the weaknesses section for suggestions on how to improve the work. For instance, I would emphasize again that the readers need to see the performance on each event type to better understand the challenges and how to improve the models. \nFor RF-HEALTH event type, you mention that it is about mentions that directly affect the subject's health. This can be ambiguous, for instance you might have a transitive relationship between life events and health, thus the event types are not exclusive (as you mention this was part of your annotation design). Could you please elaborate more on that? \nIs your dataset intersected with CLPsych 2019 dataset (Zirikly et al. 2019)? It would be very interesting and valuable if we have the ED annotations on that dataset to further push the performance of the risk assessment models with the use of the triggers.   Typos: Preposition is missing after models on line 276 ", "ethical_concerns": "It is good that the authors mention IRB exemption and their efforts to further remove any user mentions. However, given the sensitivity of the topic, I think there should be data user agreement or something similar in place, even if Reddit data is publicly available. "}, "scores": {"overall": "3.5 ", "best_paper": "No", "replicability": "5 = They could easily reproduce the results.", "datasets": "4 = Useful: I would recommend the new datasets to other researchers or developers for their ongoing work.", "software": "4 = Useful: I would recommend the new software to other researchers or developers for their ongoing work."}, "meta": {"license": "Copyright © 2021 administered by the Association for Computational Linguistics (ACL)\n                                on behalf of ACL content contributors: None, and other contributors who wish to remain anonymous.\n                                Content is made available under a Creative Commons Attribution 4.0 International Public License.", "author_identity_guess": "1 = I do not have even an educated guess about author identity.", "confidence": "4 = Quite sure. I tried to check the important points carefully. It's unlikely, though conceivable, that I missed something that should affect my ratings.", "sentences": {"paper_summary": [[0, 109], [109, 362], [362, 529], [529, 630]], "summary_of_strengths": [[0, 107], [107, 272], [272, 396], [396, 397], [397, 492], [492, 493], [493, 760], [760, 761], [761, 827], [827, 828], [828, 910]], "summary_of_weaknesses": [[0, 225], [225, 453], [453, 581], [581, 582], [582, 762], [762, 862], [862, 929], [929, 1023], [1023, 1135]], "comments,_suggestions_and_typos": [[0, 82], [82, 251], [251, 359], [359, 565], [565, 606], [606, 684], [684, 864], [864, 866], [866, 921]], "ethical_concerns": [[0, 105], [105, 268]]}}}, {"rid": "00b1d8296a836fe8f6dda3d7c4b42674cca6f332f0c1865c4dc68f83e4c18995ed83391dbadb2f207e1f0ecfd02e512dba8c30173297edb4d698ee7451fbd19c", "reviewer": null, "report": {"paper_summary": "The work focuses on the Event Detection task to identify event trigger words of suicide-related events in public posts of discussion forums. ", "summary_of_strengths": "Authors introduce a new dataset for ED (SuicideED) that features seven suicidal event types to comprehensively capture suicide actions and ideation, and general risk and protective factors. ", "summary_of_weaknesses": "Limited awareness of the literature. ", "comments,_suggestions_and_typos": "The manuscript is centered on a very interesting and timely topic, which is also quite relevant to the themes of ARR. Organization of the paper is good and the proposed method is quite novel. The length of the manuscript is about right.\nThe manuscript, however, does not link well with recent literature on AI for mental health, e.g., see sentic computing for patient centered applications. Also, latest trends in mental disorder detection with attentive relation networks are missing. Finally, check Ji et al.’s recent review of suicidal ideation detection.\nThe manuscript presents some bad English constructions, grammar mistakes, and misuse of articles: a professional language editing service (e.g., the ones offered by IEEE, Elsevier, or Springer) is strongly recommended in order to sufficiently improve the paper's presentation quality for meeting the high standards of ARR.\nFinally, double-check both definition and usage of acronyms: every acronym, e.g., CNN, should be defined only once (at the first occurrence) and always used afterwards (except for abstract and section titles). Also, it is not recommendable to generate acronyms for multiword expressions that are shorter than 3 words, e.g., ED (unless they are universally recognized, e.g., AI). "}, "scores": {"overall": "3 = Good: This paper is of interest to the *ACL audience and could be published, but might not be appropriate for a top-tier publication venue. It would likely be a strong paper in a suitable workshop.", "best_paper": "No", "replicability": "5 = They could easily reproduce the results.", "datasets": "5 = Enabling: The newly released datasets should affect other people's choice of research or development projects to undertake.", "software": "1 = No usable software released."}, "meta": {"license": "Copyright © 2021 administered by the Association for Computational Linguistics (ACL)\n                                on behalf of ACL content contributors: None, and other contributors who wish to remain anonymous.\n                                Content is made available under a Creative Commons Attribution 4.0 International Public License.", "author_identity_guess": "1 = I do not have even an educated guess about author identity.", "confidence": "5 = Positive that my evaluation is correct. I read the paper very carefully and am familiar with related work.", "sentences": {"paper_summary": [[0, 141]], "summary_of_strengths": [[0, 190]], "summary_of_weaknesses": [[0, 37]], "comments,_suggestions_and_typos": [[0, 118], [118, 192], [192, 237], [237, 391], [391, 486], [486, 559], [559, 882], [882, 1092], [1092, 1261]]}}}, {"rid": "42e1a1ffb6697cfc6e56e3907ec8da5ecbdec3559d597919138cf9de7718f899b458941998c44d697da2e3ed8a114f66da1bc6ced98d98d90b8c92f6a51721b4", "reviewer": "Ali Hürriyetoğlu", "report": {"paper_summary": "The authors construct a corpus on suicide events. The token level annotations and event types are invaluable. This corpus enable quantification of the performance of the state-of-the-art modeling approaches. The performance scores show that we still need to work a lot on this task. ", "summary_of_strengths": "The inter-annotator agreement and the use of Reddit data, which is user-generated text, make this work valuable. The token level annotations and event types are invaluable. ", "summary_of_weaknesses": "The paper should contain discussion of some design decisions: 1- How did the documents are filtered? Is it a random sample or keyword based filtering? What did you do for the documents that do not contain any suicide related information? \n2- \"with more than 50 words are kept to increase\" -> What do the excluded documents contain? What is the ratio of the posts excluded in respect of this decision? \n3- \"Finally, we further fine tune the pre-trained BERT model over unlabeled Reddit posts (i.e., about 40K posts) using masked language modeling (Devlin et al., 2019).\" - > how did you select the 40k docs? The document selection matters: Caselli, T., Mutlu, O., Basile, A., & Hürriyetoğlu, A. (2021, August). PROTEST-ER: Retraining BERT for Protest Event Extraction. ... ", "comments,_suggestions_and_typos": "1- The ratio of RF-Other is too high (40%) in the corpus in comparison to other event types. I think this requires some elaboration. \n2- The text mention 2300 docs annotated. However, table 1 row #documents contains more documents 2214+130+109 3- How is the disagreements were resolved for the 20% that was co-annotated. \n4- The reddit corpus could be compared to other event detection datasets that utilize user-generated text. Comparing this corpus to MAVEN and CycSecED is not fair. \n5- Do you use sentences or whole posts as the unit to be annotated?\nEnglish language: \"pubic posts\" -> public posts \"a ED model must\" -> \"an ED model must\" "}, "scores": {"overall": "2.5 ", "best_paper": "No", "replicability": "3 = They could reproduce the results with some difficulty. The settings of parameters are underspecified or subjectively determined, and/or the training/evaluation data are not widely available.", "datasets": "4 = Useful: I would recommend the new datasets to other researchers or developers for their ongoing work.", "software": "2 = Documentary: The new software will be useful to study or replicate the reported research, although for other purposes it may have limited interest or limited usability. (Still a positive rating)"}, "meta": {"license": "Copyright © 2021 administered by the Association for Computational Linguistics (ACL)\n                                on behalf of ACL content contributors: Ali Hürriyetoğlu, and other contributors who wish to remain anonymous.\n                                Content is made available under a Creative Commons Attribution 4.0 International Public License.", "author_identity_guess": "1 = I do not have even an educated guess about author identity.", "confidence": "5 = Positive that my evaluation is correct. I read the paper very carefully and am familiar with related work.", "sentences": {"paper_summary": [[0, 50], [50, 110], [110, 208], [208, 283]], "summary_of_strengths": [[0, 113], [113, 173]], "summary_of_weaknesses": [[0, 101], [101, 151], [151, 238], [238, 332], [332, 401], [401, 572], [572, 607], [607, 710], [710, 772]], "comments,_suggestions_and_typos": [[0, 93], [93, 133], [133, 175], [175, 321], [321, 429], [429, 486], [486, 555], [555, 643]]}}}]