[{"rid": "1bfa77206969b120204949e9b10f8c5980f90a790345b5534a5dcddeddde766b343d4e1882210ad7e60411172d79f393bf195c23d3ab4a6dd1b955bf4a8c4d26", "reviewer": "Jun Yang", "report": {"paper_summary": "This paper investigates the aspect sentiment triplet extraction task and optimized bidirectional machine reading comprehension method with 4 improvements. The evaluation results look good against baseline models. ", "summary_of_strengths": "The bidirectional machine reading comprehension is suited for this task and the design of span matching and probability generation is useful(through ablation study). The overall performance is good. ", "summary_of_weaknesses": "1. In the backward query of Fig 4, why the span is \"must visit\" instead of \"a must visit\" given the probability of the word \"a\" is 86%, which is the same as the word \"must\"? \n2. What if the forward query and backward query give conflict prediction? For example in the example sentence of Fig 2, if the answer to the first query is only \"small\" (without \"good\"), what will happen? The example in Fig 4 is too simple. \n3. What are the differences between two versions of ASTE-Data datasets? \n4. The evaluation metrics are not explained, is it an exact match rule: the prediction is correct only if all three elements in the triplet are correct? ", "comments,_suggestions_and_typos": "The words in Fig 4 is too small. It can hard be recognized is the paper is printed out on an A4 paper. \nThe variables in formula 1 and 2 should be explained, for example, what is pair_asp. "}, "scores": {"overall": "2.5 ", "best_paper": "No", "datasets": "1 = No usable datasets submitted.", "software": "1 = No usable software released."}, "meta": {"license": "Copyright © 2021 administered by the Association for Computational Linguistics (ACL)\n                                on behalf of ACL content contributors: Jun Yang, and other contributors who wish to remain anonymous.\n                                Content is made available under a Creative Commons Attribution 4.0 International Public License.", "author_identity_guess": "1 = I do not have even an educated guess about author identity.", "confidence": "3 =  Pretty sure, but there's a chance I missed something. Although I have a good feel for this area in general, I did not carefully check the paper's details, e.g., the math or experimental design.", "sentences": {"paper_summary": [[0, 155], [155, 213]], "summary_of_strengths": [[0, 166], [166, 199]], "summary_of_weaknesses": [[0, 3], [3, 174], [174, 178], [178, 249], [249, 380], [380, 416], [416, 420], [420, 489], [489, 493], [493, 643]], "comments,_suggestions_and_typos": [[0, 33], [33, 103], [103, 189]]}}}]