[{"rid": "363d19b7089db8a3a208da8fe4a459c889c0b67f39a57361ddb4b8daf9f2e2f7728c238bdbd68e0f23f98e75f789a6086d19c5934d1f16de7da44fc260ceb34a", "reviewer": null, "report": {"paper_summary": "This work methods for role-based dialogue summarization. They argue that information for other role’s utterances and summaries can improve the informativeness and quality of dialogue summaries. They propose two enhancements which could be applied to existing methods: a cross attention mechanism to to acquire other role’s information supported by a attention divergence loss to match the attention distribution between different roles. And a decoder self-attention-based interaction mechanism to share other role’s summary information. On two role-based dialogue summarization datasets, the authors perform automatic and human evaluation to show improvements over base architectures. ", "summary_of_strengths": "The paper is clearly written and easy to understand. The two mechanisms proposed are individually motivated with ablated model variations showing advantage of both. Extensive experiments are performed to show the advantage of the proposed models. ", "summary_of_weaknesses": "•\tIt is not clear why does the user decoder at time step t uses only the information till time step t from the agent decoder and why not use the information from all the time steps?\n•\tThe motivation of applying the attention divergence loss to force attention similarity is still not clear to me. What happens if att^a_u is made equal to att^u_u . I couldn’t find any model ablation which justifies this loss as well.  •\tThe human evaluation is not clearly able to identify if the model improvements actually help as the results are close and not consistent across models (although reasoning has been provided). ", "comments,_suggestions_and_typos": "Paper is well written and organized. Additional experiments to justify the the attention divergence loss can help the paper. More examples in case studies can better help in understanding the contributions. "}, "scores": {"overall": "3.5 ", "best_paper": "No", "replicability": "3 = They could reproduce the results with some difficulty. The settings of parameters are underspecified or subjectively determined, and/or the training/evaluation data are not widely available.", "datasets": "1 = No usable datasets submitted.", "software": "4 = Useful: I would recommend the new software to other researchers or developers for their ongoing work."}, "meta": {"license": "Copyright © 2021 administered by the Association for Computational Linguistics (ACL)\n                                on behalf of ACL content contributors: None, and other contributors who wish to remain anonymous.\n                                Content is made available under a Creative Commons Attribution 4.0 International Public License.", "author_identity_guess": "1 = I do not have even an educated guess about author identity.", "confidence": "3 =  Pretty sure, but there's a chance I missed something. Although I have a good feel for this area in general, I did not carefully check the paper's details, e.g., the math or experimental design.", "sentences": {"paper_summary": [[0, 57], [57, 194], [194, 437], [437, 537], [537, 685]], "summary_of_strengths": [[0, 53], [53, 165], [165, 247]], "summary_of_weaknesses": [[0, 182], [182, 297], [297, 348], [348, 418], [418, 419], [419, 612]], "comments,_suggestions_and_typos": [[0, 37], [37, 125], [125, 207]]}}}, {"rid": "1590e6fc469f7d0535861a66fe0ff32cef41d9dcdf274453705438c66de5c37b7b601b73d21a165c6db0fcf6cccf46b1ceaa8af2fefb76d9d350049e26735763", "reviewer": "Xiachong Feng", "report": {"paper_summary": "This paper proposes an interaction-based model for role-oriented dialogue summarization. This sub-task of dialogue summarization is important for dialogues in specific domains. The idea is interesting, especially the *Attention Divergence Loss*, which guides the inter-attention by means of intra-attention. Experiments are conducted on two datasets: CSDS and the Medical dataset proposed by Song. Actually, the medical dataset is not very suitable for this task, the authors also mention this consideration. The choice of BertAbs as the backbone model also makes sense. However, I am also curious about the performance of using other pre-trained LM for Chinese, like *T5-PEGASUS-Chinese*. The experiments are extensive, both automatic and human evaluations are conducted. ", "summary_of_strengths": "1. interesting idea: Attention Divergence Loss. \n2. extensive experiments and various evaluation metrics, also perform the t-test. \n3. codes will be released. ", "summary_of_weaknesses": "1. Choose BERTAbs as the backbone model rather than fully pre-trained seq2seq LM. \n2. The experimental results on MC are not very significant, Song et al., 2020 achieve better results on agent summary in terms of ROUGE-1 and ROUGE-L. 3. For *Agent Summary Completeness Analysis*, some details are missing, how to judge agent summaries need to be integrated? ", "comments,_suggestions_and_typos": "The line number on page 4 is missing. ", "ethical_concerns": "N/A "}, "scores": {"overall": "4 = Strong: This paper is of significant interest (for broad or narrow sub-communities), and warrants acceptance in a top-tier *ACL venue if space allows.", "best_paper": "No", "replicability": "4 = They could mostly reproduce the results, but there may be some variation because of sample variance or minor variations in their interpretation of the protocol or method.", "datasets": "4 = Useful: I would recommend the new datasets to other researchers or developers for their ongoing work.", "software": "4 = Useful: I would recommend the new software to other researchers or developers for their ongoing work."}, "meta": {"license": "Copyright © 2021 administered by the Association for Computational Linguistics (ACL)\n                                on behalf of ACL content contributors: Xiachong Feng, and other contributors who wish to remain anonymous.\n                                Content is made available under a Creative Commons Attribution 4.0 International Public License.", "author_identity_guess": "1 = I do not have even an educated guess about author identity.", "confidence": "4 = Quite sure. I tried to check the important points carefully. It's unlikely, though conceivable, that I missed something that should affect my ratings.", "sentences": {"paper_summary": [[0, 89], [89, 177], [177, 308], [308, 398], [398, 509], [509, 571], [571, 773]], "summary_of_strengths": [[0, 3], [3, 48], [48, 52], [52, 131], [131, 135], [135, 159]], "summary_of_weaknesses": [[0, 3], [3, 82], [82, 86], [86, 237], [237, 358]], "comments,_suggestions_and_typos": [[0, 38]], "ethical_concerns": [[0, 4]]}}}]