[{"rid": "be6cec72e91dff753fdb9c845d57338bd9d32961eeeacc641530b7a6aa22fa6525b9a716e40cbc57d6ae3361e2af59063cbdfa0ea75f5c5def773d0ac9671733", "reviewer": null, "report": {"paper_summary": "The paper tackles the challenge of long documents/dialogs summarizations. \nIt presents a simple but efficient approach \"split-then-summarize\" using a greedy algorithm for choosing the good partition.\nThe experiments in the second part of the paper show a real improvement using this generic algorithm (agnostic to the used model)  over the naive baseline. ", "summary_of_strengths": "- The challenge that this paper tends to solve is a painful problem and the proposed solution is simple to implement and yields to good results.\n- The paper is well written and easy to follow and understand.\n- The set of experiments proving the efficiency of the method is good. ( not optimal) ", "summary_of_weaknesses": "- In the related work, you cite several approaches - It would be fair to compare the SummN results with the implementation of the reported approaches. \nComparing SummN to the naive Baseline (Bart) is obviously better, but what is the benefit of SummN over the previous solutions ? ", "comments,_suggestions_and_typos": "In the Target segmentation, it is not clear, what can we do when the number of sentences is lower than K ? \nIn section 5.6, could you please provide the Kappa ? "}, "scores": {"overall": "3.5 ", "best_paper": "No", "replicability": "5 = They could easily reproduce the results.", "datasets": "1 = No usable datasets submitted.", "software": "5 = Enabling: The newly released software should affect other people's choice of research or development projects to undertake."}, "meta": {"license": "Copyright © 2021 administered by the Association for Computational Linguistics (ACL)\n                                on behalf of ACL content contributors: None, and other contributors who wish to remain anonymous.\n                                Content is made available under a Creative Commons Attribution 4.0 International Public License.", "author_identity_guess": "1 = I do not have even an educated guess about author identity.", "confidence": "3 =  Pretty sure, but there's a chance I missed something. Although I have a good feel for this area in general, I did not carefully check the paper's details, e.g., the math or experimental design.", "sentences": {"paper_summary": [[0, 74], [74, 200], [200, 356]], "summary_of_strengths": [[0, 145], [145, 208], [208, 281], [281, 294]], "summary_of_weaknesses": [[0, 151], [151, 281]], "comments,_suggestions_and_typos": [[0, 107], [107, 161]]}}}, {"rid": "1aabeed5142e70ba517fcdcd99a98ec2b8cc181c3adc2d7e3835fc86b76f87ba809793d12e3007ed92591665ff31057928e7d9710e69f1a4790ff22521276401", "reviewer": null, "report": {"paper_summary": "The paper presents a framework for abstractive summarization of long documents that repeatedly segments text, summarizes each segment and then feeds the concatenated summaries as an input to the next iteration. When the input is below a predefined number of tokens, the final summary is generated. This design has the advantages of being able to use powerful pretrained models (e.g. BART) that are designed for shorter text, and avoiding expensive attention computation over long spans. ", "summary_of_strengths": "- The approach is simple, powerful and flexible - a good idea for applying powerful pretrained models to longer text without truncation.\n- A very comprehensive evaluation is provided with a good selection of datasets and both automatic and human evaluation which show the model’s clear advantage over baselines.\n- The paper is well-written and easy to understand. ", "summary_of_weaknesses": "- **Inefficient design of target segmentation**: If I understand correctly, all input segments are assigned a target segment. This probably causes unnecessary summarization of irrelevant input segments - if the text is massive and the gold summary is very short, why not ignore most of the input segments and only select sufficient input segments to cover the targets? Also, this allows targets to be duplicated over different input segments.  - **Missing analysis of model behavior**: It would be useful and interesting to know what exactly is happening at each stage, e.g. how much text is produced at each stage, and how noisy or detailed intermediate summaries look like.\n- **Missing analysis of empirical running time** ", "comments,_suggestions_and_typos": "**Suggestions** - Line 249: “Huge time costs” sounds very informal, maybe change to “considerable running time” or similar - Please indicate if f-score, precision or recall is used when ROUGE is mentioned - Follow-up on weakness 1): ignoring input segments could be implemented by assigning “empty” targets, e.g. using a single special token that when predicted would trigger a segment to be discarded in the next step.\n**Questions** - Table 9 in Appendix: what does “keyword emerged in gold summary” mean?\n- “Separate model for each stage” is mentioned, but I am still not sure whether this means 2 (fine and coarse) or N models?\n- Does the number of input segments at each coarse stage always stay the same as it was in stage 1, before reaching the fine-grained stage? "}, "scores": {"overall": "3.5 ", "best_paper": "No", "replicability": "4 = They could mostly reproduce the results, but there may be some variation because of sample variance or minor variations in their interpretation of the protocol or method.", "datasets": "1 = No usable datasets submitted.", "software": "1 = No usable software released."}, "meta": {"license": "Copyright © 2021 administered by the Association for Computational Linguistics (ACL)\n                                on behalf of ACL content contributors: None, and other contributors who wish to remain anonymous.\n                                Content is made available under a Creative Commons Attribution 4.0 International Public License.", "author_identity_guess": "1 = I do not have even an educated guess about author identity.", "confidence": "4 = Quite sure. I tried to check the important points carefully. It's unlikely, though conceivable, that I missed something that should affect my ratings.", "sentences": {"paper_summary": [[0, 211], [211, 298], [298, 487]], "summary_of_strengths": [[0, 137], [137, 312], [312, 364]], "summary_of_weaknesses": [[0, 126], [126, 369], [369, 443], [443, 444], [444, 676], [676, 725]], "comments,_suggestions_and_typos": [[0, 16], [16, 123], [123, 205], [205, 420], [420, 434], [434, 507], [507, 631], [631, 771]]}}}, {"rid": "3b15e747f73612a95dd26fe39bfd033c9467dd72b4a86155882deec21f871e5c45224bf5d7dde89433839928db505d7730508ab61cae08d59f00ce013ac5450b", "reviewer": null, "report": {"paper_summary": "This work approaches the task of long text summarization with a multi-stage framework, dealing with the input length limitation of modern Transformer-based models. In this work, the summarization is performed in N coarse-grained stages and one fine-grained final stage. The coarse stage aims to not only generate the coarse summary but also segment the input text. The coarse stage performs multiple times to gradually reduce the input length specific to the input length limitation of the backbone model. The training instances for the coarse stage are prepared with a greedy algorithm for aligning the source segments and the target segments. BART is adopted as the backbone summarization model. The proposed method was evaluated on both dialogue and written data. A total of five datasets are involved in the experiments. Experimental results show the proposed methodology outperforms baseline models in most cases. ", "summary_of_strengths": "- The work addresses a very practical and important issue in abstractive summarization. The length limitation of modern Transformer-based models forms a major barrier to long text summarization, while longer the document/dialogue, the higher the demand for summarization.  - The proposed method is model-agnostic where a variety of models can be chosen as the backbone summarizer. Table 6 shows all the three backbone models benefit from the multi-stage strategy. ", "summary_of_weaknesses": "- The computation cost can be an issue for the multi-stage generation. A measurement of the runtime can be supplied for comprehension. ", "comments,_suggestions_and_typos": "- I am curious about the number of total predictions to be made for a single input. As shown in Table 1, the number of N + 1 is 3 for the GovReport dataset. The total number of summarization to be performed is N + 1 or N^2 + 1? "}, "scores": {"overall": "3.5 ", "best_paper": "No", "replicability": "4 = They could mostly reproduce the results, but there may be some variation because of sample variance or minor variations in their interpretation of the protocol or method.", "datasets": "1 = No usable datasets submitted.", "software": "1 = No usable software released."}, "meta": {"license": "Copyright © 2021 administered by the Association for Computational Linguistics (ACL)\n                                on behalf of ACL content contributors: None, and other contributors who wish to remain anonymous.\n                                Content is made available under a Creative Commons Attribution 4.0 International Public License.", "author_identity_guess": "1 = I do not have even an educated guess about author identity.", "confidence": "4 = Quite sure. I tried to check the important points carefully. It's unlikely, though conceivable, that I missed something that should affect my ratings.", "sentences": {"paper_summary": [[0, 164], [164, 270], [270, 365], [365, 506], [506, 645], [645, 698], [698, 767], [767, 825], [825, 919]], "summary_of_strengths": [[0, 88], [88, 272], [272, 273], [273, 381], [381, 464]], "summary_of_weaknesses": [[0, 71], [71, 135]], "comments,_suggestions_and_typos": [[0, 84], [84, 157], [157, 228]]}}}]