[{"rid": "a47173d3ddf05abf2848f8d8f4b62e27a29d96f9ee08c41df22aac4a0d916604519328d5e7d92571d7a7539191546b9171a6d34c663f3d4359fd891400490220", "reviewer": null, "report": {"paper_summary": "This paper compares two figures, Firth and Harris, who are often cited as foundational in modern computational linguistics but who are rarely actually read, perhaps even not by the people who cite them. It does a deep dive into their work and takes an opinionated stance that Harris was “introverted”, focused on language as a system in isolation and Firth was extroverted, focusing on language as it exists in the world. ", "summary_of_strengths": "This is an interesting paper, of a type rarely seen at ACL venues: intellectual history with an opinionated thesis. I genuinely enjoyed reading it and learned from it. I imagine the same would be true for many folks in the ACL community.\nThere is some real scholarship here, as it investigates the works of these mid-20th c scholars, derives an opinionated synthesis, and applies it to modern NLP.\nGiven that NLP as a field is extremely forward-looking, often considering something even a year or two old to be ancient history, this is a valuable perspective. ", "summary_of_weaknesses": "The paper points out that Firth’s work is somewhat scattered and hard to get a clear grip on. Yet it ends up coming down at times in a way that feels to me a bit too much “Harris bad, Firth good”. The claim is that Firth’s views are well aligned with a strand of thought, currently popular in NLP (and well articulated in Bender & Koller’s position piece and Bisk et al.) that “you can’t learn language on the radio” and that language meaning needs to be in embedded context in a way that is heavily socially mediated. The argument is that, by contrast, Harris misses the boat on this.\nI wasn’t quite convinced on this point. It makes for an interesting contrast for the two thinkers, but it also seems to me to be a bit unfair to Harris since it’s hard to counterfactually reason about how Harris would have reacted to the current state of NLP. And I could imagine a variety of other arguments about the relevance of his work in NLP today. Firth’s positions are, according to the paper, admittedly sometimes murky and not always spelled out, which means it is easy to attribute a wider variety of perspectives to him. So I think there should be some caution in that framing.\nIt also seems possible that a “radically distributional”, like the kind attributed to Harris, could in fact capture a wide range of rich social contexts and individual variation. For instance, GPT-3 which is trained as if it’s trained on a single monolithic dialect, can be a quite effective code-switcher when prompted with different registers.\nI’ll mention one other thing, which isn’t really a weakness but is more of a meta-concern: One potential pitfall of submitting and publishing this kind of work in an ACL venue is that the reviewers (like me) and audience are not necessarily going to be experts in this methodology and so care should be taken to make sure it is well reviewed by people who have the relevant expertise. An example of the way in which ACL is not necessarily set up for this kind of work is that I have to select whether the work is reproducible: I picked \"1 = They would not be able to reproduce the results here no matter how hard they tried.\" since it's hard to imagine some other set of authors deciding to read Harris and Firth and writing the same paper :-).  But the broader point is that some of this veers methodologically into intellectual history, which I’m certainly not an expert in, and the ACL reviewing process is not necessarily set up to review a paper with this method. That's not a reason not to publish it! In fact, it's all the more reason to give it serious consdieration. But I think there should be some thought given to make sure the work is well evaluated. ", "comments,_suggestions_and_typos": "-The paper says that computational linguists routinely cite Harris and Firth. This is true of textbooks and big review papers. But my impression is that many in the ACL community do not engage with them at all. ", "ethical_concerns": "none "}, "scores": {"overall": "4 = This paper represents solid work, and is of significant interest for the (broad or narrow) sub-communities that might build on it.", "best_paper": "No", "datasets": "1 = No usable datasets submitted.", "software": "1 = No usable software released."}, "meta": {"license": "Copyright © 2021 administered by the Association for Computational Linguistics (ACL)\n                                on behalf of ACL content contributors: None, and other contributors who wish to remain anonymous.\n                                Content is made available under a Creative Commons Attribution 4.0 International Public License.", "author_identity_guess": "1 = I do not have even an educated guess about author identity.", "confidence": "2 =  Willing to defend my evaluation, but it is fairly likely that I missed some details, didn't understand some central points, or can't be sure about the novelty of the work.", "sentences": {"paper_summary": [[0, 203], [203, 422]], "summary_of_strengths": [[0, 116], [116, 168], [168, 238], [238, 398], [398, 560]], "summary_of_weaknesses": [[0, 94], [94, 197], [197, 519], [519, 586], [586, 626], [626, 846], [846, 941], [941, 1119], [1119, 1176], [1176, 1355], [1355, 1522], [1522, 1907], [1907, 2148], [2148, 2267], [2267, 2491], [2491, 2530], [2530, 2598], [2598, 2686]], "comments,_suggestions_and_typos": [[0, 78], [78, 127], [127, 211]], "ethical_concerns": [[0, 5]]}}}]