[{"rid": "46fa0e8ff8319c78c4d0e419f2735ffb60477afbb10340d2ffb687308457f82b39c8a3c13529ea51b4fc87a1cff65ad6659a61e1db517917d1ae054d8d4bcef5", "reviewer": null, "report": {"paper_summary": "This paper introduces LexGLUE, a new benchmark for language understanding for English legal texts. \nThe authors claim it is important to have a benchmark for this, as NLU is more and more used for applications in legal domains, but it is not so clear what works and what not. \nWith the easier access to datasets and tools for legal NLP, hope is also to introduce more interdisciplinary researchers to legal NLP and  speed up the adoption and transparent evaluation of new legal NLP methods. \nThe authors collect 7 datasets for legal NLP (Multi-label classification, Multi class classification, multiple choice QA). \nThey use a SVM baseline and different pretrained transformers on this task to get an initial performance picture ", "summary_of_strengths": "- Authors chose only publicly available datasets - Datasets have a variety of sizes and sub domains - Baseline evaluation with many different models - Nice ethics statement ", "summary_of_weaknesses": "- Only English, it is understandable and explained in the paper why that is but still sad - Only 2.5 different tasks (Multi-label classification, Multi class classification, multiple choice QA) - Datasets are not new, but just aggregated from other people ", "comments,_suggestions_and_typos": "It would be nice to hedge a bit more the NLU claim, as the tasks in this benchmark are mostly classification. NLU for me is more sematnic tasks NLI/QA/semantic parsing, relation extraction, ... "}, "scores": {"overall": "3.5 ", "best_paper": "No", "replicability": "5 = They could easily reproduce the results.", "datasets": "4 = Useful: I would recommend the new datasets to other researchers or developers for their ongoing work.", "software": "2 = Documentary: The new software will be useful to study or replicate the reported research, although for other purposes it may have limited interest or limited usability. (Still a positive rating)"}, "meta": {"license": "Copyright © 2021 administered by the Association for Computational Linguistics (ACL)\n                                on behalf of ACL content contributors: None, and other contributors who wish to remain anonymous.\n                                Content is made available under a Creative Commons Attribution 4.0 International Public License.", "author_identity_guess": "4 = From an allowed pre-existing preprint or workshop paper, I know/can guess at least one author's name.", "confidence": "3 =  Pretty sure, but there's a chance I missed something. Although I have a good feel for this area in general, I did not carefully check the paper's details, e.g., the math or experimental design.", "sentences": {"paper_summary": [[0, 99], [99, 276], [276, 491], [491, 615], [615, 729]], "summary_of_strengths": [[0, 49], [49, 100], [100, 149], [149, 173]], "summary_of_weaknesses": [[0, 90], [90, 194], [194, 256]], "comments,_suggestions_and_typos": [[0, 110], [110, 194]]}}}, {"rid": "21412b2c556d3d50fcf54acf27646c00528956d79cbc07cf51120afe37f86d66b6f14303525c6855037041e38d7696ac4e5ac21c515689e80c8acfe377506a2b", "reviewer": null, "report": {"paper_summary": "The authors present LexGLUE, a benchmark for legal language understanding. Their goal is that in releasing this benchmark, it will be easier to measure progress on legal language understanding, which currently has relatively fragmented resources and evaluations. They also release several baselines on the benchmark they release. ", "summary_of_strengths": "This is a well written paper that's motivation is quite clear. \nThe datasets/benchmarks gathered should be useful to researchers working on legal language understanding. ", "summary_of_weaknesses": "None of the datasets presented are actually new, rather these are just new splits and a packaging of existing resources into a benchmark. \nThe tasks require input texts of drastically different lengths, which a single model might not be very good at. \nThe baselines are a little bit old and arbitrary (no encoder-decoder models and only one type of hierarchical modeling). ", "comments,_suggestions_and_typos": "LexGLUE feels like kind of an odd name for a legal focused dataset 2 Line 231-232: s/access/assess 3 It feels odd to try to make only have english a desirable property of the benchmark, instead of a limitation 3.2  what does it mean articles cannot be violated? \nare these cases normally split chronologically? While this ensures a lack of overlap, it seems possible that each court produces a slightly different distribution of decisions. Is this type of out of distribution evaluation intended?\n4.2 Why are all of the models tested encoder-only? Why no encoder-decoder models like T5? \nBERT-like models etc. not that good at storing sentence encoding representations in the CLS token (see e.g., Fast, Effective, and Self-Supervised: Transforming Masked Language Models into Universal Lexical and Sentence Encoders (Liu et al 2021) or Condenser: a Pre-training Architecture for Dense Retrieval (Gao & Callan 2021), so difficult to conclude these baselines are particularly strong. In general, hierarchical modeling seems to be its own task area, where both different pretraining techniques might produce better sentence encodings and different methods of hierarchical modeling may produce better overall results. \nThis baseline seems to combine tasks of various different lengths – do you expect the same models to be good at both? Is it even important for one model to be good at both?\n5.2: feels a bit hard to say that your result clearly favors the legal models -- 13 total results, 6 of which the legal models do the best Why is there no “overall” score reported, like there is with GLUE? ", "ethical_concerns": "a bit unclear if legal == ethical, esp. as sometimes things at small scale can be ethical but at large scale become less so Models that are better at predicting the outcome of a court case, for instance, could be entrenching existing biases that the criminal justice system has "}, "scores": {"overall": "3 = Good: This paper is of interest to the *ACL audience and could be published, but might not be appropriate for a top-tier publication venue. It would likely be a strong paper in a suitable workshop.", "best_paper": "No", "replicability": "4 = They could mostly reproduce the results, but there may be some variation because of sample variance or minor variations in their interpretation of the protocol or method.", "datasets": "3 = Potentially useful: Someone might find the new datasets useful for their work.", "software": "1 = No usable software released."}, "meta": {"license": "Copyright © 2021 administered by the Association for Computational Linguistics (ACL)\n                                on behalf of ACL content contributors: None, and other contributors who wish to remain anonymous.\n                                Content is made available under a Creative Commons Attribution 4.0 International Public License.", "author_identity_guess": "1 = I do not have even an educated guess about author identity.", "confidence": "2 =  Willing to defend my evaluation, but it is fairly likely that I missed some details, didn't understand some central points, or can't be sure about the novelty of the work.", "sentences": {"paper_summary": [[0, 75], [75, 263], [263, 330]], "summary_of_strengths": [[0, 63], [63, 170]], "summary_of_weaknesses": [[0, 138], [138, 251], [251, 373]], "comments,_suggestions_and_typos": [[0, 67], [67, 99], [99, 210], [210, 262], [262, 311], [311, 440], [440, 497], [497, 548], [548, 587], [587, 610], [610, 982], [982, 1214], [1214, 1333], [1333, 1388], [1388, 1594]], "ethical_concerns": [[0, 40], [40, 278]]}}}, {"rid": "da6008c2bf458c661d5db072d4a625db2e3a9d4f034642eee0355748cf8ba843e9accac0b2b5b22ef8ea4bf060ed1bef2a5ee652d94a1d9c669b3f9b2aa32b1a", "reviewer": "Bashar Alhafni", "report": {"paper_summary": "The authors introduce LexGLUE, a benchmark dataset to evaluate the performance of NLP models in legal NLU tasks. LexGLUE is based on seven English publicly available legal NLP datasets, selected using criteria largely from SuperGLUE. The datasets span text classification (6 datasets) and legal question answering (1 dataset) tasks. The authors introduced several simplifications to the datasets to make the benchmark more standardized and easily accessible. ", "summary_of_strengths": "1) The paper is very clear and well written. \n2) I believe that the legal NLP community will definitely benefit from a standardized and easily accessible benchmark to help facilitate and encourage research on legal NLP. \n3) LexGLUE could also encourage future work to push towards generalized models that could handle various legal NLP tasks with limited annotated data. ", "summary_of_weaknesses": "1) Although the authors provide a very clear description of the various tasks and datasets that are included in LexGLUE, it would be helpful for the readers to see examples of what the input(s)/output(s) are for each task as part of the Appendix. ", "comments,_suggestions_and_typos": "See weaknesses. "}, "scores": {"overall": "4 = Strong: This paper is of significant interest (for broad or narrow sub-communities), and warrants acceptance in a top-tier *ACL venue if space allows.", "best_paper": "No", "replicability": "5 = They could easily reproduce the results.", "datasets": "5 = Enabling: The newly released datasets should affect other people's choice of research or development projects to undertake.", "software": "5 = Enabling: The newly released software should affect other people's choice of research or development projects to undertake."}, "meta": {"license": "Copyright © 2021 administered by the Association for Computational Linguistics (ACL)\n                                on behalf of ACL content contributors: Bashar Alhafni, and other contributors who wish to remain anonymous.\n                                Content is made available under a Creative Commons Attribution 4.0 International Public License.", "author_identity_guess": "4 = From an allowed pre-existing preprint or workshop paper, I know/can guess at least one author's name.", "confidence": "4 = Quite sure. I tried to check the important points carefully. It's unlikely, though conceivable, that I missed something that should affect my ratings.", "sentences": {"paper_summary": [[0, 113], [113, 234], [234, 333], [333, 459]], "summary_of_strengths": [[0, 45], [45, 220], [220, 371]], "summary_of_weaknesses": [[0, 247]], "comments,_suggestions_and_typos": [[0, 16]]}}}]