[{"rid": "cf042f2488f47016af123f2a468a503b92a3114fade995fd8d6fa7eaed3e87d5d765d404aabc84169ca045b9cd294a29f97a75bf77527356b42170694f5ceaf7", "reviewer": null, "report": {"paper_summary": "Below is a copy from the previous review: >In this paper the authors proposed a new fairness metric, accumulated prediction sensitivity. The authors formulate the metric and establish its properties in relationship with group fairness and individual fairness. Interestingly, the authors measure the correlation of the proposed metric with a human judgment of fairness. Since the proposed metric requires a choice of the way of computing two hyperparameter vectors, the authors experiment with different choices and show that this choice matters quite a lot. ", "summary_of_strengths": "Below is a copy from the previous review: > - Important direction of research > - Relatively good correlation with human judgment > - The authors evaluated several choices of the metric > - Intuitive formulation of the metric > - Clearly written and easy to follow paper ", "summary_of_weaknesses": "Below is a copy from the previous review: > - Need of choice of the two hyperparameters vectors w and v > - This choice, as evident from the authors experiments, is very important > - Process of obtaining v can be quite involved > - The proposed metric works only or gradient-based models > - Although the formulation is intuitive, the metric values themselves can be hard to interpret. ", "comments,_suggestions_and_typos": "The authors addressed most of the reviewers' comments made for the previous submission. This is an important direction of research and I believe in the current state the paper can be accepted for publication. "}, "scores": {"overall": "4 = Strong: This paper is of significant interest (for broad or narrow sub-communities), and warrants acceptance in a top-tier *ACL venue if space allows.", "best_paper": "No", "replicability": "3 = They could reproduce the results with some difficulty. The settings of parameters are underspecified or subjectively determined, and/or the training/evaluation data are not widely available.", "datasets": "1 = No usable datasets submitted.", "software": "1 = No usable software released."}, "meta": {"license": "Copyright © 2021 administered by the Association for Computational Linguistics (ACL)\n                                on behalf of ACL content contributors: None, and other contributors who wish to remain anonymous.\n                                Content is made available under a Creative Commons Attribution 4.0 International Public License.", "author_identity_guess": "1 = I do not have even an educated guess about author identity.", "confidence": "3 =  Pretty sure, but there's a chance I missed something. Although I have a good feel for this area in general, I did not carefully check the paper's details, e.g., the math or experimental design.", "sentences": {"paper_summary": [[0, 137], [137, 260], [260, 369], [369, 558]], "summary_of_strengths": [[0, 271]], "summary_of_weaknesses": [[0, 387]], "comments,_suggestions_and_typos": [[0, 88], [88, 209]]}}}, {"rid": "cd54453bcc2a38395d51c0b87caab0982cc265f866fa755023c2e1dfef96cc8130d4ddc3d6cc08427cec568cd8abefc795f28845813e912744009b5badfbfce8", "reviewer": null, "report": {"paper_summary": "This paper proposed a new machine learning model fairness metric based on the prediction sensitivity. The paper also showed its theoretical connection to group fairness and individual fairness. ", "summary_of_strengths": "- The paper proposed a new fairness metric accumulated prediction sensitivity to measure the model prediction change with respect to the change of the protected features.\n- The paper showed theoretical relations between accumulated prediction sensitivity and group/individual fairness.\n- The evaluation is conducted on multiple datasets. The author explained the reason to only compare with CF baseline. ", "summary_of_weaknesses": "It seems that the main focus in the experiment is \"gender-ness\" of words (e.g., he, she, etc.) based on the description and qualitative examples. How about many other cases? For example: - Same words with different senses in different sentences: \" book an Italian trip for me\" vs \"i want an Italian trip book\" - Different verbs/prepositions: \"she takes the flight to new york city\" vs \"she works in the flight to new york city\" ", "comments,_suggestions_and_typos": "Please see the above reviews. "}, "scores": {"overall": "3.5 ", "best_paper": "No", "replicability": "3 = They could reproduce the results with some difficulty. The settings of parameters are underspecified or subjectively determined, and/or the training/evaluation data are not widely available.", "datasets": "1 = No usable datasets submitted.", "software": "1 = No usable software released."}, "meta": {"license": "Copyright © 2021 administered by the Association for Computational Linguistics (ACL)\n                                on behalf of ACL content contributors: None, and other contributors who wish to remain anonymous.\n                                Content is made available under a Creative Commons Attribution 4.0 International Public License.", "author_identity_guess": "1 = I do not have even an educated guess about author identity.", "confidence": "4 = Quite sure. I tried to check the important points carefully. It's unlikely, though conceivable, that I missed something that should affect my ratings.", "sentences": {"paper_summary": [[0, 102], [102, 194]], "summary_of_strengths": [[0, 171], [171, 286], [286, 338], [338, 404]], "summary_of_weaknesses": [[0, 95], [95, 146], [146, 174], [174, 187], [187, 310], [310, 428]], "comments,_suggestions_and_typos": [[0, 30]]}}}]