[{"rid": "64d426bdd2237b1a76367942d93054e27cbba57122d341c186e2724c64f32ea70276be64edd40415fcfa2a55ffb540f5d6e8d89acd4ac1bf95878ac359286fa7", "reviewer": null, "report": {"paper_summary": "This paper proposes, as a form of data augmentation, to replace the one-hot sequences that are typically consumed by text classification models with an interpoloation between this one-hot distribution and a distribution over word-types obtained by running the sequence through BERT. The authors show that this form of augmentation helps on its own as well as when combined with other standard data augmentation techniques. ", "summary_of_strengths": "- The paper obtains good results with a straightforward approach.\n- The paper is written fairly clearly. ", "summary_of_weaknesses": "- The paper needs some light editing (especially Section 4.1) but I don't see any significant weaknesses. ", "comments,_suggestions_and_typos": "- One thing I wasn't sure I understood is whether the \"smoothed\" inputs are used on their own to train the model, or if they're used in addition to the standard inputs. Lines 236-239 make me think they're used in addition. This is fine, but should be emphasized more explicitly.\n- Since, as the authors note, they are are merely approximating the token-distribution given by BERT (by not using any MASK tokens), it might be interesting to see whether this approximation is in fact hurting the performance or not. That is, if we obtain token-level distributions by masking each token in the input in turn, and then use the resulting smoothed representations, is this better or worse for augmentation than the approximation the authors propose? "}, "scores": {"overall": "4 = Strong: This paper is of significant interest (for broad or narrow sub-communities), and warrants acceptance in a top-tier *ACL venue if space allows.", "best_paper": "No", "replicability": "5 = They could easily reproduce the results.", "datasets": "1 = No usable datasets submitted.", "software": "4 = Useful: I would recommend the new software to other researchers or developers for their ongoing work."}, "meta": {"license": "Copyright © 2021 administered by the Association for Computational Linguistics (ACL)\n                                on behalf of ACL content contributors: None, and other contributors who wish to remain anonymous.\n                                Content is made available under a Creative Commons Attribution 4.0 International Public License.", "author_identity_guess": "1 = I do not have even an educated guess about author identity.", "confidence": "3 =  Pretty sure, but there's a chance I missed something. Although I have a good feel for this area in general, I did not carefully check the paper's details, e.g., the math or experimental design.", "sentences": {"paper_summary": [[0, 283], [283, 423]], "summary_of_strengths": [[0, 66], [66, 105]], "summary_of_weaknesses": [[0, 106]], "comments,_suggestions_and_typos": [[0, 169], [169, 223], [223, 279], [279, 513], [513, 743]]}}}, {"rid": "0ac9820142b39e37945bfc25038d562d36d08e5407ab516a8f8eb18cc7a696601df7e15caa23159bf9ef420a1e65efadf3778d71d4aa95df26226ff49de26bb3", "reviewer": null, "report": {"paper_summary": "The paper proposes a data augmentation method using a controllable smoothed representation, which is obtained by combining the one-hot representation and the smooth representation through masked language modeling. The authors showed the effectiveness of the proposed method on low-resourced sentence classification task. They also found that the smooth representation can be used on other data augmentation method to achieve better results. ", "summary_of_strengths": "- The paper is well-structured. The authors explained the motivation and the methodology clearly. Figure 1 and 2 are informative and help the readers understand better understand the method.\n- It is nice that the text smoothing can be combined with other data augmentation approaches to achieve better performances. ", "summary_of_weaknesses": "- The main weaknesses of the paper are the experiments, which is understandable for a short paper but I'd still expect it to be stronger. First, the setting is only on extremely low-resource regime, which is not the only case we want to use data augmentation in real-world applications. Also, sentence classification is an easier task. I feel like the proposed augmentation method has potential to be used on more NLP tasks, which was unfortunately not shown.\n- The proposed mixup strategy is very simple (Equation 5), I wonder if the authors have tried other ways to interpolate the one-hot vector with the MLM smoothed vector. ", "comments,_suggestions_and_typos": "- How does \\lambda influence the performances?\n- How does the augmentation method compare to other baselines with more training data? "}, "scores": {"overall": "3 = Good: This paper is of interest to the *ACL audience and could be published, but might not be appropriate for a top-tier publication venue. It would likely be a strong paper in a suitable workshop.", "best_paper": "No", "replicability": "4 = They could mostly reproduce the results, but there may be some variation because of sample variance or minor variations in their interpretation of the protocol or method.", "datasets": "1 = No usable datasets submitted.", "software": "3 = Potentially useful: Someone might find the new software useful for their work."}, "meta": {"license": "Copyright © 2021 administered by the Association for Computational Linguistics (ACL)\n                                on behalf of ACL content contributors: None, and other contributors who wish to remain anonymous.\n                                Content is made available under a Creative Commons Attribution 4.0 International Public License.", "author_identity_guess": "1 = I do not have even an educated guess about author identity.", "confidence": "4 = Quite sure. I tried to check the important points carefully. It's unlikely, though conceivable, that I missed something that should affect my ratings.", "sentences": {"paper_summary": [[0, 214], [214, 321], [321, 441]], "summary_of_strengths": [[0, 32], [32, 98], [98, 191], [191, 316]], "summary_of_weaknesses": [[0, 138], [138, 287], [287, 336], [336, 460], [460, 629]], "comments,_suggestions_and_typos": [[0, 47], [47, 134]]}}}, {"rid": "c6ac27ad9dd330a6c0d139fea8c0115c634caee678a5868fef6c613fe519c0457b25bfe2df08741630166891caaebcbac86f624ad1b6207df4192f30d25f0a3f", "reviewer": "Sanqiang Zhao", "report": {"paper_summary": "The paper introduces a text smoothing approach and uses it in different downstream tasks. Different types of sentence classification tasks are improved by using such text smoothing method. ", "summary_of_strengths": "The paper demonstrate improvement from using proposed text smoothing method. ", "summary_of_weaknesses": "This paper does not make a significant contribution. Smoothed Representation and Mixup Strategy are not proposed by the authors. Moreover, the strategy is too simple to combine the one-hot representation and smoothed representation with a weight parameter lambda.\nThree low-resource sentence classification tasks are used in the experiments. Even more lower-resource task classifications are missed, such as MRPC in GLUE.  It lacks the configuration of lambda, I believe this can greatly affect performance.\nI am still unsure about the motivation, the high probability of \"average\" is only due to MLM. Nevertheless, the semantic meaning of \"average\" is learned by MLM and a downstream task like sentiment analysis would only care about its semantic meaning. ", "comments,_suggestions_and_typos": "One of the biggest problems is that motivation is not convincing. I think it would be better to have examples of different predictions using your text smoothing approach. In Figure 2, how does the \"average\" likely affect the sentiment analysis label?\nThough some of the tasks aren't very useful, I believe more classification tasks should be conducted. In my experience of GLUE, SST and MNLI are two of the most resourceful sentence classification tasks compared to other tasks in GLUE. "}, "scores": {"overall": "2 = Borderline: This paper has some merit, but also significant flaws. It does not warrant publication at top-tier venues, but might still be a good pick for workshops.", "best_paper": "No", "replicability": "5 = They could easily reproduce the results.", "datasets": "1 = No usable datasets submitted.", "software": "1 = No usable software released."}, "meta": {"license": "Copyright © 2021 administered by the Association for Computational Linguistics (ACL)\n                                on behalf of ACL content contributors: Sanqiang Zhao, and other contributors who wish to remain anonymous.\n                                Content is made available under a Creative Commons Attribution 4.0 International Public License.", "author_identity_guess": "1 = I do not have even an educated guess about author identity.", "confidence": "3 =  Pretty sure, but there's a chance I missed something. Although I have a good feel for this area in general, I did not carefully check the paper's details, e.g., the math or experimental design.", "sentences": {"paper_summary": [[0, 90], [90, 189]], "summary_of_strengths": [[0, 77]], "summary_of_weaknesses": [[0, 53], [53, 129], [129, 264], [264, 342], [342, 422], [422, 423], [423, 508], [508, 602], [602, 758]], "comments,_suggestions_and_typos": [[0, 66], [66, 171], [171, 251], [251, 353], [353, 487]]}}}, {"rid": "ee5e4ca21e0a5335fdb764ce2fe1636d41f84b13ddb546252f94075398b80fb071e33f60d189833f839aa8eaceff519c009e91e1c79ba5ec08a2c632894cc69f", "reviewer": "Shuhuai Ren", "report": {"paper_summary": "This paper proposes a data augmentation technique named Text Smoothing, which converts sentences from their one-hot representations to controllable smoothed representations. Specifically, the authors multiply the output of a pre-trained BERT with the word embedding matrix to get the smoothed representation of an input token. Then the smoothed representation is combined with the one-hot representation by mixup to get the mixed representation. Using such mixed representation instead of the one-hot representation as the token input can be regarded as a kind of data augmentation and can significantly improve the model performance in the low-resource regime. ", "summary_of_strengths": "__1. The paper is well organized and easy to follow.__\n__2. The proposed method is novel and interesting:__ The idea of mixing the one-hot representation and the LM (smoothed) representation for an input token is very different from other works of data augmentation. It uses the knowledge of pre-trained BERT to integrate and compress information of multiple related words, providing richer semantics that a single token in the one-hot form cannot provide.  __3. The experimental results are impressive:__ The improvement brought by text smoothing is very significant and surpasses many strong baselines. Besides, the text smoothing can be also well combined with various data augmentation methods, showing great practicability and universality. ", "summary_of_weaknesses": "__1. Lack of significance test:__      I'm glad to see the paper reports the standard deviation of accuracy among 15 runs. However, the standard deviation of the proposed method overlaps significantly with that of the best baseline, which raises my concern about whether the improvement is statistically significant. It would be better to conduct a significance test on the experimental results. \n     __2. Anomalous result:__ According to Table 3, the performance of BARTword and BARTspan on SST-2 degrades a lot after incorporating text smoothing, why?\n__3. Lack of experimental results on more datasets:__ I suggest conducting experiments on more datasets to make a more comprehensive evaluation of the proposed method. The experiments on the full dataset instead of that in the low-resource regime are also encouraged.\n__4. Lack of some technical details:__ __4.1__. Is the smoothed representation all calculated based on pre-trained BERT, even when the text smoothing method is adapted to GPT2 and BART models (e.g., GPT2context, BARTword, etc.)? \n     __4.2__. What is the value of the hyperparameter lambda of the mixup in the experiments? Will the setting of this hyperparameter have a great impact on the result? \n     __4.3__. Generally, traditional data augmentation methods have the setting of __augmentation magnification__, i.e., the number of augmented samples generated for each original sample. Is there such a setting in the proposed method? If so, how many augmented samples are synthesized for each original sample? ", "comments,_suggestions_and_typos": "1. Some items in Table 2 and Table 3 have Spaces between accuracy and standard deviation, and some items don't, which affects beauty.\n2. The number of BARTword + text smoothing and BARTspan + text smoothing on SST-2 in Table 3 should NOT be in bold as they cause degeneration of the performance.\n3. I suggest Listening 1 to reflect the process of sending interpolated_repr into the task model to get the final representation "}, "scores": {"overall": "4 = Strong: This paper is of significant interest (for broad or narrow sub-communities), and warrants acceptance in a top-tier *ACL venue if space allows.", "best_paper": "No", "replicability": "3 = They could reproduce the results with some difficulty. The settings of parameters are underspecified or subjectively determined, and/or the training/evaluation data are not widely available.", "datasets": "1 = No usable datasets submitted.", "software": "3 = Potentially useful: Someone might find the new software useful for their work."}, "meta": {"license": "Copyright © 2021 administered by the Association for Computational Linguistics (ACL)\n                                on behalf of ACL content contributors: Shuhuai Ren, and other contributors who wish to remain anonymous.\n                                Content is made available under a Creative Commons Attribution 4.0 International Public License.", "author_identity_guess": "1 = I do not have even an educated guess about author identity.", "confidence": "4 = Quite sure. I tried to check the important points carefully. It's unlikely, though conceivable, that I missed something that should affect my ratings.", "sentences": {"paper_summary": [[0, 174], [174, 327], [327, 446], [446, 662]], "summary_of_strengths": [[0, 5], [5, 55], [55, 60], [60, 108], [108, 267], [267, 457], [457, 458], [458, 463], [463, 506], [506, 605], [605, 746]], "summary_of_weaknesses": [[0, 5], [5, 123], [123, 317], [317, 396], [396, 407], [407, 427], [427, 555], [555, 560], [560, 609], [609, 723], [723, 823], [823, 828], [828, 862], [862, 1052], [1052, 1147], [1147, 1222], [1222, 1412], [1412, 1460], [1460, 1536]], "comments,_suggestions_and_typos": [[0, 3], [3, 134], [134, 137], [137, 296], [296, 299], [299, 425]]}}}]