[{"rid": "7bd274f90b74323501513a52410d7c58b8629cb10f9396a73e0b9acb30c62c06109a30503eeb22875b1ebd3cc2f6e4afcf2a9052020d18d30fa2a2192f56df03", "reviewer": null, "report": {"paper_summary": "This paper introduces **natural instructions**, a collection of 61 tasks in natural language processing, featuring the actual instructions used in the crowdsourcing process of the original NLP tasks. These instructions are mapped to a unified schema which include definition, prompt, positive/negative examples etc. ( Fig. 4). Extensive experiments are done with BART and GPT-3. Results suggest that (1) instructions help improve cross-task generalization; (2) increasing the number of tasks leads to better generalization; (3) negative examples are unexpectedly not helpful. ", "summary_of_strengths": "1. \tThe paper studies the interesting and important problem of cross-task generalization (generalization to held-out unseen tasks). The findings may be useful to the ACL audience. \n2. \tNatural instructions re-uses existing resources (instructions to crowd-workers) smartly. It provides a realistic learning/instruction-taking environment. Natural instructions is a valuable and unique resource complementary to the concurrent work of PromptSource and FLAN. \n3. \tCareful experiment design (three aspects of generalization: category, dataset, task). Detailed ablation and analysis in the appendix. ", "summary_of_weaknesses": "Below are some minor suggestions or questions.\n- In the future version, if space allows,    * please add examples of each category (table 2) so the reader can better understand the difficulty of each category. For the analysis in Line 469-486, it’s hard to understand the hypothesis without looking at what the instruction looks like for each category. \n  * please move some interesting analysis in the appendix to the main body (ablation of elements, error analysis).  - The datasets included in the paper are mainly related to QA. The classification category is also quite specific, e.g., classifying answer type/answerability. I wonder if the schema is extensive enough for general text classification tasks and general NLP tasks. ", "comments,_suggestions_and_typos": "See comments above. "}, "scores": {"overall": "4 = Strong: This paper is of significant interest (for broad or narrow sub-communities), and warrants acceptance in a top-tier *ACL venue if space allows.", "best_paper": "No", "replicability": "4 = They could mostly reproduce the results, but there may be some variation because of sample variance or minor variations in their interpretation of the protocol or method.", "datasets": "4 = Useful: I would recommend the new datasets to other researchers or developers for their ongoing work.", "software": "3 = Potentially useful: Someone might find the new software useful for their work."}, "meta": {"license": "Copyright © 2021 administered by the Association for Computational Linguistics (ACL)\n                                on behalf of ACL content contributors: None, and other contributors who wish to remain anonymous.\n                                Content is made available under a Creative Commons Attribution 4.0 International Public License.", "author_identity_guess": "4 = From an allowed pre-existing preprint or workshop paper, I know/can guess at least one author's name.", "confidence": "3 =  Pretty sure, but there's a chance I missed something. Although I have a good feel for this area in general, I did not carefully check the paper's details, e.g., the math or experimental design.", "sentences": {"paper_summary": [[0, 200], [200, 318], [318, 327], [327, 379], [379, 576]], "summary_of_strengths": [[0, 3], [3, 132], [132, 180], [180, 184], [184, 274], [274, 339], [339, 457], [457, 461], [461, 548], [548, 596]], "summary_of_weaknesses": [[0, 47], [47, 210], [210, 353], [353, 469], [469, 470], [470, 533], [533, 630], [630, 734]], "comments,_suggestions_and_typos": [[0, 20]]}}}, {"rid": "08afb6e46460902c8ff65f0edb3dcae43d21a721d44a331d53a061e3fea8f8b4f78cfa27450d6ea1bd098dc8156bb4b09330f0c74487eb7bd7ad96ae2aa7d48d", "reviewer": null, "report": {"paper_summary": "The paper introduces NATURAL INSTRUCTIONS - a benchmark to measure cross-task generalization of models that learn tasks from natural language instructions. To prepare the benchmark, the authors consider several downstream tasks (and corresponding subtasks) from various existing benchmarks. To create the task instructions, the authors solicit the crowdsourcing instructions from authors of existing benchmarks, modify and adapt them into a common schema. The authors empirically find that providing instructions about a task in natural language (in a structured format specifying role of each section in an instruction, such as definition, prompt, etc.) improves model performance on cross-task generalization. ", "summary_of_strengths": "1. Strong benchmark to judge cross-task generalization and also study human-like training setup for AI systems. \n2. Empirical results show that when instructions in natural language when properly structured (like definition, task prompt, positive examples, etc.) are provided to a model (BART and GPT-3) improves cross-task generalization performance. \n3. The authors discuss benchmark creation steps in detail. \n4. Error analysis and ablation of various components of task instructions are provided in detail which can be helpful to the community. ", "summary_of_weaknesses": "1. \" In comparison to GPT3, the BART model trained on seen tasks achieves stronger performance despite being x 1k smaller than GPT3\" --  this seems a bit wrong/misguiding as I think the BART model is fine-tuned whereas GPT3 is not? \n2. I would suggest adding examples of the \"Verification\" task type in the paper(main or appendix) as this task type has been discussed in error analysis. Without actual examples of the task, it's difficult to follow the text in the paper. \n3. For leave-one-out-task experiments it's unclear why the numbers are much lower than Table 3. It's mentioned that \"Note that the absolute values, across different encodings, are lower than the numbers in Table 3 which is likely due to the difficulty of this setup compared to the random split\" - but won't the leave-one-out-task be easier or at least comparable to random split as now the training task collection contains all other dataset as well as other tasks from the same dataset ? ", "comments,_suggestions_and_typos": "L#538:  cases --> case L#540: works --> work "}, "scores": {"overall": "4 = Strong: This paper is of significant interest (for broad or narrow sub-communities), and warrants acceptance in a top-tier *ACL venue if space allows.", "best_paper": "No", "replicability": "4 = They could mostly reproduce the results, but there may be some variation because of sample variance or minor variations in their interpretation of the protocol or method.", "datasets": "5 = Enabling: The newly released datasets should affect other people's choice of research or development projects to undertake.", "software": "5 = Enabling: The newly released software should affect other people's choice of research or development projects to undertake."}, "meta": {"license": "Copyright © 2021 administered by the Association for Computational Linguistics (ACL)\n                                on behalf of ACL content contributors: None, and other contributors who wish to remain anonymous.\n                                Content is made available under a Creative Commons Attribution 4.0 International Public License.", "author_identity_guess": "4 = From an allowed pre-existing preprint or workshop paper, I know/can guess at least one author's name.", "confidence": "4 = Quite sure. I tried to check the important points carefully. It's unlikely, though conceivable, that I missed something that should affect my ratings.", "sentences": {"paper_summary": [[0, 156], [156, 291], [291, 456], [456, 655], [655, 712]], "summary_of_strengths": [[0, 3], [3, 112], [112, 116], [116, 263], [263, 352], [352, 356], [356, 412], [412, 416], [416, 549]], "summary_of_weaknesses": [[0, 5], [5, 232], [232, 236], [236, 387], [387, 472], [472, 476], [476, 569], [569, 963]], "comments,_suggestions_and_typos": [[0, 45]]}}}]