[{"rid": "0", "reviewer": null, "report": {"main": "This paper presents a new large-scale dataset for  graph2text generation. \nStrengths - interesting and comprehensive comparison of the new dataset with existing ones - dataset is much larger than previous ones, covering many topics Weaknesses Clarity - Introduction is unclear. What \"unsupervised datasets\" are is not explained? the four requirements are presented but not clearly justified - When desiderata are described in detail they refer to 'unsupervised data-to-text models,' that have not been discussed in any ways. They are only briefly described too late in the paper,  at the end in the evaluation section. They should be presented upfront so that the desiderata would be justified more clearly - the first requirement then is very confusing \"Text and graphs should have similar contents, such as a Wikipedia article and a knowledge graph of the same article.\" Isn't this what you need for supervised graph2text?\n- the second one \"To fit for recent unsupervised models...\"  this is an example of why recent unsupervised models should have been explained upfront to justify this requirement.\n- Specific questions on  Sec4  \"and use the titles of these articles to query their corresponding knowledge graphs from DBPedia\" so it is only a matter of retrieving an already existing graph?\n- \"relations that are unlikely to be described in text such as “latitude” and “longitude.”\" how many relations are of this type? what is the accuracy of this heuristic?\n- Step 4 sounds very heuristics. why 10? Was it tested in any ways? ( see more general concerns about quality of the data) - sect 4.2 describes a critical process but no data is presented. how many changes and what changes did the annotators perform on average? this would give you an estimate of the quality of the automatic method you are proposing. You could assess indirectly the quality of the different heuristics used to build the corpus.\ntypos datasets inherent the small size at lease one "}, "scores": {"overall": "2", "Originality": "3", "Readability_clarity": "2", "Relevance": "5", "Reproducibility": "2", "Substance": "3"}, "meta": {"license": "No individual license attached", "REVIEWER_CONFIDENCE": "4", "sentences": {"main": [[0, 74], [74, 85], [85, 166], [166, 243], [243, 251], [251, 278], [278, 329], [329, 391], [391, 525], [525, 619], [619, 707], [707, 873], [873, 925], [925, 1103], [1103, 1296], [1296, 1388], [1388, 1425], [1425, 1465], [1465, 1498], [1498, 1506], [1506, 1535], [1535, 1588], [1588, 1654], [1654, 1727], [1727, 1817], [1817, 1911], [1911, 1917], [1917, 1950], [1950, 1963]]}}}, {"rid": "1", "reviewer": null, "report": {"main": "In this paper, the authors present a new dataset for unsupervised data-to-text generation compiled from existing manually and automatically annotated datasets. The paper is clearly written, and the description of the dataset is extensive and clearly detailed. The dataset is likely to be of great value for the community.\nThe authors also evaluate their dataset by testing some off-the-shelf generators and show that some systems achieve high scores in terms of automatic evaluations. It would be a great addition to provide a human assessment of the outputs in order to fully demonstrate the usefulness (and limitations) of the presented data.\n- Intro: Even though it looks obvious, explain clearly why the need to have non-parallel data.\n- 4.1 Step1: Do you have any insights with respect to the quality of the tokenization, i.e. the type of errors observed in the processed data?\n- 4.1 Step2: Is it possible to provide a full list of the relations that are kept as supplementary material?\n- 4.1 Step3: See the paper of Castro Ferreira et al, who performed a similar task manually; https://www.aclweb.org/anthology/W18-6521.pdf - 4.1 Step4: Is there a mechanism to ensure that the text does not express more than the input triples? What are the specific challenges here?\n- 4.3: According to the WebNLG 2020 website, there were 15 categories  in 2017:  “The 10 seen categories used in 2017: Airport, Astronaut, Building, City, ComicsCharacter, Food, Monument, SportsTeam, University, and WrittenWork. The 5 unseen categories of 2017, which will now be part of the seen data: Athlete, Artist, CelestialBody, MeanOfTransportation, Politician.” \nAlso, the number of reported data-text pairs is over 25,000 (https://www.aclweb.org/anthology/W17-3518.pdf) Typos/style: - DBPedia -> DBpedia - Conclusions: “which implies that even WebNLG and GenWiki” -> even though? "}, "scores": {"overall": "4", "Originality": "4", "Readability_clarity": "5", "Relevance": "5", "Reproducibility": "4", "Substance": "4"}, "meta": {"license": "No individual license attached", "REVIEWER_CONFIDENCE": "4", "sentences": {"main": [[0, 160], [160, 260], [260, 322], [322, 485], [485, 645], [645, 740], [740, 883], [883, 992], [992, 1130], [1130, 1234], [1234, 1273], [1273, 1502], [1502, 1643], [1643, 1752], [1752, 1765], [1765, 1786], [1786, 1862]]}}}]