[{"rid": "0", "reviewer": null, "report": {"main": "This paper presents a two-level annotation scheme for interpretation of modality in human-robot dialogues. The first level of the proposed scheme is a fine-grained annotation of modality, the second level encodes pragmatic information to interpretation of modal expressions in the context of dialogue. Finally, the authors introduce some constraints to help discriminate the interpretation of modality in dialogue and make annotation feasible. The authors employ four annotators to apply the annotation scheme based on SCOUT corpus, with the annotation results showing good agreement. This paper also presents theoretical analysis towards a formal theory of modality in human-robot dialogues.\nOverall, this paper is well organized and clearly written. Modal expressions reflect and create participant relations, which are crucial for interaction in dialogue settings. This paper aims to address a key question that how to annotate the interaction of vagueness and ambiguity in natural language. It is novel and worth exploring for further research.  Strength: 1. This paper is clearly written and it contributes a novel annotation scheme to the interpretation of modality in human-robot dialogues. \n2. Detailed related works are included. \n3. The annotation results demonstrate the effectiveness and expressiveness of the proposed scheme.\nWeakness: 1. It would be better if the authors promise to release the annotated results for public research in the field of dialogue. \n2. This paper only analyzes the annotation scheme and the annotation results theoretically. How about conducting a baseline model to validate the effectiveness of such an annotation scheme compared with other schemes in terms of the representation ability of modality? "}, "scores": {"overall": "4", "Originality": "3", "Readability_clarity": "4", "Relevance": "5", "Reproducibility": "4", "Substance": "3"}, "meta": {"license": "No individual license attached", "REVIEWER_CONFIDENCE": "3", "sentences": {"main": [[0, 107], [107, 302], [302, 444], [444, 585], [585, 693], [693, 752], [752, 868], [868, 995], [995, 1049], [1049, 1050], [1050, 1063], [1063, 1198], [1198, 1202], [1202, 1239], [1239, 1243], [1243, 1339], [1339, 1352], [1352, 1473], [1473, 1477], [1477, 1566], [1566, 1743]]}}}, {"rid": "1", "reviewer": null, "report": {"main": "The article presents two-level  two-level annotation for human-robot interaction. One of the levels is content, namely a logic-based semantic representation, and the other level is intent, namely tasks-based pragmatics.\n The article provides an overview of existing annotation schemes on these two topics, and their limitations, and offers the SCOUT annotation scheme. The article offers a description of the scheme and its details, an analysis of the results, and a revised theoretical framework for human-robot interaction.\nOverall, I think the article makes a good job at disentangling semantics from pragmatics, which surprisingly often taken for granted in dialogue annotation, or biased towards semantics hoping that the module responsible execution of a formal structure will know what to do (i.e. the pragmatics). In particular, i appreciated the emphasis on the very important role of imperative utterance in dialogue systems and their model-and-not-modal interpretation. Some of the softer conclusions on \"sociolinguistics\" of humans are robot are unexpected, given that dialogue agents (esp. task oriented) are created as service tools, and thus won't often use the imperative.\nQuestions:    How do you think the temporal index can be useful to describe tense differences in semantics and pragmatics, and what kind of refinements would it require? \nDo you think the relatively low kappa score for temporal index is caused by overly aggressive chance correction?   I would recommend the authors to publish the annotation scheme as a flowchart so that other people can benefit from the work in a straightforward manne "}, "scores": {"overall": "4", "Originality": "4", "Readability_clarity": "4", "Relevance": "5", "Reproducibility": "4", "Substance": "4"}, "meta": {"license": "No individual license attached", "REVIEWER_CONFIDENCE": "3", "sentences": {"main": [[0, 82], [82, 220], [220, 369], [369, 526], [526, 822], [822, 981], [981, 1103], [1103, 1189], [1189, 1359], [1359, 1473], [1473, 1475], [1475, 1627]]}}}]