[{"rid": "0", "reviewer": null, "report": {"main": "Learning-based metrics have been extensively studied for open-domain dialogue response generation recently. As many such metrics have achieved superior correlations with human judgement in comparison to traditional automated metrics, it is now an important issue to investigate: 1) What aspects of a response need to be considered? 2) How to assess each aspect with an evaluator? 3) How to compose the aspects to obtain an overall understanding of the response quality? This paper attempted to answer the questions with the following solutions: 1) Understandability, sensibleness, and likability. 2) BERT-VUP, BERT-NUP, and MLM-likelihood. 3) A hierarchical composition of the three scores (a_1 * score_u + a_2 * score_s + a_3 * score_s * score_l).\nSTRENGTHS: - Instead of focusing on \"what models can be used for evaluating\", the paper studies \"what aspects need to be evaluated\". The questions investigated are interesting and meaningful for the community.\n- A considerable amount of experiments have been carried out to verify the authors' hypotheses, and relatively good results have been achieved to support the hypotheses.\nWEAKNESSES: - The authors used USR (which is USL-A in this paper, [Mehri and Eskenazi, 2020]) as a main baseline, compared to which configurability is not novel as it has been proposed in USR.\n- The proposed USL-H differs from USL-A in that it composes three scores in a hierarchy. I consider such hierarchy as the main novelty. In order to verify the validity of the hierarchy (Section 6.1), the authors ought to compare three score composition methods (A. Human vanilla, B. Human USL-A, C. Human USL-L). However, only A and C have been compared (Figure 3).\n- The proposed USL-H achieves the best correlations according to Table 4, but it only achieves marginal improvement over the second best metric, BERT-NUP.  - Some terms are not explained: 1) What is the difference between PONE and EN-PONE? 2) What is the difference between \"weighted\" version and \"unweighted\" version of USL_S-A/H in Table 4? "}, "scores": {"overall": "4", "Originality": "3", "Readability_clarity": "4", "Relevance": "5", "Reproducibility": "3", "Substance": "3"}, "meta": {"license": "No individual license attached", "REVIEWER_CONFIDENCE": "3", "sentences": {"main": [[0, 108], [108, 332], [332, 380], [380, 470], [470, 597], [597, 640], [640, 749], [749, 760], [760, 882], [882, 959], [959, 1129], [1129, 1141], [1141, 1322], [1322, 1411], [1411, 1458], [1458, 1635], [1635, 1688], [1688, 1843], [1843, 1844], [1844, 1928], [1928, 2031]]}}}]