{
  "name" : "ARR_2022_184_paper.pdf",
  "metadata" : {
    "source" : "CRF",
    "title" : "FairLex: A Multilingual Benchmark for Evaluating Fairness in Legal Text Processing",
    "authors" : [ ],
    "emails" : [ ],
    "sections" : [ {
      "heading" : "1 Introduction",
      "text" : "The sector of law produces massive volumes of textual data (Katz et al., 2020), and as a result, legal research for settling personal injury claims, for example, can take several years, potentially discouraging clients. Legal systems around the world, e.g., in India,1 Brazil,2 or the US3, experience yearlong backlogs of pending cases. Natural Language Processing (NLP) for law (Chalkidis and Kampas, 2019; Aletras et al., 2019; Zhong et al., 2020) receives increasing attention. Assistive technologies can speed up legal research or discovery significantly assisting lawyers, judges and clerks. They can also help legal scholars to study case law (Katz, 2012), improve access of law to laypersons, help sociologists and research ethicists to expose biases in the justice system (Angwin et al., 2016; Dressel and Farid, 2018), and even scrutinize decision-making itself (Bell et al., 2021).\n1https://tinyurl.com/mjy2uf9a 2https://tinyurl.com/2uttucmn 3https://tinyurl.com/4ybhhff8\nIn the context of law, non-discrimination (i.e. equality) is of paramount importance, e.g., EU nondiscrimination law (Council of European Union, 2000, 2006) prohibits both direct and indirect discrimination. Discrimination occurs when one person is treated less favourably than others would be treated in comparable situations on grounds of sex, racial or ethnic origin, disability, sexual orientation, religion or belief and age.4 Given the gravity that legal outcomes have for individuals, assistive technologies cannot be adopted to speed up legal research at the expense of fairness (Wachter et al., 2021), potentially also decreasing the trust in our legal systems (Barfield, 2020).\nIn recent years, the NLP and machine learning literature has introduced fairness objectives, typically derived from the Rawlsian notion of equal opportunities (Rawls, 1971), to evaluate the extent to which models discriminate across protected attributes. Some of these rely on notions of resource allocation, i.e., reflecting the idea that groups are treated fairly if they are equally represented in the training data used to induce our models, or if the same number of training iterations is performed per group. This is sometimes referred to as the resource allocation perspective on fair-\n4An in-depth analysis of the notion of discrimination and fairness in law is presented in Appendix A.\nness (Lundgard, 2020). Contrary, there is also a capability-centered approach to fairness (Anderson, 1999; Robeyns, 2009), in which the goal is reserve enough resources per group to achieve similar performance levels, which is ultimately what is important for how individuals are treated in legal processes. We adopt a capability-centered approach to fairness and define fairness in terms of performance parity (Hashimoto et al., 2018) or equal risk (Donini et al., 2018).5\nPerformance disparity (Hashimoto et al., 2018) refers to the phenomenon of high overall performance, but low performance on minority groups, as a result of minimizing risk across samples (not groups), Since some groups benefit more than others from models and technologies that exhibit performance disparity, this likely widens gaps between those groups. Performance disparity works against the ideal of fair and equal opportunities for all groups in our societies. We therefore define a fair classifier as one that has similar performance (equal risk) across all groups (Donini et al., 2018).\nIn sum, we adopt the view that (approximate) equality under the law in a modern world requires that our NLP technologies exhibit (approximately) equal risk across sensitive attributes. For everyone to be treated equally under the law, regardless of race, gender, nationality, or other characteristics, NLP technologies need to be (approximately) insensitive to these attributes. In a supervised learning setting, models are trained on historical data that not always represent all groups in our societies equally. Moreover, historical legal data tends to reflect social biases in our societies and legal institutions. For example, criminal justice is already often strongly influenced by racial bias, with people of colour being more likely to be arrested and receive higher punishments than others, both in the US6 and in the UK.7 When models are deployed in production, they may reinforce these biases. We consider three types of attributes in this work:\n• Demographics: The first category includes demographic information of the involved parties, e.g., the gender, sexual orientation, nationality, age, or race of the plaintiff/defendant in a case. In this case, we aim to mitigate biases against specific\n5The dominant alternative to equal risk is to define fairness in terms of equal odds. Equal odds fairness does not guarantee Rawlsian fairness, and often conflicts with the rule of law.\n6https://tinyurl.com/4cse552t 7https://tinyurl.com/hkff3zcb\ngroups, e.g., a model performs worse for female defendants or is biased against black defendants. • Regional: The second category includes regional\ninformation of the courts in charge of a case. In this case, we aim to mitigate disparity in-between different regions in a given jurisdiction, e.g., a model performs better in specific cases originated or ruled in courts of specific regions. • Legal Topic: The third category includes legal\ntopic information on the subject matter of the controversy. In this case, we aim to mitigate disparity in-between different topics (areas) of law, e.g., a model performs better in a specific field of law, for example civil cases.\nContributions We introduce FairLex, a multilingual fairness benchmark of four legal datasets covering four jurisdictions (Council of Europe, United States of America, Swiss Confederation and People’s Republic of China), five languages (English, German, French, Italian and Chinese) and various sensitive attributes (gender, age, region, etc.). We release four pre-trained transformer-based language models, each tailored for a specific FairLex dataset (task) within our benchmark, which can be used as baseline models (text encoders). We conduct experiments with several group-robust algorithms and provide a quantitative and qualitative analysis of our results, highlighting open challenges in the development of robustness methods in legal NLP."
    }, {
      "heading" : "2 Related Work",
      "text" : "Fair machine learning The literature on inducing approximately fair models from biased data is rapidly growing. See Mehrabi et al. (2021) for a recent survey. We rely on this literature in how we define fairness, and for the algorithms that we compare in our experiments below. As already discussed, we adopt a capability-centered approach to fairness and define fairness in terms of performance parity (Hashimoto et al., 2018) or equal risk (Donini et al., 2018). The fairness-promoting learning algorithms we evaluate are discussed in detail in §4. Some of these – Group Distributionally Robust Optimization (Sagawa et al., 2020) and Invariant Risk Minimization (Arjovsky et al., 2020) – have previously been evaluated for fairness in the context of hate speech (Koh et al., 2021).\nFairness in law Studying fair machine learning in the context of legal (computational) applications\nhas a limited history. In a classic study, Angwin et al. (2016) analyzed the performance of the Correctional Offender Management Profiling for Alternative Sanctions (COMPAS) system, which was used for parole risk assessment (recidivism prediction) in the US. The system relied on 137 features from questionnaires and criminal records. Angwin et al. (2016) found that blacks were almost twice as likely as whites to be mislabeled as high risk (of re-offending), revealing a severe racial bias in the system. The system was later compared to crowdworkers in Dressel and Farid (2018).\nThese studies relied on tabular data and did not involve text processing. More recently, Wang et al. (2021b) studied legal judgment consistency using a dataset of Chinese criminal cases. They evaluated the consistency of LSTM-based models across region and gender and reported severe fairness gaps across gender. They also found that the fairness gap was particular severe for more serious crimes.\nPrevious work has focused on the analysis of specific cases, languages or algorithms, but FairLex aims at easing the development and testing of bias-mitigation models or algorithms within the legal domain. FairLex allows researchers to explore fairness across four datasets covering four jurisdictions (Council of Europe, United States of America, Swiss Confederation and People’s Republic of China), five languages (English, German, French, Italian and Chinese) and various sensitive attributes (gender, age, region, etc.). Furthermore, we provide competitive baselines including stateof-the-art transformer-based models, adapted to the examined datasets, and an in-dept examination of performance of four group robust algorithms described in detail in Section 4."
    }, {
      "heading" : "3 Benchmark Datasets",
      "text" : "ECtHR The European Court of Human Rights (ECtHR) hears allegations that a state has breached human rights provisions of the European Convention of Human Rights (ECHR). We use the dataset of Chalkidis et al. (2021), which contains 11K cases from ECtHR’s public database. Each case is mapped to articles of the ECHR that were violated (if any). This is a multi-label text classification task. Given the facts of a case, the goal is to predict the ECHR articles that were violated, if any, as decided (ruled) by the court. The cases are chronologically split into training (9k, 2001–16), development (1k, 2016–17), and test (1k, 2017–19) sets.\nTo facilitate the study of fairness of text classifiers, we record for each case the following attributes: (a) The defendant states, which are the European states that allegedly violated the ECHR. The defendant states for each case is a subset of the 47 Member States of the Council of Europe;8 To have statistical support, we group defendant states in two: Central-Eastern European states, on one hand, and all other states, as classified by the EuroVoc thesaurus.9 (b) The applicant’s age at the time of the decision. We extract the birth year of the applicant from the case facts, if possible, and classify its case in an age group (≤35, ≤64, or older) ; and (c) the applicant’s gender, extracted from the facts, if possible based on pronouns, classified in two categories (male, female).\nSCOTUS The US Supreme Court (SCOTUS) is the highest federal court in the United States of America and generally hears only the most controversial or otherwise complex cases which have not been sufficiently well solved by lower courts. We combine information from SCOTUS opinions with\n8https://www.coe.int/ 9https://op.europa.eu/en/web/\neu-vocabularies\nthe Supreme Court DataBase (SCDB)10 (Spaeth et al., 2020). SCDB provides metadata (e.g., date of publication, decisions, issues, decision directions and many more) for all cases. We consider the available 14 thematic issue areas (e.g, Criminal Procedure, Civil Rights, Economic Activity, etc.). This is a single-label multi-class document classification task. Given the court opinion, the goal is to predict the issue area whose focus is on the subject matter of the controversy (dispute). SCOTUS contains a total of 9,262 cases that we split chronologically into 80% for training (7.4k, 1946–1982), 10% for development (914, 1982–1991) and 10% for testing (931, 1991–2016).\nFrom SCDB, we also use the following attributes to study fairness: (a) the type of respondent, which is a manual categorization of respondents (defendants) in five categories (person, public entity, organization, facility and other); and (c) the direction of the decision, i.e., whether the decision is liberal, or conservative, provided by SCDB.\nFSCS The Federal Supreme Court of Switzerland (FSCS) is the last level of appeal in Switzerland and similarly to SCOTUS, the court generally hears only the most controversial or otherwise complex cases which have not been sufficiently well solved by lower courts. The court often focus only on small parts of previous decision, where they discuss possible wrong reasoning by the lower court. The Swiss-Judgment-Predict dataset (Niklaus et al., 2021) contains more than 85K decisions from the FSCS written in one of three languages (50K German, 31K French, 4K Italian) from the years 2000 to 2020. The dataset provides labels for a simplified binary (approval, dismissal) classification task. Given the facts of the case, the goal is to predict if the plaintiff’s request is valid or partially valid. The cases are also chronologically split into training (59.7k, 2000-2014), development (8.2k, 2015-2016), and test (17.4k, 2017-2020) sets.\nThe dataset provides three additional attributes: (a) the language of the FSCS written decision, in either German, French, or Italian; (b) the legal area of the case (public, penal, social, civil, or insurance law) derived from the chambers where the decisions were heard; and (c) the region that denotes in which federal region was the case originated.\nSPC The Supreme People’s Court of China (SPC) is the last level of appeal in China and con-\n10http://scdb.wustl.edu\nsiders cases that originated from the high people’s courts concerning matters of national importance. The Chinese AI and Law challenge (CAIL) dataset (Xiao et al., 2018) is a Chinese legal NLP dataset for judgment prediction and contains more 1m criminal cases. The dataset provides labels for relevant article of criminal code prediction, charge (type of crime) prediction, imprisonment term (period) prediction, and monetary penalty prediction.\nRecently, Wang et al. (2021b) re-annotated a subset of approx. 100k cases with demographic attributes. Specifically the new dataset has been annotated with: (a) the applicant’s gender, classified in two categories (male, female); and (b) the region of the court that denotes in which out of the 7 provincial-level administrative regions was the case judged. We re-split the dataset chronologically into training (80k, 2013-2017), development (12k, 2017-2018), and test (12k, 2018) sets. In our study, we examine a crime severity prediction task, a single-label multi-class classification task, where given the facts of a case, the goal is to predict how severe was the committed crime with respect to the imprisonment term. We approximate crime severity by the length of imprisonment term, split in 6 clusters (0, ≤12, ≤36, ≤60, ≤120, >120 months)."
    }, {
      "heading" : "4 Fine-tuning Algorithms",
      "text" : "Across experiments, our main goal is to find a hypothesis for which the risk R(h) is minimal:\nh∗ = arg min h∈H R(h) (1)\nR(h) = E(L(h(x), y)) (2)\nwhere y are the targets (ground truth) and h(x) = ŷ is the system hypothesis (model’s predictions).\nSimilar to previous studies, R(h) is an expectation of the selected loss function (L). In this work, we study multi-label text classification (Section 3), thus we aim to minimize the binary cross-entropy loss across L classes:\nL = −y log ŷ − (1 − y) log(1 − ŷ) (3)\nERM (Vapnik, 1992), which stands for Empirical Risk Minimization, is the most standard and widely used optimization technique to train neural methods. The loss is calculated as follows:\nLERM = N∑\ni=1\nLi N\n(4)\nwhere N is the number of instances (training examples) in a batch, and Li is the loss per instance.\nBesides ERM, we also consider a representative selection of group-robust fine-tuning algorithms which aims at mitigating performance disparities with respect to a given attribute (A), e.g., the gender of the applicant or the region of the court. Each attribute is split into G groups, i.e., male/female for gender. All algorithms rely on a balanced group sampler, i.e., an equal number of instances (samples) per group (NG) are included in each batch. Most of the algorithms are built upon group-wise losses (Lg), computed as follows:\nL(gi) = 1\nNgi Ngi∑ j=1 L(x j) (5)\nGroup DRO (Sagawa et al., 2020), stands for Group Distributionally Robust Optimization (DRO). Group DRO is an extension of the Group Uniform algorithm, where the group-wise losses are weighted inversely proportional to the group training performance. The total loss is:\nLDRO = G∑\ni=1\nwgi ∗ L(gi), where (6)\nwgi = 1 W\n(ŵgi ∗ eL(gi)) and W = G∑\ni=1\nwgi (7)\nwhere G is the number of groups (labels), Lg are the averaged group-wise (label-wise) losses, wg are the group (label) weights, ŵg are the group (label) weights as computed in the previous update step. Initially the weight mass in equally distributed across groups.\nREx (Krueger et al., 2020), which stands for Risk Extrapolation, is yet another proposed group-robust optimization algorithm. Krueger et al. (2020) hypothesize that variation across training groups is representative of the variation later encountered at test time, so they also consider the variance across the group-wise losses. In V-REx the total loss is calculated as follows:\nLREX = LERM + λ ∗ Var([Lg1 , . . . ,LgG ]) (8)\nwhere Var is the variance among the group-wise losses and λ, a weighting hyper-parameter scalar.\nIRM (Arjovsky et al., 2020), which stands for Invariant Risk Minimization, mainly aims to penalize variance across multiple training dummy estimators across groups, i.e., performance cannot vary in samples that correspond to the same group. The total loss is computed as follows:\nLIRM = 1 G  G∑ i=1 L(gi) + λ ∗ P(gi)  (9)\nPlease refer to Arjovsky et al. (2020) for the definition of the group penalty terms (Pg).\nAdversarial Removal (Elazar and Goldberg, 2018) algorithm mitigates group disparities by means of an additional adversarial classifier (Goodfellow et al., 2014). The adversarial classifier share the encoder with the main network and is trained to predict the protected attribute (A) of an instance. The total loss factors in the adversarial one, thus penalizing the model when it is able to discriminate groups. Formally, the total loss is calculated as:\nLAR = LERM − λ ∗ LADV (10)\nLADV = L(ĝi, gi) (11) where ĝi is the adversarial classifier’s prediction for the examined attribute A (in which group (gi) of A, does the example belong to) given the input (x)."
    }, {
      "heading" : "5 Experimental SetUp",
      "text" : "Models Since we are interested in classifying long documents (up to 6000 tokens per document, see Figure 2 in Appendix C.1), we developed a hierarchical BERT-based model similar to that of Chalkidis et al. (2021), so as to avoid using only the first 512 tokens of a text. Our hierarchical model, first, encodes the text through a pre-trained Transformer-based architecture, thus representing each paragraph independently with the [CLS] token. Then, the paragraph representations are fed into a two-layers transformer encoder with the exact same specifications of the first one (e.g., hidden units, number of attention heads), so as to contextualize them, i.e., it makes paragraphs representations aware of the surrounding paragraphs. Finally, the model max-pools the context-aware paragraph representations computing the document-level representation and feed it to a classification layer.\nFor the purpose of this work, we release four domain-specific BERT models with continued pretraining on the corpora of the examined datasets (ECtHR, SCOTUS, FSCS, SPC).11 We train minisized BERT models with 6 Transformer blocks, 384 hidden units, and 12 attention heads. We warmstart all models from the public MiniLMv2 models checkpoints (Wang et al., 2021a) using the distilled\n11All models will be released on Hugging Face upon acceptance.\nversion of RoBERTa (Liu et al., 2019) for the English datasets (ECtHR, SCOTUS) and the one distilled from XLM-R (Conneau et al., 2020) for the rest (trilingual FSCS, and Chinese SPC). Given the limited size of these models, we can effectively use up to 4096 tokens in ECtHR and SCOTUS and up to 2048 tokens in FSCS and SPC for up to 16 samples per batch in a 24gb nvidia gpu card.12\nFor completeness, we also consider linear Bagof Words (BoW) classifiers using TF-IDF scores of the most frequent n-grams (where n = 1, 2, 3) in the training corpus of each dataset.\nData Repository and Code We release a unified version of the benchmark on Hugging Face Datasets (Lhoest et al., 2021).13 In our experiments, we use and extend the WILDs (Koh et al., 2021) library. For reproducibility and further exploration with new group-robust methods, we release our code on Github.12\nEvaluation Details Across experiments we compute the macro-F1 score per group (mF1i), excluding the group of unidentified instances, if any.14 We report macro-F1 to avoid bias toward majority classes because of class imbalance and skewed label distributions across train, development, and test\n12This is particularly important for group-robust algorithms that consider group-wise losses.\n13Both links will be revealed upon acceptance. 14The group of unidentified instances includes the instances, where the value of the examined attribute is unidentifiable (unknown). See details in Appendix C.2.\nsubsets. We report the average macro-F1 across groups (mF1) and the group disparity (GD) among groups measured as the group-wise std dev.:\nGD = √√ 1 G G∑ i=1 (mF1i −mF1)2 (12)\nWe also report the worst-group performance (mF1W = min([mF11,mF12, . . .mF1G))."
    }, {
      "heading" : "6 Baseline Results",
      "text" : "Main Results In Table 2, we report the results of all our baselines on the four datasets introduced in this paper. We first observe that the results of linear classifiers trained with the ERM algorithm (top row per dataset) are consistently worse (lower average and worst-case performance, higher group disparity) compared to transformed-based models in the same setting. In other words linear classifier have lower overall performance, while being less fair with respect to the applied definition of fairness (i.e. equal performance across groups).\nAs one can see, transformer-based models trained with the ERM algorithm, i.e., without taking into account information about groups and their distribution, perform either better on in the same ballpark than models trained with methods specialized to mitigate biases (Section 4), with an average loss of 0.17 only in terms of mF1 and of 0.78 in terms of mF1W . While, these algorithms\nimprove worst case performance in the literature, when applied in a controlled experimental environment, they fail in a real-world setting, where both groups across attributes and labels are imbalanced, while also both group and label distribution change over time. Furthermore, we cannot identify one algorithm that performs better across datasets and group with respect to the others, indeed results are quite mixed without any recognizable pattern.\nGroup Disparity Analysis We identify three general (attribute agnostic) factors that could potentially lead to performance disparity across groups:\n• Representation Inequality: Not all groups are equally represented in the training set. To examine this aspect, we report the number of training cases per group.\n• Temporal Concept Drift: The label distribution for a given group changes over time, i.e., inbetween training and test subsets. To examine this aspect, we report per group, the KL divergence in-between the training and test label distribution.\n• Worst Class Influence: The performance is not equal across labels (classes), which may disproportionally affect the macro-averaged performance across groups. To examine this aspect, we report the Worst Class Influence (WCI) score per group, which is computed as follows:\nWCI(i) = #test-cases (worst-class)\n#test-cases (13)\nIn Table 3, we present the results across all attributes. We observe that only in 4 out of 10 cases (attributes), the less represented groups are those with the worst performance compared to the rest. It is generally not the case that high KL divergence (drift) correlates with low performance. In other words, group disparities does not seem to be driven by temporal concept drift. Finally, the influence of the worst class is relatively uniform across groups in most cases, but in the cases where groups differ in this regard, worst class influence correlates with error in 2 out of 3 cases.15\nIn ECtHR, considering performance across defendant state, we see that all the three factors correlate internally, i.e., the worst performing group is\n15For ECtHR performance across defendant states and SCOTUS across directions, but not for ECtHR performance across applicant age."
    }, {
      "heading" : "ECtHR (ECHR Violation Prediction)",
      "text" : ""
    }, {
      "heading" : "SCOTUS (Issue Area Classification)",
      "text" : ""
    }, {
      "heading" : "FSCS (Case Approval Prediction)",
      "text" : ""
    }, {
      "heading" : "SPC (Criminal Offense Prediction)",
      "text" : "introduced in Section 6. We highlight the worst and best performing group per attribute. In boldface, we highlight the best (less harmful) value per factor across groups. Performance (mF1) reported for ERM.\nless represented, has higher temporal drift and has more cases in the worst performing class. This is not the case considering performance across other attributes. It is also not the case for SCOTUS. In FSCS, considering the attributes of language and region, representation inequality seems to be an important factor that leads to group disparity. This is not the case for legal area, where the best represented group is the worst performing group. In other words, there are other reasons that lead to performance disparity in this case; for example, inconsistencies in rules and gathering of evidence in criminal cases potentially affects the predictability of rulings (Macula, 2019). In sum, we do not see any of these factors fully explain the performance disparities across groups.\nCross-Attribute Influence Analysis We have evaluated fairness across attributes that are not necessarily independent of each other. We therefore evaluate the extent to which performance disparities along different attributes correlate, i.e., how attributes interact, and whether performance differences for attribute A1 can potentially explain performance differences for another attribute A2. We examine this for the two attributes with the highest group disparity: the defendant state in ECtHR, and the legal area in FSCS. For the bins induced by these two attributes (A1), we compute mF1 scores across other attributes (A2).\nIn ECtHR, approx. 83% and 81% of male and women applicants are involved in cases against E.C. European states (best-performing group). Similarly, in case of age groups, we observe that ratio of cases against E.C. European states is: 87% and 86% for ≤65 and ≤35, the best- and worst-performing groups respectively.\nIn FSCS, the ratio of cases relevant to penal law is: approx. 29%, and 41% written in written in French (best-performing group) and Italian (worstperforming group). Similarly, approx. 27% originated in E. Switzerland (best-performing group) and 42% in Federation (worst performing group) are relevant to penal law. In both attributes, there is a 15% increase of cases relevant to penal law for the worst performing groups. In other words, the group disparity in one attribute A2 (language, region) could be also explained by the influence of another attribute A1 (legal area).\nIn Table 4, we report the performance in the aforementioned cross-attribute (A1, A2) pairings. With the exception of the (age, defendant state)"
    }, {
      "heading" : "ECtHR (A1: Defendant State)",
      "text" : "cross-examination in ECtHR, we observe that group disparities in attribute A2 (Table 3) are consistent across groups of the plausible influencer (i.e. attribute A1). Hence, cross-attribute influence does not explain the observed group disparities.\nWe believe that such an in-depth analysis of the results is fundamental to understand the influence of different factors in the outcomes. This analysis wouldn’t be possible, if we had “counterfeited” an ideal scenario, where all groups and labels where equally represented. While a controlled experimental environment is frequently used to examine specific factors, it could hide, or partially alleviate such phenomena, hence producing misleading results on fairness of the examined models."
    }, {
      "heading" : "7 Conclusions",
      "text" : "We introduced FairLex, a multi-lingual benchmark for the development and testing of bias-mitigation models or algorithms within the legal domain, based on four datasets covering four jurisdictions, five languages and various sensitive attributes. Furthermore, we provided competitive baselines including state-of-the-art transformer-based models adapted to the examined datasets, and an in-dept examination of performance of four group robust algorithms (Adversarial Removal, IRM, Group DRO, and REx). While, these algorithms improve worst case performance in the literature, when applied in a controlled experimental environment, they fail in a real-world setting, where both groups across attributes, and labels are imbalanced, while also both group and label distributions change over time. Furthermore, we cannot identify a single algorithm that performs better across datasets and groups compared to the rest."
    }, {
      "heading" : "Ethics Statement",
      "text" : "The scope of this work is to provide an evaluation framework along with extensive experiments to further study fairness within the legal domain. Following the work of Angwin et al. (2016), Dressel and Farid (2018), and (Wang et al., 2021b), we provide a diverse benchmark covering multiple tasks, jurisdictions, and protected (examined) attributes. We conduct experiments based on state-of-the-art pre-trained transformer-based language models and compare model performance across four representative group-robust algorithm, i.e., Adversarial Removal (Elazar and Goldberg, 2018), Group DRO (Sagawa et al., 2020), IRM (Arjovsky et al., 2020) and REx (Krueger et al., 2020).\nWe standardize and put together four datasets: ECtHR (Chalkidis et al., 2021), SCOTUS of (Spaeth et al., 2020), FSCS (Niklaus et al., 2021), and SCP (Xiao et al., 2018; Wang et al., 2021b) that are already publicly available. ECtHR cases are partially annonymized by the court. Its data is processed and made public in accordance with the European Data Protection Law. SCOTUS cases may also contain personal information and the data is processed and made available by the US Supreme Court, whose proceedings are public. In FSCS, the names of the parties have been redacted by the court according to its official guidelines. The same applies for SPC.\nWe note that some protected attributes within our datasets are extracted automatically, i.e., the gender and the age of the ECtHR dataset, by means of Regular Expressions, or manually clustered by the authors, such as the defendant state in the ECtHR dataset and the respondent attribute in the SCOTUS dataset. Those assumptions and simplifications can hold in an experimental setting only and by no means should be used in real-world applications where some simplifications, e.g., binary gender, would not be appropriate. By no means, we endorse the law standards or framework of the examined datasets, to any degree rather than the publication and use of the data.\nWe believe that this work can help practitioners to build assisting technology for legal professionals - with respect to the legal framework (jurisdiction) they operate -; technology that does not only rely on performance on majority groups, but also considering minorities and the robustness of the developed models across them. We believe that this is an important application field, where more research\nshould be conducted (Tsarapatsanis and Aletras, 2021) in order to improve legal services and democratize law, but more importantly highlight (inform the audience on) the various multi-aspect shortcomings seeking a responsible and ethical (fair) deployment of technology."
    }, {
      "heading" : "A Discrimination and Fairness in Law",
      "text" : "The legal notion of discrimination has a different scope and semantics in comparison to the notions of fairness and bias used in the context of machine learning (Gerards and Xenedis, 2020), where the aim usually is to achieve equal odds, e.g. that a court shall rule the same decision for both men and woman based on similar facts, or to have 50/50 favourable decisions for both man and woman, but equal opportunities (Rawls, 1971).\nIn particular, EU non-discrimination law (Council of European Union, 2000, 2006) prohibits both direct and indirect discrimination. Direct discrimination occurs when one person is treated “less favourably than another is, has been or would be treated in a comparable situation” on grounds of sex, racial or ethnic origin, disability, sexual orientation, religion or belief and age in the context of a protected sector (e.g. the workplace and provision of goods and services) (Wachter et al., 2021). Prohibiting direct discrimination allows to provide people with equal access to opportunities (i.e. formal equality). This however does not suffice, nor guarantee to create equality of opportunity (i.e. substantive equality), which can instead be achieved only by accounting for protected attributes and for social and historical realities and by taking positive measures to level the playing field (Fredman, 2016). The notion of indirect discrimination is grounded on achieving substantive equality in practice. Indirect discrimination refers to situations in which an apparently neutral provision, criterion or practice would put persons with a protected characteristic at disadvantage in comparison to other persons, unless ‘that provision, criterion or practice is “justified by a legitimate aim and the means of achieving that aim are appropriate and necessary”.\nNevertheless, the current EU non-discrimination law framework suffers from limitations, both as regards its personal (i.e. it only protects six characteristics) and material scope (i.e. the prohibition on discrimination is limited only to certain fields) (Gerards and Xenedis, 2020). These limitations pose problems in connection to algorithmic discrimination. For example, as algorithmic bias often creates seemingly neutral distinctions which\nhowever often correlate to a protected group (i.e. proxy discrimination), the limited list of protected grounds renders difficult to tackle the effects of algorithmic bias through the concept of direct discrimination (Prince and Schwarcz, 2019). Indirect discrimination can help address those cases. but its application in this context poses several challenges.\nIn April 2021 the European Commission presented a proposal for a Regulation laying down harmonized rules on artificial intelligence (AI Act / AIA) (Council of European Union, 2021). The proposal aims at avoiding “significant risks to the health and safety or fundamental rights of persons” and would, once adopted, complement the currently applicable legal framework for tackling algorithmic discrimination, thereby overcoming some of its existing limitations. The envisaged implementation of the proposed AI Act highlights the importance that the legislator poses in preventing and mitigating discrimination and biases arising from the development and use of AI systems in several areas of application, including in the legal sector (Schwemer et al., 2021). AI systems used for the administration of justice and democratic processes are proposed to be deemed high-risk in order “to address the risks of potential biases, errors, and opacity” (recital 40 AIA). The consequence is that such systems would be subject to a variety of design and development requirements, e.g. related to the training, validation and testing data sets which would have to be examined inter alia in relation to possible biases (art. 10(2) lit. f AIA) or related to human oversight of such AI system with a view to remain aware of automation bias (art. 14(4) lit. b AIA).\nThe topic deserves great attention because AI systems learning from historical data pose the risk of transporting biases previously encumbered in the data in future decision-making, thereby exponentially increasing their effect. For example, criminal justice is already often strongly influenced by racial bias, with people of colour being more likely to be arrested and receive higher punishments than\nothers, both in both in the USA16 and in the UK.17"
    }, {
      "heading" : "B Train and Evaluation Details",
      "text" : "We fine-tune all models using the AdamW (Loshchilov and Hutter, 2019) optimizer with a learning rate of 3e-5. We use a batch size of 16 and train models for up to 20 epochs using early stopping on validation performance.18 Across datasets and attributes, we run five repetitions with different random seeds and report averaged scores."
    }, {
      "heading" : "C Statistics",
      "text" : ""
    }, {
      "heading" : "C.1 Distribution of Document Length",
      "text" : "In Figure 2 we report the distribution of sequence (document) length across FairLex datasets (ECtHR, SCOTUS, FSCS). We observe that the documents are extremely long (3,000-6,000+ words) across datasets."
    }, {
      "heading" : "C.2 Group Distribution by Attribute",
      "text" : "In Tables 5 and 6 we report the group distribution per examined attribute under consideration. In some cases, the extraction of the specific attribute, e.g., gender or age in ECtHR, was not possible, i.e., the applied rules would no suffice, possibly because the information is intentionally missing. During training, the groups of unidentified samples is included, but we report test scores excluding those, i.e., mF1 and GD do not take into account the F1 of these groups."
    }, {
      "heading" : "D Label Distribution KL Divergences",
      "text" : "In Tables 7, 8, 9, and 10, we report the JensenShannon divergences between train-test, train-dev and test-test distribution of labels separately for each protrected attribute values and for each dataset in our framework.\n16https://tinyurl.com/4cse552t 17https://tinyurl.com/hkff3zcb 18We train all models in a mixed-precision (fp16) setting to\nuse the maximum available batch size."
    } ],
    "references" : [ {
      "title" : "What is the point of equality? Ethics, 109(2)",
      "author" : [ "Elizabeth Anderson" ],
      "venue" : null,
      "citeRegEx" : "Anderson.,? \\Q1999\\E",
      "shortCiteRegEx" : "Anderson.",
      "year" : 1999
    }, {
      "title" : "Machine bias: There’s software used across the country to predict future criminals",
      "author" : [ "Julia Angwin", "Jeff Larson", "Surya Mattu", "Lauren Kirchner." ],
      "venue" : "and it’s biased against blacks. ProPublica.",
      "citeRegEx" : "Angwin et al\\.,? 2016",
      "shortCiteRegEx" : "Angwin et al\\.",
      "year" : 2016
    }, {
      "title" : "Invariant Risk Minimization",
      "author" : [ "Martin Arjovsky", "Léon Bottou", "Ishaan Gulrajani", "David Lopez-Paz" ],
      "venue" : null,
      "citeRegEx" : "Arjovsky et al\\.,? \\Q2020\\E",
      "shortCiteRegEx" : "Arjovsky et al\\.",
      "year" : 2020
    }, {
      "title" : "The Cambridge Handbook of the Law of Algorithms",
      "author" : [ "Woodrow Barfield." ],
      "venue" : "Cambridge Law Handbooks. Cambridge University Press.",
      "citeRegEx" : "Barfield.,? 2020",
      "shortCiteRegEx" : "Barfield.",
      "year" : 2020
    }, {
      "title" : "The Recon Approach: A New Direction for Machine Learning in Criminal Law",
      "author" : [ "Kristen Bell", "Jenny Hong", "Nick McKeown", "Catalin Voss." ],
      "venue" : "Berkeley Technology Law Journal, 37.",
      "citeRegEx" : "Bell et al\\.,? 2021",
      "shortCiteRegEx" : "Bell et al\\.",
      "year" : 2021
    }, {
      "title" : "Paragraph-level rationale extraction through regularization: A case study on European court of human rights cases",
      "author" : [ "Ilias Chalkidis", "Manos Fergadiotis", "Dimitrios Tsarapatsanis", "Nikolaos Aletras", "Ion Androutsopoulos", "Prodromos Malakasiotis." ],
      "venue" : "In",
      "citeRegEx" : "Chalkidis et al\\.,? 2021",
      "shortCiteRegEx" : "Chalkidis et al\\.",
      "year" : 2021
    }, {
      "title" : "Deep learning in law: Early adaptation and legal word embeddings trained on large corpora",
      "author" : [ "Ilias Chalkidis", "Dimitrios Kampas." ],
      "venue" : "Artificial Intelligence and Law, 27(2):171–198.",
      "citeRegEx" : "Chalkidis and Kampas.,? 2019",
      "shortCiteRegEx" : "Chalkidis and Kampas.",
      "year" : 2019
    }, {
      "title" : "Unsupervised cross-lingual representation learning at scale",
      "author" : [ "Alexis Conneau", "Kartikay Khandelwal", "Naman Goyal", "Vishrav Chaudhary", "Guillaume Wenzek", "Francisco Guzmán", "Edouard Grave", "Myle Ott", "Luke Zettlemoyer", "Veselin Stoyanov." ],
      "venue" : "In",
      "citeRegEx" : "Conneau et al\\.,? 2020",
      "shortCiteRegEx" : "Conneau et al\\.",
      "year" : 2020
    }, {
      "title" : "Council Directive 2000/43/EC of 29 June 2000 implementing the principle of equal treatment between persons irrespective of racial or ethnic origin",
      "author" : [ "Council of European Union." ],
      "venue" : "Publications Office of the EU.",
      "citeRegEx" : "Union.,? 2000",
      "shortCiteRegEx" : "Union.",
      "year" : 2000
    }, {
      "title" : "Proposal for a Regulation laying down harmonised rules on Artificial Intelligence (Artificial Intelligence Act) and amending certain Union legislative acts",
      "author" : [ "Council of European Union." ],
      "venue" : "Publications Office of the EU.",
      "citeRegEx" : "Union.,? 2021",
      "shortCiteRegEx" : "Union.",
      "year" : 2021
    }, {
      "title" : "Empirical risk minimization under fairness constraints",
      "author" : [ "Michele Donini", "Luca Oneto", "Shai Ben-David", "John S Shawe-Taylor", "Massimiliano Pontil." ],
      "venue" : "Advances in Neural Information Processing Systems, volume 31. Curran Associates, Inc.",
      "citeRegEx" : "Donini et al\\.,? 2018",
      "shortCiteRegEx" : "Donini et al\\.",
      "year" : 2018
    }, {
      "title" : "The accuracy, fairness, and limits of predicting recidivism",
      "author" : [ "Julia Dressel", "Hany Farid." ],
      "venue" : "Science Advances, 4(10).",
      "citeRegEx" : "Dressel and Farid.,? 2018",
      "shortCiteRegEx" : "Dressel and Farid.",
      "year" : 2018
    }, {
      "title" : "Adversarial removal of demographic attributes from text data",
      "author" : [ "Yanai Elazar", "Yoav Goldberg." ],
      "venue" : "Proceedings of the 2018 Conference on Empirical Methods in Natural Language Processing, pages 11–21, Brussels, Belgium. Association for Computa-",
      "citeRegEx" : "Elazar and Goldberg.,? 2018",
      "shortCiteRegEx" : "Elazar and Goldberg.",
      "year" : 2018
    }, {
      "title" : "Substantive equality revisited",
      "author" : [ "Sandra Fredman." ],
      "venue" : "I-CON Oxford Legal Studies, 14:712—-773.",
      "citeRegEx" : "Fredman.,? 2016",
      "shortCiteRegEx" : "Fredman.",
      "year" : 2016
    }, {
      "title" : "Algorithmic discrimination in europe: challenges and opportunities for gender equality and nondiscrimination law",
      "author" : [ "Janneke Gerards", "Raphaële Xenedis" ],
      "venue" : null,
      "citeRegEx" : "Gerards and Xenedis.,? \\Q2020\\E",
      "shortCiteRegEx" : "Gerards and Xenedis.",
      "year" : 2020
    }, {
      "title" : "Generative adversarial networks",
      "author" : [ "Ian J. Goodfellow", "Jean Pouget-Abadie", "Mehdi Mirza", "Bing Xu", "David Warde-Farley", "Sherjil Ozair", "Aaron Courville", "Yoshua Bengio." ],
      "venue" : "Advances in Neural Information Processing Systems.",
      "citeRegEx" : "Goodfellow et al\\.,? 2014",
      "shortCiteRegEx" : "Goodfellow et al\\.",
      "year" : 2014
    }, {
      "title" : "Fairness without demographics in repeated loss minimization",
      "author" : [ "Tatsunori Hashimoto", "Megha Srivastava", "Hongseok Namkoong", "Percy Liang." ],
      "venue" : "Proceedings of the 35th International Conference on Machine Learning, volume 80 of Proceedings of Ma-",
      "citeRegEx" : "Hashimoto et al\\.,? 2018",
      "shortCiteRegEx" : "Hashimoto et al\\.",
      "year" : 2018
    }, {
      "title" : "Quantitative legal prediction-or-how I learned to stop worrying and start preparing for the data-driven future of the legal services industry",
      "author" : [ "Daniel Martin Katz." ],
      "venue" : "Emory Law Journal, 62:909.",
      "citeRegEx" : "Katz.,? 2012",
      "shortCiteRegEx" : "Katz.",
      "year" : 2012
    }, {
      "title" : "Complex societies and the growth of the law",
      "author" : [ "Daniel Martin Katz", "Corinna Coupette", "Janis Beckedorf", "Dirk Hartung." ],
      "venue" : "Scientific Reports, 10:18737.",
      "citeRegEx" : "Katz et al\\.,? 2020",
      "shortCiteRegEx" : "Katz et al\\.",
      "year" : 2020
    }, {
      "title" : "WILDS: A benchmark of in-the-wild distribution shifts",
      "author" : [ "shaw", "Imran S. Haque", "Sara Beery", "Jure Leskovec", "Anshul Kundaje", "Emma Pierson", "Sergey Levine", "Chelsea Finn", "Percy Liang" ],
      "venue" : "In International Conference on Machine Learning",
      "citeRegEx" : "shaw et al\\.,? \\Q2021\\E",
      "shortCiteRegEx" : "shaw et al\\.",
      "year" : 2021
    }, {
      "title" : "Out-of-Distribution Generalization via Risk Extrapolation (REx)",
      "author" : [ "David Krueger", "Ethan Caballero", "Jörn-Henrik Jacobsen", "Amy Zhang", "Jonathan Binas", "Rémi Le Priol", "Aaron C. Courville." ],
      "venue" : "CoRR.",
      "citeRegEx" : "Krueger et al\\.,? 2020",
      "shortCiteRegEx" : "Krueger et al\\.",
      "year" : 2020
    }, {
      "title" : "Datasets: A community library for natural language processing",
      "author" : [ "nas", "Alexander M. Rush", "Thomas Wolf" ],
      "venue" : null,
      "citeRegEx" : "nas et al\\.,? \\Q2021\\E",
      "shortCiteRegEx" : "nas et al\\.",
      "year" : 2021
    }, {
      "title" : "Roberta: A robustly optimized BERT pretraining approach",
      "author" : [ "Yinhan Liu", "Myle Ott", "Naman Goyal", "Jingfei Du", "Mandar Joshi", "Danqi Chen", "Omer Levy", "Mike Lewis", "Luke Zettlemoyer", "Veselin Stoyanov." ],
      "venue" : "CoRR, abs/1907.11692.",
      "citeRegEx" : "Liu et al\\.,? 2019",
      "shortCiteRegEx" : "Liu et al\\.",
      "year" : 2019
    }, {
      "title" : "Decoupled weight decay regularization",
      "author" : [ "Ilya Loshchilov", "Frank Hutter." ],
      "venue" : "International Conference on Learning Representations.",
      "citeRegEx" : "Loshchilov and Hutter.,? 2019",
      "shortCiteRegEx" : "Loshchilov and Hutter.",
      "year" : 2019
    }, {
      "title" : "Measuring justice in machine learning",
      "author" : [ "Alan Lundgard." ],
      "venue" : "Proceedings of the 2020 Conference on Fairness, Accountability, and Transparency, FAT* ’20, page 680, New York, NY, USA. Association for Computing Machinery.",
      "citeRegEx" : "Lundgard.,? 2020",
      "shortCiteRegEx" : "Lundgard.",
      "year" : 2020
    }, {
      "title" : "The Potential to Secure a Fair Trial Through Evidence Exclusion: A Swiss Perspective, pages 15–60",
      "author" : [ "Laura Macula." ],
      "venue" : "Springer International Publishing, Cham.",
      "citeRegEx" : "Macula.,? 2019",
      "shortCiteRegEx" : "Macula.",
      "year" : 2019
    }, {
      "title" : "A survey on bias and fairness in machine learning",
      "author" : [ "Ninareh Mehrabi", "Fred Morstatter", "Nripsuta Saxena", "Kristina Lerman", "Aram Galstyan." ],
      "venue" : "ACM Comput. Surv., 54(6).",
      "citeRegEx" : "Mehrabi et al\\.,? 2021",
      "shortCiteRegEx" : "Mehrabi et al\\.",
      "year" : 2021
    }, {
      "title" : "Swiss-Court-Predict: A Multilingual Legal Judgment Prediction Benchmark",
      "author" : [ "Joel Niklaus", "Ilias Chalkidis", "Matthias Stürmer." ],
      "venue" : "Proceedings of the 2022 NLLP Workshop, Online.",
      "citeRegEx" : "Niklaus et al\\.,? 2021",
      "shortCiteRegEx" : "Niklaus et al\\.",
      "year" : 2021
    }, {
      "title" : "Proxy discrimination in the age of artificial intelligence and big data",
      "author" : [ "Anya E.R. Prince", "Daniel Schwarcz." ],
      "venue" : "Iowa Law Review, 105. 10",
      "citeRegEx" : "Prince and Schwarcz.,? 2019",
      "shortCiteRegEx" : "Prince and Schwarcz.",
      "year" : 2019
    }, {
      "title" : "A Theory of Justice, 1 edition",
      "author" : [ "John Rawls." ],
      "venue" : "Belknap Press of Harvard University Press, Cambridge, Massachussets.",
      "citeRegEx" : "Rawls.,? 1971",
      "shortCiteRegEx" : "Rawls.",
      "year" : 1971
    }, {
      "title" : "Justice as fairness and the capability approach",
      "author" : [ "Ingrid Robeyns." ],
      "venue" : "Arguments for a Better World. Essays for Amartya Sen’s, 75:397–413.",
      "citeRegEx" : "Robeyns.,? 2009",
      "shortCiteRegEx" : "Robeyns.",
      "year" : 2009
    }, {
      "title" : "Distributionally Robust Neural Networks",
      "author" : [ "Shiori Sagawa", "Pang Wei Koh", "Tatsunori B. Hashimoto", "Percy Liang." ],
      "venue" : "International Conference on Learning Representations.",
      "citeRegEx" : "Sagawa et al\\.,? 2020",
      "shortCiteRegEx" : "Sagawa et al\\.",
      "year" : 2020
    }, {
      "title" : "Legal ai systems in the eu’s proposed artificial intelligence act",
      "author" : [ "Sebastian Felix Schwemer", "Letizia Tomada", "Tommaso Pasini." ],
      "venue" : "In Joint Proceedings of the Workshops on Automated Semantic Analysis of Information in Legal Text (ASAIL 2021) and",
      "citeRegEx" : "Schwemer et al\\.,? 2021",
      "shortCiteRegEx" : "Schwemer et al\\.",
      "year" : 2021
    }, {
      "title" : "Supreme Court Database, Version 2020 Release 01",
      "author" : [ "Harold J. Spaeth", "Lee Epstein", "Jeffrey A. Segal Andrew D. Martin", "Theodore J. Ruger", "Sara C. Benesh." ],
      "venue" : "Washington University Law.",
      "citeRegEx" : "Spaeth et al\\.,? 2020",
      "shortCiteRegEx" : "Spaeth et al\\.",
      "year" : 2020
    }, {
      "title" : "On the ethical limits of natural language processing on legal text",
      "author" : [ "Dimitrios Tsarapatsanis", "Nikolaos Aletras." ],
      "venue" : "Findings of the Association for Computational Linguistics: ACL-IJCNLP 2021, pages 3590–3599, Online. Association for Computational",
      "citeRegEx" : "Tsarapatsanis and Aletras.,? 2021",
      "shortCiteRegEx" : "Tsarapatsanis and Aletras.",
      "year" : 2021
    }, {
      "title" : "Principles of risk minimization for learning theory",
      "author" : [ "V. Vapnik." ],
      "venue" : "Advances in Neural Information Processing Systems, volume 4. Morgan-Kaufmann.",
      "citeRegEx" : "Vapnik.,? 1992",
      "shortCiteRegEx" : "Vapnik.",
      "year" : 1992
    }, {
      "title" : "Bias preservation in machine learning: The legality of fairness metrics under eu nondiscrimination law",
      "author" : [ "Sandra Wachter", "Brent Daniel Mittelstadt", "Chris Russell." ],
      "venue" : "West Virginia Law Review, 123.",
      "citeRegEx" : "Wachter et al\\.,? 2021",
      "shortCiteRegEx" : "Wachter et al\\.",
      "year" : 2021
    }, {
      "title" : "MiniLMv2: Multi-head selfattention relation distillation for compressing pretrained transformers",
      "author" : [ "Wenhui Wang", "Hangbo Bao", "Shaohan Huang", "Li Dong", "Furu Wei." ],
      "venue" : "Findings of the Association for Computational Linguistics: ACL-IJCNLP 2021,",
      "citeRegEx" : "Wang et al\\.,? 2021a",
      "shortCiteRegEx" : "Wang et al\\.",
      "year" : 2021
    }, {
      "title" : "Equality before the law: Legal judgment consistency analysis for fairness",
      "author" : [ "Yuzhong Wang", "Chaojun Xiao", "Shirong Ma", "Haoxi Zhong", "Cunchao Tu", "Tianyang Zhang", "Zhiyuan Liu", "Maosong Sun." ],
      "venue" : "Science China - Information Sciences.",
      "citeRegEx" : "Wang et al\\.,? 2021b",
      "shortCiteRegEx" : "Wang et al\\.",
      "year" : 2021
    }, {
      "title" : "CAIL2018: A large-scale legal dataset for judgment prediction",
      "author" : [ "Chaojun Xiao", "Haoxi Zhong", "Zhipeng Guo", "Cunchao Tu", "Zhiyuan Liu", "Maosong Sun", "Yansong Feng", "Xianpei Han", "Zhen Hu", "Heng Wang", "Jianfeng Xu." ],
      "venue" : "CoRR, abs/1807.02478.",
      "citeRegEx" : "Xiao et al\\.,? 2018",
      "shortCiteRegEx" : "Xiao et al\\.",
      "year" : 2018
    }, {
      "title" : "How does NLP benefit legal system: A summary",
      "author" : [ "Haoxi Zhong", "Chaojun Xiao", "Cunchao Tu", "Tianyang Zhang", "Zhiyuan Liu", "Maosong Sun" ],
      "venue" : null,
      "citeRegEx" : "Zhong et al\\.,? \\Q2020\\E",
      "shortCiteRegEx" : "Zhong et al\\.",
      "year" : 2020
    }, {
      "title" : "Indirect discrimination can help address those cases. but its application in this context poses several challenges",
      "author" : [ "crimination (Prince", "Schwarcz" ],
      "venue" : null,
      "citeRegEx" : ".Prince et al\\.,? \\Q2019\\E",
      "shortCiteRegEx" : ".Prince et al\\.",
      "year" : 2019
    } ],
    "referenceMentions" : [ {
      "referenceID" : 18,
      "context" : "textual data (Katz et al., 2020), and as a result, legal research for settling personal injury claims, for example, can take several years, potentially discouraging clients.",
      "startOffset" : 13,
      "endOffset" : 32
    }, {
      "referenceID" : 6,
      "context" : "Natural Language Processing (NLP) for law (Chalkidis and Kampas, 2019; Aletras et al., 2019; Zhong et al., 2020) receives increasing attention.",
      "startOffset" : 42,
      "endOffset" : 112
    }, {
      "referenceID" : 40,
      "context" : "Natural Language Processing (NLP) for law (Chalkidis and Kampas, 2019; Aletras et al., 2019; Zhong et al., 2020) receives increasing attention.",
      "startOffset" : 42,
      "endOffset" : 112
    }, {
      "referenceID" : 17,
      "context" : "They can also help legal scholars to study case law (Katz, 2012), improve access of law to laypersons, help sociologists and research ethicists to expose biases in the justice system (Angwin et al.",
      "startOffset" : 52,
      "endOffset" : 64
    }, {
      "referenceID" : 1,
      "context" : "They can also help legal scholars to study case law (Katz, 2012), improve access of law to laypersons, help sociologists and research ethicists to expose biases in the justice system (Angwin et al., 2016; Dressel and Farid, 2018), and even scrutinize decision-making itself (Bell et al.",
      "startOffset" : 183,
      "endOffset" : 229
    }, {
      "referenceID" : 11,
      "context" : "They can also help legal scholars to study case law (Katz, 2012), improve access of law to laypersons, help sociologists and research ethicists to expose biases in the justice system (Angwin et al., 2016; Dressel and Farid, 2018), and even scrutinize decision-making itself (Bell et al.",
      "startOffset" : 183,
      "endOffset" : 229
    }, {
      "referenceID" : 4,
      "context" : ", 2016; Dressel and Farid, 2018), and even scrutinize decision-making itself (Bell et al., 2021).",
      "startOffset" : 77,
      "endOffset" : 96
    }, {
      "referenceID" : 36,
      "context" : "4 Given the gravity that legal outcomes have for individuals, assistive technologies cannot be adopted to speed up legal research at the expense of fairness (Wachter et al., 2021), potentially also decreasing the trust in our legal systems (Barfield, 2020).",
      "startOffset" : 157,
      "endOffset" : 179
    }, {
      "referenceID" : 3,
      "context" : ", 2021), potentially also decreasing the trust in our legal systems (Barfield, 2020).",
      "startOffset" : 68,
      "endOffset" : 84
    }, {
      "referenceID" : 29,
      "context" : "In recent years, the NLP and machine learning literature has introduced fairness objectives, typically derived from the Rawlsian notion of equal opportunities (Rawls, 1971), to evaluate the extent to which models discriminate across protected attributes.",
      "startOffset" : 159,
      "endOffset" : 172
    }, {
      "referenceID" : 0,
      "context" : "Contrary, there is also a capability-centered approach to fairness (Anderson, 1999; Robeyns, 2009), in which the goal is reserve enough resources per group to achieve similar performance levels, which is ultimately what is important for how individuals are treated in legal processes.",
      "startOffset" : 67,
      "endOffset" : 98
    }, {
      "referenceID" : 30,
      "context" : "Contrary, there is also a capability-centered approach to fairness (Anderson, 1999; Robeyns, 2009), in which the goal is reserve enough resources per group to achieve similar performance levels, which is ultimately what is important for how individuals are treated in legal processes.",
      "startOffset" : 67,
      "endOffset" : 98
    }, {
      "referenceID" : 16,
      "context" : "to fairness and define fairness in terms of performance parity (Hashimoto et al., 2018) or equal risk (Donini et al.",
      "startOffset" : 63,
      "endOffset" : 87
    }, {
      "referenceID" : 16,
      "context" : "Performance disparity (Hashimoto et al., 2018) refers to the phenomenon of high overall performance, but low performance on minority groups, as a result of minimizing risk across samples (not groups), Since some groups benefit more than others from models and technologies that exhibit performance disparity, this likely widens gaps between those groups.",
      "startOffset" : 22,
      "endOffset" : 46
    }, {
      "referenceID" : 10,
      "context" : "We therefore define a fair classifier as one that has similar performance (equal risk) across all groups (Donini et al., 2018).",
      "startOffset" : 105,
      "endOffset" : 126
    }, {
      "referenceID" : 16,
      "context" : "As already discussed, we adopt a capability-centered approach to fairness and define fairness in terms of performance parity (Hashimoto et al., 2018) or equal risk (Donini et al.",
      "startOffset" : 125,
      "endOffset" : 149
    }, {
      "referenceID" : 31,
      "context" : "Some of these – Group Distributionally Robust Optimization (Sagawa et al., 2020) and Invariant Risk Minimization (Arjovsky et al.",
      "startOffset" : 59,
      "endOffset" : 80
    }, {
      "referenceID" : 2,
      "context" : ", 2020) and Invariant Risk Minimization (Arjovsky et al., 2020) – have previously been evaluated for fairness in the context of hate speech (Koh et al.",
      "startOffset" : 40,
      "endOffset" : 63
    }, {
      "referenceID" : 5,
      "context" : "ECtHR (Chalkidis et al., 2021) Legal Judgment Prediction: ECHR Violation Prediction 10+1 Defendant State 2 Applicant Gender 2 Applicant Age 3",
      "startOffset" : 6,
      "endOffset" : 30
    }, {
      "referenceID" : 33,
      "context" : "SCOTUS (Spaeth et al., 2020) Legal Topic Classification: Issue Area Classification 14 Respondent Type 4 Decision Direction 2",
      "startOffset" : 7,
      "endOffset" : 28
    }, {
      "referenceID" : 27,
      "context" : "FSCS (Niklaus et al., 2021) Legal Judgment Prediction: Case Approval Prediction 2 Language 3 Region of Origin 6 Legal Area 6",
      "startOffset" : 5,
      "endOffset" : 27
    }, {
      "referenceID" : 38,
      "context" : "SPC (Wang et al., 2021b) Legal Judgment Prediction: Crime Severity Prediction 6 Defendant Gender 2 Region of Origin 7",
      "startOffset" : 4,
      "endOffset" : 24
    }, {
      "referenceID" : 33,
      "context" : "the Supreme Court DataBase (SCDB)10 (Spaeth et al., 2020).",
      "startOffset" : 36,
      "endOffset" : 57
    }, {
      "referenceID" : 27,
      "context" : "The Swiss-Judgment-Predict dataset (Niklaus et al., 2021) contains more than 85K decisions from the FSCS written in one of three languages (50K German, 31K French, 4K Italian) from the years 2000 to 2020.",
      "startOffset" : 35,
      "endOffset" : 57
    }, {
      "referenceID" : 39,
      "context" : "The Chinese AI and Law challenge (CAIL) dataset (Xiao et al., 2018) is a Chinese legal NLP dataset for judgment prediction and contains more 1m criminal cases.",
      "startOffset" : 48,
      "endOffset" : 67
    }, {
      "referenceID" : 35,
      "context" : "ERM (Vapnik, 1992), which stands for Empirical Risk Minimization, is the most standard and widely used optimization technique to train neural methods.",
      "startOffset" : 4,
      "endOffset" : 18
    }, {
      "referenceID" : 31,
      "context" : "Group DRO (Sagawa et al., 2020), stands for Group Distributionally Robust Optimization",
      "startOffset" : 10,
      "endOffset" : 31
    }, {
      "referenceID" : 20,
      "context" : "REx (Krueger et al., 2020), which stands for Risk Extrapolation, is yet another proposed group-robust optimization algorithm.",
      "startOffset" : 4,
      "endOffset" : 26
    }, {
      "referenceID" : 2,
      "context" : "IRM (Arjovsky et al., 2020), which stands for Invariant Risk Minimization, mainly aims to penalize variance across multiple training dummy estimators across groups, i.",
      "startOffset" : 4,
      "endOffset" : 27
    }, {
      "referenceID" : 12,
      "context" : "Adversarial Removal (Elazar and Goldberg, 2018) algorithm mitigates group disparities by means of an additional adversarial classifier (Goodfellow et al.",
      "startOffset" : 20,
      "endOffset" : 47
    }, {
      "referenceID" : 15,
      "context" : "Adversarial Removal (Elazar and Goldberg, 2018) algorithm mitigates group disparities by means of an additional adversarial classifier (Goodfellow et al., 2014).",
      "startOffset" : 135,
      "endOffset" : 160
    }, {
      "referenceID" : 37,
      "context" : "We warmstart all models from the public MiniLMv2 models checkpoints (Wang et al., 2021a) using the distilled",
      "startOffset" : 68,
      "endOffset" : 88
    }, {
      "referenceID" : 22,
      "context" : "version of RoBERTa (Liu et al., 2019) for the English datasets (ECtHR, SCOTUS) and the one distilled from XLM-R (Conneau et al.",
      "startOffset" : 19,
      "endOffset" : 37
    }, {
      "referenceID" : 7,
      "context" : ", 2019) for the English datasets (ECtHR, SCOTUS) and the one distilled from XLM-R (Conneau et al., 2020) for the rest (trilingual FSCS, and Chinese SPC).",
      "startOffset" : 82,
      "endOffset" : 104
    }, {
      "referenceID" : 25,
      "context" : "In other words, there are other reasons that lead to performance disparity in this case; for example, inconsistencies in rules and gathering of evidence in criminal cases potentially affects the predictability of rulings (Macula, 2019).",
      "startOffset" : 221,
      "endOffset" : 235
    }, {
      "referenceID" : 38,
      "context" : "(2016), Dressel and Farid (2018), and (Wang et al., 2021b), we provide a diverse benchmark covering multiple tasks, jurisdictions, and protected (examined) attributes.",
      "startOffset" : 38,
      "endOffset" : 58
    }, {
      "referenceID" : 2,
      "context" : ", 2020), IRM (Arjovsky et al., 2020) and REx (Krueger et al.",
      "startOffset" : 13,
      "endOffset" : 36
    }, {
      "referenceID" : 5,
      "context" : "We standardize and put together four datasets: ECtHR (Chalkidis et al., 2021), SCOTUS of (Spaeth et al.",
      "startOffset" : 53,
      "endOffset" : 77
    }, {
      "referenceID" : 33,
      "context" : ", 2021), SCOTUS of (Spaeth et al., 2020), FSCS (Niklaus et al.",
      "startOffset" : 19,
      "endOffset" : 40
    }, {
      "referenceID" : 27,
      "context" : ", 2020), FSCS (Niklaus et al., 2021), and SCP (Xiao et al.",
      "startOffset" : 14,
      "endOffset" : 36
    }, {
      "referenceID" : 39,
      "context" : ", 2021), and SCP (Xiao et al., 2018; Wang et al., 2021b) that are already publicly available.",
      "startOffset" : 17,
      "endOffset" : 56
    }, {
      "referenceID" : 38,
      "context" : ", 2021), and SCP (Xiao et al., 2018; Wang et al., 2021b) that are already publicly available.",
      "startOffset" : 17,
      "endOffset" : 56
    }, {
      "referenceID" : 34,
      "context" : "We believe that this is an important application field, where more research should be conducted (Tsarapatsanis and Aletras, 2021) in order to improve legal services and democratize law, but more importantly highlight (inform the audience on) the various multi-aspect shortcomings seeking a responsible and ethical (fair) deployment of technology.",
      "startOffset" : 96,
      "endOffset" : 129
    } ],
    "year" : 0,
    "abstractText" : "We present a benchmark suite of four datasets for evaluating the fairness of pre-trained legal language models and the techniques used to fine-tune them for downstream tasks. Our benchmarks cover four jurisdictions (European Council, USA, Swiss, and Chinese), five languages (English, German, French, Italian and Chinese) and fairness across five attributes (gender, age, nationality/region, language, and legal area). In our experiments, we evaluate pre-trained language models using several group-robust fine-tuning techniques and show that none of these combinations guarantee fairness, nor consistently mitigate group disparities. Furthermore, we analyze what causes performance differences across groups, and how group-robust fine-tuning techniques fail to mitigate group disparities under both representation inequality and temporal distribution swift.",
    "creator" : null
  }
}