{
  "name" : "ARR_2022_236_paper.pdf",
  "metadata" : {
    "source" : "CRF",
    "title" : "Twitter-COMMs: Detecting Climate, COVID, and Military Multimodal Misinformation",
    "authors" : [ ],
    "emails" : [ ],
    "sections" : [ {
      "heading" : "1 Introduction",
      "text" : "Out-of-context images are a popular form of misinformation where an image is miscaptioned to support a false claim (Fazio, 2020). Such image repurposing is extremely cheap yet can be as damaging as more sophisticated fake media. In this work we focus on domains important for society and national security, where implications of inexpensive yet effective misinformation can be immense.\nSpecifically, we aim to analyze multimodal Twitter posts that are of significant public interest, related to a specific set of topics spanning COVID-19, Climate Change and Military Vehicles. Our goal is to learn to categorize such image-text posts as pristine or falsified (out-of-context) by means of detecting semantic inconsistencies between images and text. To that end, we first collect a large-scale dataset of multimodal tweets, denoted TwitterCOMMs, with over 884k tweets. In our approach,\nwe fuse input image and text embeddings generated by CLIP (Radford et al., 2021) with an elementwise product, and we train a classifier to distinguish real tweets from automatically constructed random and hard mismatches. To validate this approach and demonstrate the usefulness of the collected data, we report results on an in-the-wild human-generated evaluation set, created to mimic real-world misinformation. We discuss the results and model ablations, and provide additional insights into the challenges of this task. We will release our data and models upon acceptance."
    }, {
      "heading" : "2 Related Work",
      "text" : "There exist a number of large-scale Twitter datasets concentrated on topics such as COVID-19 (Banda et al., 2021) or Climate Change (Littman and Wrubel, 2019). However, it remains difficult to collect labeled misinformation. Researchers have collected COVID-19 misconceptions on social media via manual annotation (Hossain et al., 2020) or by linking to fact checking articles (Patwa et al., 2021). Not only are these datasets small (a few thousand samples), but they focus on false claims rather than multimodal inconsistency.\nIn the news domain, Luo et al. (2021) automatically generate out-of-context images. Here, we curate social media posts that are topical and multimodal, and demonstrate an application to misinformation detection of human-generated fakes. There also exist general approaches for multimodal fact checking, e.g., Jaiswal et al. (2017) and MüllerBudack et al. (2020) that query an external knowledge base. Instead, we use a large pretrained model that does not require an external reference set."
    }, {
      "heading" : "3 Twitter-COMMs Dataset",
      "text" : "Here, we describe our data collection strategies behind Twitter-COMMs, which consists of multimodal tweets covering the topics of COVID-19, Climate Change, and Military Vehicles.\nData Collection: We collected data using Twitter API v21 in three stages for COVID-19 and Climate Change, and two stages for Military Vehicles, refining the filters at each stage to acquire more relevant tweets. COVID-19 and Climate Change stages progressed from simple high level keywords towards more specific ones in stage two and tweets authored by news organizations in the final stage. For Military Vehicles the first stage used high level search terms such as “military”, “aircraft”, “tank”, which resulted in noisy data, so the second stage used a large number of highly specific terms related to vehicle models. Full details can be found in Appendix A.1. We employed the following global filters for all topics: (1) language=English, (2) has at least one image, and (3) not a retweet.\nIn total, we have collected 884, 331 tweets, each having at least one image (composed of 24% Climate Change, 64.5% COVID-19, and 11.5% Military Vehicles tweets respectively). Tweets from the topics Climate Change and Military Vehicles were collected starting from June 2016 and COVID-19 starting from February 2020, all ending in September 2021. Examples are given in Figure 1.\nFalsified Samples: In addition to the pristine samples described above, we automatically generate falsified samples where there is some inconsis-\n1https://developer.twitter.com/en/docs/twitter-api/gettingstarted/about-twitter-api\ntency between image and text. We create random negatives (denoted as “Random”) by selecting an image for a given caption at random. We also create hard negatives (denoted as “Hard”) by retrieving the image of the sample with the greatest textual similarity for a given caption (following the “Semantics / CLIP Text-Text” split from Luo et al. (2021)). We mainly generate mismatches within each topic (COVID-19, Climate Change, Military Vehicles), except for a small set of random mismatches across topics (denoted as “Cross Topic”). Our dataset is balanced with respect to labels, where half of the samples are pristine and half are falsified. Table 1 presents summary statistics for the falsified training samples. We detail our development set and other data used for evaluation in the next section."
    }, {
      "heading" : "4 Experiments",
      "text" : "Next, we discuss the data used for evaluation, present our approach and ablate various design choices, report results on our evaluation sets, and provide additional analysis of the task difficulty."
    }, {
      "heading" : "4.1 Evaluation Sets",
      "text" : "We report results on three evaluation sets. (a) We validate our approach on samples synthetically generated using the same procedure as our training set (denoted Dev), where all topics and falsification methods are equally represented (i.e., the ratio of random vs. hard negatives is 50-50). We also evaluate on human-curated samples from the DARPA Semantic Forensics (SemaFor) Program2 derived from (b) news images and captions (denoted hNews) and (c) Twitter (denoted hTwitter). To generate this data, humans manually introduced\n2SemaFor focuses on the development of defenses against misinformation and falsified media. https://www.darpa.mil/program/semantic-forensics\ninconsistencies to pristine image-caption pairs.3 While hNews/hTwitter data is not real misinformation, it is in-the-wild w.r.t. our synthetic training data and much more representative of real-world human-generated misinformation. All three evaluation sets contain a mixture of samples relevant to the topics of COVID-19, Climate Change, and Military Vehicles (Figure 2). Table 2 provides the number of samples in each set. While the hNews set is available to us, the hTwitter set is hidden."
    }, {
      "heading" : "4.2 Approach and Design Choices",
      "text" : "For our approach we fine-tune CLIP (Radford et al., 2021), a large pretrained multimodal model that maps images and text into a joint embedding space via contrastive learning. Our model generates CLIP embeddings using the RN50x16 backbone, multiplies the image and text embeddings, and passes the result to a classifier that scores whether the pair is pristine or falsified. We use a learning rate of 5e-08 for CLIP and 5e-05 for the classifier and train for 16 epochs. For our baseline CLIP Zero Shot model, we generate CLIP embeddings off the shelf and compute a dot product, which is used to score the pair. For more details and ablations, see the Appendix.\nWe report metrics for varying thresholds over the predicted scores; in most tables we report balanced classification accuracy at equal error rate (Acc @ EER). We also report falsified class accuracy at two\n3We thank PAR Tech, Syracuse University, and the University of Colorado, Denver for creating the evaluation data.\nthresholds (pD @ 0.1 FAR and pD @ EER).\nMultimodal Fusion: First, we compare different multimodal fusion techniques, see Table 3. We try three fusion methods: concatenating the CLIP image and text embeddings (Concat), concatenating the embeddings and their dot product (Concat + Dot), and multiplying the embeddings elementwise (Multiply). Inspired by how CLIP was trained to maximize the dot product of normalized imagetext pairs, Concat + Dot and Multiply incentivize the classifier to stay faithful to the pre-initialized joint embedding space. These architecture choices yield on average a 7% performance improvement over simple concatenation. For future experiments we choose to use the Multiply method."
    }, {
      "heading" : "4.3 Results and Analysis",
      "text" : "Results on hNews, hTwitter Sets: Our final model was directly fine-tuned on the entire training set of over 2M training samples, with a ratio of 75% hard and 25% random negatives. We report results in Table 5, comparing to CLIP Zero Shot. We improve by 11% in pD @ 0.1FAR, meaning that our method is able to detect more falsified samples with minimal false alarms. At equal error rate we improve by 5% in both detection and accuracy. We emphasize that the hTwitter data is unseen to us.\nNext, we analyze the performance of our final model w.r.t. several characteristics on our Dev set.\nOCR Coverage: Given that text present in images can often be used to corroborate captions, we break down model performance by the amount of text detected by an English OCR model4. In Table 6 (top), we report results broken down by the % of the image covered by text (the area of the union of text detections divided by the image size). Each bucket roughly corresponds to natural images, natural images with scene text, graphics, and screenshots of text. The presence of any text yields more than a 6% improvement for pD @ 0.1FAR and performance peaks at 10-50% coverage.\nTweet Text Clustering: Finally, we analyze the sub-topics obtained as a result of clustering Tweets within each topic5. This allows us to tease out clus-\n4https://github.com/JaidedAI/EasyOCR 5The clustering process was performed by computing SentenceBERT (Reimers and Gurevych, 2019) embeddings for each Tweet text, using UMAP (McInnes et al., 2020) to reduce the embedding dimensions from 768 to 20, and running the"
    }, {
      "heading" : "5 Conclusion",
      "text" : ""
    }, {
      "heading" : "6 Ethical Considerations",
      "text" : "Here, we discuss ethical considerations regarding our work. Image repurposing is a prominent societal issue that lacks sufficient training data in general, and in particular for content on social media platforms such as Twitter. Even more, our work aims to be proactive in studying the threat of out-ofcontext media and proposes an approach for detecting such misinformation. By presenting a dataset, a detection approach, and several key observations about falsified out-of-context Tweets, we hope that our work serves as a net benefit for society.\nHow was the data collected? We collected data using the Twitter Search API v2. Our methodology is described in detail in Appendix A.1.\nWhat are the intellectual property rights? Twitter owns the intellectual property for the Tweets in our Twitter-COMMs dataset. We adhere to the restrictions they place on Tweets downloaded via their API, namely that we may not share the content downloaded from the API, but we plan to release the Tweet ID’s — which others can use to download the Tweets and images from the API — upon paper acceptance.\nHow did we address participant privacy rights? N/A\nWere annnotators treated fairly? Did we require review from a review board? N/A\nWhich populations do we expect our dataset to work for? Our dataset is specific to social media posts from Twitter that are written in English; it will primarily be useful for audiences from English speaking countries, such as the US, UK, Australia, and India. The biases inherent to the short text style (280 characters or less) and of Tweets with images will be useful for those interested in researching multimodal misinformation on Twitter.\nWhat is the generalizability of our claims? Our results apply primarily to Tweets on our three topics of interest (COVID-19, Climate Change, Military Vehicles) written in English and having at least one attached image.\nHow did we ensure dataset quality? Our data collection methodology is described in detail in Appendix A.1. To address data quality for Military Vehicles we created an image classifier to filter out tweets that did not have images of military vehicles or aircraft (Appendix A.1.2). Additionally, the sub-topic clustering we performed (Section 4.3, Appendix A.3.5) reveals that most of the text falls into clusters that are related to the three main topics.\nWe also provide some statistics for tweets with possibly sensitive content as flagged by Twitter in Table 14 (Appendix).\nWhat is the climate impact? Our final model used 8 days of training on 10 GPUs. Additional experiments such as the investigation of text image relationships used 4 days on a single GPU, and tweet text clustering used 10 hours on a single GPU. The GPU used for all experiments were GeForce 2080 RTX Ti’s. In total we used 2,026 GPU hours, and total emissions are estimated to be 218.81 kgCO2eq of which 0 percents were directly offset. Estimations were conducted using the MachineLearning Impact calculator presented in (Lacoste et al., 2019).\nWhat are the potential dataset biases? Here, we focus on our method used to generate hard falsified samples to understand the potential biases learned during training. Specifically, we note potential age, race, and gender biases present in CLIP, the underlying model used to generate our mismatches. Radford et al. (2021) find the CLIP exhibits significant performance differences when classifying individuals of different races and ages into categories related to crime or animals. Agarwal et al. (2021) also find gender biases in the CLIP embeddings when classifying occupations. These biases primarily affect the synthetically generated training set, not the pristine data. However, we can not rule out that the pristine Twitter data may also capture some human biases or harmful stereotypes."
    }, {
      "heading" : "A Appendix",
      "text" : "In Section A.1 we provide additional details about data collection, including our strategy and search keywords. Section A.2 provides dataset statistics, including information on tweet counts, geographical information, possibly sensitive content, and image availability. We report results for additional experiments in Section A.3."
    }, {
      "heading" : "A.1 Data Collection",
      "text" : ""
    }, {
      "heading" : "A.1.1 COVID-19 and Climate Change",
      "text" : "Our data collection consisted of three stages. The first employed simple topic, keyword, and hashtag filters, the second stage used more specific keyword and topic combinations, while the third focused on collecting topical data from Twitter accounts of various news organizations.\nIn the first stage we collected roughly 100,000 tweets each for COVID-19 and Climate Change topics. We used the “COVID-19” topic of the Twitter API’s Entity Annotations feature6, which allows users to find tweets related to predetermined topics. For Climate Change we filtered with an OR clause on keywords “climate change”, “global warming”, and (#globalwarming, #climatechange) hashtags. Inspection of the stage 1 results revealed a lot of off-topic tweets. For example, a Twitter user might post a tweet about working from home during the pandemic and tag the tweet with a COVID-related hashtag. While this type of content is somewhat related to COVID-19, we wanted to focus on data where misinformation/disinformation might be more relevant, such as more topical/newsworthy tweets (e.g. bad actors may spread propaganda related to the COVID-19 pandemic by making false or misleading claims). To that end, in stage 2 we filtered by combining each topic phrase with one of the 19 topical search terms (e.g. “agriculture”, “crops”, “death”, “vaccination”). The resulting data appeared much more relevant than the initial collection effort. Table 7 contains a list of the search terms we used to collect data for COVID-19 and Climate Change tweets. Finally, related to the argument above, in the third collection stage we focused on tweets authored by news organizations, as opposed to random users. For that, 7k news organization Twitter handles were sourced from WikiData7."
    }, {
      "heading" : "A.1.2 Military Vehicles",
      "text" : "to 97% accuracy and used it to filter out any tweets predicted to be in the “other” category. For the second collection stage we combined the military vehicle and aircraft names with custom keywords (Table 9).\nA.2 Dataset Statistics\nTable 10 shows a summary of the dataset. The “Geo-tagged” column refers to the geolocation data provided by tweet authors. This property is empty in most cases, but when present, can be in the form of a Twitter “place” which contains a display name, a geo polygon (which in some cases is as broad as an entire country), as well as other fields, such as country name. It is also possible for the geo data to be in the form of latitude and longitude, but that is rarer. The “Countries” columns is extracted from the geo location data and because of the small amount of geo-tagged tweets we can only report countries for a small fraction of tweets in the dataset (Table 11).\nOne oddity to note is that although we included an English-only search filter (“lang:en”) in all API calls, the API still returned a small number of non-English tweets (Table 12). We are not sure why this is, but manual inspection of some of these examples shows that a good portion of them are in fact in English.\nFigure 3 shows high-level “word cloud” summaries for the hashtags in the tweets for each topic. Table 14 shows the number of tweets that Twitter flagged as containing possibly sensitive material, i.e., samples that may contain adult content or graphic violence. We encourage users to be aware of such tweets, which account for about 1% of the data, and may be undesirable for certain downstream tasks.\nThe total number of images/tweets is shown in Table 15. Twitter allows users to include 1-4 images in a tweet. As seen in Table 16, 90% of the tweets have a single image. In cases where a tweet contained\nmore than one image, we only used the first image (according to the order of the images returned by the Twitter API)."
    }, {
      "heading" : "A.3 Additional Experiments",
      "text" : "All experiments reported in this paper are for a single run, as we find that variance across multiple runs is low. All ROC curves and metrics are computed using sklearn’s roc_curve function. All models are implemented in PyTorch. For our experiments, we make the following design choices:\n• We use the RN50x16 backbone. We find that this backbone consistently yields a 2-3% improvement compared to other released backbones, such as ViT/B-32. Our final CLIP model contains ∼300M parameters initialized from the RN50x16 backbone and ∼600k parameters randomly initialized for our classifier. • We tune the upper layers and keep CLIP’s lower layers frozen8. We find that this scheme is more memory efficient and yields more stable convergence than tuning all the layers. • We use a learning rate of 5e-08 for CLIP and 5e-05 for the classifier. From our hyperparameter sweeps we find this setting to be the most appropriate, as CLIP is pretrained while the classifier is randomly initialized. • We multiply CLIP image and text embeddings before passing that as an input to the classifier. This is different from Luo et al. (2021), who used a simple feature concatenation."
    }, {
      "heading" : "A.3.1 Expert vs. Joint Training",
      "text" : "Here we study whether training a joint model on all three topics at once may be inferior to training three topic-specific experts, see Figure 4. We find that the joint model performs on par with or better than the expert models, thus we use a joint model in all the other experiments."
    }, {
      "heading" : "A.3.2 Fine-Tuning Scheme",
      "text" : "Since we only know the high-level topics but not the precise composition of samples in our hidden set hTwitter, we investigate methods for out-of-domain robustness. Specifically, we try the scheme from (Anonymous, 2022), where the authors first optimize the classifier while keeping the pretrained feature extractor frozen (linear probing), then optimize the entire network (fine-tuning). The intuition behind this method is that a good initialization from linear probing minimizes the chance of feature distortion, i.e. when the pretrained model overfits to in-domain data. We report the results in Table 17. In fact, we find that direct fine-tuning (FT) achieves slightly better performance on both in-domain Twitter data and out-of-domain news data (hNews). Thus, in other experiments we use direct fine-tuning.\n8We fine-tune the layers “visual.layer4”, “visual.attnpool”, “transformer.resblocks.11”, “ln_final”, “text_projection”, “logit_scale”."
    }, {
      "heading" : "A.3.3 Training Set Size",
      "text" : "We also investigate the influence of training set size on performance. We report the binary classification accuracy as we use 500k, 1M, and 2M samples, as seen in Table 18. We observe that increasing training data size generally leads to improved performance, with most of the gains coming from higher accuracy on hard negatives."
    }, {
      "heading" : "A.3.4 Text-Image Relationship",
      "text" : "Within social media, there exist more complex interactions than the direct relationships seen in formats like image alt-text. As such, we trained a CLIP model on the dataset presented by (Vempala and PreoţiucPietro, 2019) to characterize these relationships, including classifying if the image content adds additional meaning (image adds / does not add) or if there is semantic overlap between the text and image (text represented / not represented).9 As observed in Table 19, for samples with text represented model performance improves by 8% and for samples where image adds performance improves by 4% for detection in a high precision regime (pD @ 0.1FAR). Although the text-image relationship model has somewhat noisy classifications for the text task, the text represented class generally contains samples with a shared entity between image and text, which would make fine-grained misinformation detection easier. The image adds class mostly contains infographics, likely due to training set bias, which aligns with the OCR coverage experiments in Section 4 in the main paper that demonstrate more image text makes samples easier to classify."
    }, {
      "heading" : "A.3.5 Tweet Text Clustering",
      "text" : "We investigate the sub-topical clusters of the tweet text, and also evaluate the performance of the final finetuned model in terms of how well it performs on a set of the hard falsified samples and their corresponding\n9This model achieves 86% and 62% on the image and text binary classification tasks respectively, which is a 4-5% improvement over the best models presented in the original paper.\npristine samples. We use the method of (Grootendorst, 2020) to generate clusters. We compute the ten most important words for each cluster using the TF-IDF scores, and use this word list to gain insight into the concepts present in the texts of each cluster. See Section 4 in the main paper for additional details.\nFor UMAP we use the 10 nearest neighbors. For Climate Change HDBSCAN hyperparameters are: minimum topic size=400, and a cluster selection distance threshold = 0.56. For COVID-19 HDBSCAN: minimum topic size=1200, and cluster selection distance threshold = 0.65. For Military Vehicles HDBSCAN: minimum topic size = 100, cluster selection distance threshold = 0.60. The cluster selection size setting determines when clusters are merged, clusters within a smaller distance than this threshold setting will get merged together (see HDBSCAN(ϵ̂) parameter in section IV of (Malzer and Baum, 2020)).\nAs discussed in the main paper, we are interested in analyzing model performance on within-cluster vs. cross-cluster hard samples. First, the training data statistics per topic are presented in Table 20. Next, Figure 6 shows the ROC curves for the within-cluster and cross-cluster samples.\nTo gain insight into the sub-topics, we concatenate the 3 top scoring words from each cluster to obtain the cluster “names”, as seen in the Tables 21, 22, 23 with cluster names and word scores. We get between 20 and 30 clusters for each topic. We observe such sub-topics as ocean-sea-flood-flooding, plasticrecycling-recycle-sustainability for Climate Change, vaccine-vaccination-clinic-appointment, schoolstudent-education-university for COVID-19, tank-abrams-army-m1, drone-ai-uav-drones for Military Vehicles. The hierarchy visualizations in Figures 7, 8, 9 provide further insight into the sub-topic structure."
    } ],
    "references" : [ {
      "title" : "Evaluating clip: Towards characterization of broader capabilities and downstream implications",
      "author" : [ "Sandhini Agarwal", "Gretchen Krueger", "Jack Clark", "Alec Radford", "Jong Wook Kim", "Miles Brundage." ],
      "venue" : "arXiv:2108.02818.",
      "citeRegEx" : "Agarwal et al\\.,? 2021",
      "shortCiteRegEx" : "Agarwal et al\\.",
      "year" : 2021
    }, {
      "title" : "Fine-tuning distorts pretrained features and underperforms out-of-distribution",
      "author" : [ "Anonymous." ],
      "venue" : "Submitted to The Tenth International Conference on Learning Representations. Under review.",
      "citeRegEx" : "Anonymous.,? 2022",
      "shortCiteRegEx" : "Anonymous.",
      "year" : 2022
    }, {
      "title" : "A large-scale covid-19 twitter chatter dataset for open scientific research—an international collaboration",
      "author" : [ "Juan M. Banda", "Ramya Tekumalla", "Guanyu Wang", "Jingyuan Yu", "Tuo Liu", "Yuning Ding", "Ekaterina Artemova", "Elena Tutubalina", "Gerardo Chowell" ],
      "venue" : null,
      "citeRegEx" : "Banda et al\\.,? \\Q2021\\E",
      "shortCiteRegEx" : "Banda et al\\.",
      "year" : 2021
    }, {
      "title" : "Out-of-context photos are a powerful low-tech form of misinformation",
      "author" : [ "Lisa Fazio." ],
      "venue" : "theconversation.com/out-of-context-photos-area-powerful-low-tech-form-of-misinformation129959.",
      "citeRegEx" : "Fazio.,? 2020",
      "shortCiteRegEx" : "Fazio.",
      "year" : 2020
    }, {
      "title" : "Bertopic: Leveraging bert and c-tf-idf to create easily interpretable topics",
      "author" : [ "Maarten Grootendorst" ],
      "venue" : null,
      "citeRegEx" : "Grootendorst.,? \\Q2020\\E",
      "shortCiteRegEx" : "Grootendorst.",
      "year" : 2020
    }, {
      "title" : "COVIDLies: Detecting COVID-19 misinformation on social media",
      "author" : [ "Tamanna Hossain", "Robert L. Logan IV", "Arjuna Ugarte", "Yoshitomo Matsubara", "Sean Young", "Sameer Singh." ],
      "venue" : "Proceedings of the 1st Workshop on NLP for COVID-19 (Part 2)",
      "citeRegEx" : "Hossain et al\\.,? 2020",
      "shortCiteRegEx" : "Hossain et al\\.",
      "year" : 2020
    }, {
      "title" : "Multimedia semantic integrity assessment using joint embedding of images and text",
      "author" : [ "Ayush Jaiswal", "Ekraam Sabir", "Wael AbdAlmageed", "Premkumar Natarajan." ],
      "venue" : "Proceedings of the 25th ACM international conference on Multimedia.",
      "citeRegEx" : "Jaiswal et al\\.,? 2017",
      "shortCiteRegEx" : "Jaiswal et al\\.",
      "year" : 2017
    }, {
      "title" : "Quantifying the carbon emissions of machine learning",
      "author" : [ "Alexandre Lacoste", "Alexandra Luccioni", "Victor Schmidt", "Thomas Dandres." ],
      "venue" : "arXiv:1910.09700.",
      "citeRegEx" : "Lacoste et al\\.,? 2019",
      "shortCiteRegEx" : "Lacoste et al\\.",
      "year" : 2019
    }, {
      "title" : "Climate Change Tweets Ids",
      "author" : [ "Justin Littman", "Laura Wrubel" ],
      "venue" : null,
      "citeRegEx" : "Littman and Wrubel.,? \\Q2019\\E",
      "shortCiteRegEx" : "Littman and Wrubel.",
      "year" : 2019
    }, {
      "title" : "Newsclippings: Automatic generation of out-ofcontext multimodal media",
      "author" : [ "Grace Luo", "Trevor Darrell", "Anna Rohrbach." ],
      "venue" : "Proceedings of the 2021 Conference on Empirical Methods in Natural Language Processing.",
      "citeRegEx" : "Luo et al\\.,? 2021",
      "shortCiteRegEx" : "Luo et al\\.",
      "year" : 2021
    }, {
      "title" : "A hybrid approach to hierarchical density-based cluster selection",
      "author" : [ "Claudia Malzer", "Marcus Baum." ],
      "venue" : "2020 IEEE International Conference on Multisensor Fusion and Integration for Intelligent Systems (MFI), pages 223–228. IEEE.",
      "citeRegEx" : "Malzer and Baum.,? 2020",
      "shortCiteRegEx" : "Malzer and Baum.",
      "year" : 2020
    }, {
      "title" : "Accelerated hierarchical density based clustering",
      "author" : [ "Leland McInnes", "John Healy." ],
      "venue" : "2017 IEEE International Conference on Data Mining Workshops (ICDMW).",
      "citeRegEx" : "McInnes and Healy.,? 2017",
      "shortCiteRegEx" : "McInnes and Healy.",
      "year" : 2017
    }, {
      "title" : "Umap: Uniform manifold approximation and projection for dimension reduction",
      "author" : [ "Leland McInnes", "John Healy", "James Melville." ],
      "venue" : "arXiv:1802.03426.",
      "citeRegEx" : "McInnes et al\\.,? 2020",
      "shortCiteRegEx" : "McInnes et al\\.",
      "year" : 2020
    }, {
      "title" : "Multimodal analytics for real-world news using measures of cross-modal entity consistency",
      "author" : [ "Eric Müller-Budack", "Jonas Theiner", "Sebastian Diering", "Maximilian Idahl", "Ralph Ewerth." ],
      "venue" : "ACM ICMR.",
      "citeRegEx" : "Müller.Budack et al\\.,? 2020",
      "shortCiteRegEx" : "Müller.Budack et al\\.",
      "year" : 2020
    }, {
      "title" : "Fighting an infodemic: Covid-19 fake news dataset",
      "author" : [ "Parth Patwa", "Shivam Sharma", "Srinivas Pykl", "Vineeth Guptha", "Gitanjali Kumari", "Md Shad Akhtar", "Asif Ekbal", "Amitava Das", "Tanmoy Chakraborty." ],
      "venue" : "Communications in Computer and Information Sci-",
      "citeRegEx" : "Patwa et al\\.,? 2021",
      "shortCiteRegEx" : "Patwa et al\\.",
      "year" : 2021
    }, {
      "title" : "Learning transferable visual models from natural language supervision",
      "author" : [ "Alec Radford", "Jong Wook Kim", "Chris Hallacy", "Aditya Ramesh", "Gabriel Goh", "Sandhini Agarwal", "Girish Sastry", "Amanda Askell", "Pamela Mishkin", "Jack Clark" ],
      "venue" : null,
      "citeRegEx" : "Radford et al\\.,? \\Q2021\\E",
      "shortCiteRegEx" : "Radford et al\\.",
      "year" : 2021
    }, {
      "title" : "Sentence-bert: Sentence embeddings using siamese bert-networks",
      "author" : [ "Nils Reimers", "Iryna Gurevych." ],
      "venue" : "Proceedings of the 2019 Conference on Empirical Methods in Natural Language Processing.",
      "citeRegEx" : "Reimers and Gurevych.,? 2019",
      "shortCiteRegEx" : "Reimers and Gurevych.",
      "year" : 2019
    }, {
      "title" : "Efficientnet: Rethinking model scaling for convolutional neural networks",
      "author" : [ "Mingxing Tan", "Quoc Le." ],
      "venue" : "International Conference on Machine Learning, pages 6105–6114. PMLR.",
      "citeRegEx" : "Tan and Le.,? 2019",
      "shortCiteRegEx" : "Tan and Le.",
      "year" : 2019
    }, {
      "title" : "Categorizing and inferring the relationship between the text and image of Twitter posts",
      "author" : [ "Alakananda Vempala", "Daniel Preoţiuc-Pietro." ],
      "venue" : "Proceedings of the 57th Annual Meeting of the Association for Computational Linguistics, pages 2830–2840, Florence,",
      "citeRegEx" : "Vempala and Preoţiuc.Pietro.,? 2019",
      "shortCiteRegEx" : "Vempala and Preoţiuc.Pietro.",
      "year" : 2019
    }, {
      "title" : "2021), who used a simple feature concatenation. A.3.1 Expert vs. Joint Training Here we study whether training a joint model on all three topics at once may be inferior to training three topic-specific experts, see Figure 4. We find that the joint model performs on par with or better than the expert models, thus we use a joint model in all the other experiments",
      "author" : [ "Luo" ],
      "venue" : null,
      "citeRegEx" : "Luo,? \\Q2021\\E",
      "shortCiteRegEx" : "Luo",
      "year" : 2021
    } ],
    "referenceMentions" : [ {
      "referenceID" : 3,
      "context" : "Out-of-context images are a popular form of misinformation where an image is miscaptioned to support a false claim (Fazio, 2020).",
      "startOffset" : 115,
      "endOffset" : 128
    }, {
      "referenceID" : 15,
      "context" : "In our approach, we fuse input image and text embeddings generated by CLIP (Radford et al., 2021) with an elementwise product, and we train a classifier to distinguish real tweets from automatically constructed random and hard mismatches.",
      "startOffset" : 75,
      "endOffset" : 97
    }, {
      "referenceID" : 2,
      "context" : "There exist a number of large-scale Twitter datasets concentrated on topics such as COVID-19 (Banda et al., 2021) or Climate Change (Littman and Wrubel, 2019).",
      "startOffset" : 93,
      "endOffset" : 113
    }, {
      "referenceID" : 5,
      "context" : "collected COVID-19 misconceptions on social media via manual annotation (Hossain et al., 2020) or by linking to fact checking articles (Patwa et al.",
      "startOffset" : 72,
      "endOffset" : 94
    }, {
      "referenceID" : 14,
      "context" : ", 2020) or by linking to fact checking articles (Patwa et al., 2021).",
      "startOffset" : 48,
      "endOffset" : 68
    }, {
      "referenceID" : 15,
      "context" : "For our approach we fine-tune CLIP (Radford et al., 2021), a large pretrained multimodal model that maps images and text into a joint embedding space via contrastive learning.",
      "startOffset" : 35,
      "endOffset" : 57
    }, {
      "referenceID" : 16,
      "context" : "com/JaidedAI/EasyOCR (5)The clustering process was performed by computing SentenceBERT (Reimers and Gurevych, 2019) embeddings for each Tweet text, using UMAP (McInnes et al.",
      "startOffset" : 87,
      "endOffset" : 115
    }, {
      "referenceID" : 12,
      "context" : "com/JaidedAI/EasyOCR (5)The clustering process was performed by computing SentenceBERT (Reimers and Gurevych, 2019) embeddings for each Tweet text, using UMAP (McInnes et al., 2020) to reduce the embedding dimensions from 768 to 20, and running the Table 6: Balanced binary classification accuracy at varying thresholds on Dev set broken down by % of image covered by text (top) and within- vs.",
      "startOffset" : 159,
      "endOffset" : 181
    }, {
      "referenceID" : 11,
      "context" : "HDBSCAN hierarchical clustering algorithm (McInnes and Healy, 2017) on the UMAP output.",
      "startOffset" : 42,
      "endOffset" : 67
    }, {
      "referenceID" : 7,
      "context" : "Estimations were conducted using the MachineLearning Impact calculator presented in (Lacoste et al., 2019).",
      "startOffset" : 84,
      "endOffset" : 106
    } ],
    "year" : 0,
    "abstractText" : "Detecting out-of-context media, such as “miscaptioned” images on Twitter, is a relevant problem, especially in domains of high public significance. In this work we aim to develop defenses against such misinformation for the topics of Climate Change, COVID-19, and Military Vehicles. We first present a large-scale multimodal dataset with over 884k tweets relevant to these topics. Next, we propose a detection method, based on the state-of-the-art CLIP model, that leverages automatically generated hard image-text mismatches. While this approach works well on our automatically constructed out-of-context tweets, we aim to validate its usefulness on data representative of the real world. Thus, we test it on a set of humangenerated fakes, created by mimicking in-thewild misinformation. We achieve an 11% detection improvement in a high precision regime over a strong baseline. Finally, we share insights about our best model design and analyze the challenges of this emerging threat.",
    "creator" : null
  }
}