{
  "name" : "ARR_2022_121_paper.pdf",
  "metadata" : {
    "source" : "CRF",
    "title" : "On the Use of Bert for Automated Essay Scoring: Joint Learning of Multi-Scale Essay Representation",
    "authors" : [ ],
    "emails" : [ ],
    "sections" : [ {
      "heading" : "1 Introduction",
      "text" : "AES is a very valuable task, which can promote the development of automated assessment and help teachers reduce the heavy burden of assessment. With the rise of online education in recent years, more and more researchers begin to pay attention to this field.\nAES systems mainly consist of two modules, which are essay representation and essay scoring modules. The essay representation module extracts features to represent an essay and the essay scoring module rates the essay with the extracted features.\nThe dominant approaches in AES can be grouped into three categories:\n• Traditional AES usually uses regressors or ranking systems with complicated handcrafted features to rate an essay (Larkey, 1998;\n1https://www.kaggle.com/c/asap-aes 2https://www.kaggle.com/c/\ncommonlitreadabilityprize/data\nRudner and Liang, 2002; Attali and Burstein, 2006; Yannakoudakis et al., 2011; Chen and He, 2013; Phandi et al., 2015; Cozma et al., 2018). These handcrafted features are based on the prior knowledge of linguists. Therefore they can achieve good performance even with small amounts of data.\n• Deep Neural Networks AES. The handcrafted features are effective in representing domain knowledge but are complicated to implement. Careful manual design makes these features less portable. Recently, deep neural network approaches for AES have made great progress and achieved comparable results with traditional AES (Taghipour and Ng, 2016; Dong and Zhang, 2016; Dong et al., 2017; Alikaniotis et al., 2016; Wang et al., 2018; Tay et al., 2018; Farag et al., 2018; Song et al., 2020; Ridley et al., 2021; Rodriguez et al., 2019; Mayfield and Black, 2020). Deep neural networks such as LSTM or CNN can automatically discover and learn complex features of essays, which makes AES an end-to-end task. Saving much time to design features, deep neural networks can transfer well among different AES tasks. By ensembling traditional and deep neural network approaches, AES can even obtain a better result, which benefits from both representations (Jin et al., 2018; Dasgupta et al., 2018; Uto et al., 2020). However, ensemble way still needs handcrafted features which cost numerous energy of researchers.\n• Pre-training AES uses the pre-trained language model as the initial essay representation module and fine-tune the model on the essay training set. Though the pre-trained methods have achieved the state-of-the-art performance in most NLP tasks, most of them (Uto et al., 2020; Rodriguez et al., 2019; Mayfield and\nBlack, 2020) fail to show an advantage over other deep learning methods (Dong et al., 2017; Tay et al., 2018) in AES task. As far as we know, the work from Cao et al. (2020) and Yang et al. (2020) are the only two pretraining approaches which surpass the other deep learning methods. Their improvement mainly comes from the training optimization. Cao et al. (2020) employ two self-supervised tasks and domain adversarial training, while Yang et al. (2020) combine regression and ranking to train their model.\nAs most pre-training AES methods fail to show an advantage over other deep learning methods, (Yang et al., 2020) considers the essay length is long while (Mayfield and Black, 2020) considers the hyper parameter optimization and curriculum learning are complex. (Rodriguez et al., 2019) suggests that the AES has reached its ceiling in terms of modeling. We additionally consider that the pretrained models are usually trained on sentences, and fail to learn enough knowledge of essays. Besides, the AES training data is quite limited, and it’s not a good choice to fine-tune the pre-trained models which are learned from sentence data directly in order to learn better representation of essays. Instead, we can explicitly model more effective representations as well as leveraging the knowledge learned from numerous sentence data.\nWhen a teacher rates an essay, the scores are often affected by multi-scale features of the essay, such as token level, sentence level and paragraph level, etc. For example, the features may include the numbers of words, the essay structure, the master degree of vocabulary and syntactic complexity, etc. These features come from different scales of the essay. However, the researchers who used pretrained models in previous work simply made use of the single scale features. This inspires us to extract multi-scale features from the essays which represent multi-level characteristics of the essays.\nMost of the deep neural networks approaches use LSTM or CNN in their work. Some researchers (Uto et al., 2020; Rodriguez et al., 2019; Mayfield and Black, 2020) attempt to use BERT (Devlin et al., 2019) in their AES systems but fail to achieve competitive results as previous state-of-the-art results of deep neural networks methods. We consider it caused by that multi-scale features are not effectively constructed in the representation layer of pre-trained model due to the lack\nof data for fine-tuning in the AES task. We need to explicitly model the multi-scale information of the essay data and combine it with the powerful linguistic knowledge of pre-trained model.\nIn addition, the loss function commonly used in the AES task is Mean Squared Error (MSE). For the AES task, the distribution of the sample population and the sorting properties between samples are also important issues for selecting the loss functions. They imitate the psychological process of teachers rating essays from overall student level considerations. Different optimization directions also can bring diversity to the final overall score distribution and contribute to the effect of ensemble learning.\nIn this paper, we introduce the joint learning of multi-scale essay representation into the AES task with BERT. To introduce the diversity of essay scoring distribution, we combine two other loss functions with MSE. As the training data is limited, we also employ transfer learning from outdomain essays which is inspired by (Song et al., 2020). Through the above attempts, our model outperforms the state-of-the-art deep learning models based on LSTM (Dong et al., 2017; Tay et al., 2018). When training our model with multiple losses and transfer learning using R-Drop, we almost achieve the state-of-the-art result among all deep learning models.\nIn summary, the contribution of this work is as follows:\n• We propose a novel essay scoring approach to jointly learn multi-scale essay representation with BERT, which significantly improve the result compared to traditionally using pretrained language models.\n• Our method shows significant advantages in long text tasks and obtains almost the state-ofthe-art result among all deep learning models in the ASAP task.\n• We introduce two other loss functions which are inspired by the mental process of teacher rating essays, and employ transfer learning from out-domain essays with R-Drop (Liang et al., 2021), which further improves the performance for rating essays."
    }, {
      "heading" : "2 Approach",
      "text" : ""
    }, {
      "heading" : "2.1 Task Formulation",
      "text" : "The AES task is defined as following:\nGiven an essay with n words X = {Xi}ni=1, we need to output one score y as a result of measuring the level of this essay.\nQuadratic Weighted Kappa (QWK) (Cohen, 1968) metric is commonly used to evaluate AES systems by researchers, which measures the agreement between the scoring results of two raters."
    }, {
      "heading" : "2.2 Multi-scale Essay Representation",
      "text" : "We decompose multi-scale into token-scale, segment-scale and document-scale. We will obtain the essay representation from these three scales.\nToken-scale and Document-scale Input We apply one pre-trained BERT (Devlin et al., 2019) model for token-scale and document-scale essay representations. The BERT tokenizer is used to split the essay into a token sequence T1 = [t1, t2, ......tn], where ti is the ith token and n is the number of the tokens in the essay. The token we mentioned in this paper all refer to WordPiece, which is obtained by the subword tokenization algorithm used for BERT. We construct a new sequence T2 from T1 as following. L is set to 510, which is the max sequence length supported by BERT except the token [CLS] and [SEP ].\nT2 = { [CLS]+[t1, t2, .., tL] + [SEP] n > L [CLS]+T1+[SEP] n = L [CLS]+T1+[PAD]∗(L− n)+[SEP] n < L\nThe final input representation are the sum of the token embeddings, the segmentation embeddings and the position embeddings. A detailed description can be found in the work of BERT (Devlin et al., 2019).\nDocument-scale The document-scale representation is obtained by the [CLS] output of the BERT model. As the [CLS] output aggregates the whole sequence representation, it attempts to extract the essay information from the most global granularity.\nToken-scale As the BERT model is pre-trained by Masked Language Modeling (Devlin et al., 2019), the sequence outputs can capture the context information to represent each token. An essay often consists of hundreds of tokens, thus RNN is not the proper choice to combine all the token information due to the gradients vanishing problem. Instead, we utilize a max-pooling operation to all the sequence outputs and obtain the combined token-scale essay representation. Specifically, the max-pooling layer generates a d-dimensional vector W = [w1, w2, ..., wj , ..., wd] and the element wj is computed as below:\nwj = max{h1,j , h2,j , ..., hn,j}\nwhere d is the hidden size of the BERT model. As we use the pre-trained BERT model bert-baseuncased 3, the hidden size d is 768. All the n sequence outputs of the BERT model are annotated as [h1, h2, ..., hi, ..., hn], where hi is a d-dimensional vector [hi,1, hi,2, ..., hi,d] representing the ith sequence output, and hi,j is the jth element in hi.\nSegment-scale Assuming the segment-scale value set is K = [k1, k2, ...ki, ..., kS ], where S is the number of segment scales we want to explore, and ki is the ith segment-scale in K. Given a token sequence T1 = [t1, t2, ......tn] for an essay, we obtain the segment-scale essay representation corresponding scale ki as follows:\n1. We define np as the maximum number of tokens corresponding to each essay prompt p. We truncate the token sequence to np tokens if the essay length is longer than np, otherwise we pad [PAD] to the sequence to reach the length np.\n2. Divide the token sequence into m = ⌈np/ki⌉ segments and each segment is of length ki except for the last segment, which is similar to the work of (Mulyar et al., 2019).\n3. Input each of the m segment tokens into the BERT model, and get m segment representation vectors from the [CLS] output.\n4. Use an LSTM model to process the sequence of m segments representations, followed by attention pooling operation on the hidden states of the LSTM output to obtain the segmentscale essay representation corresponding to scale ki.\nThe LSTM cell units process the sequence of segment representations and generate the hidden states as follows:\nit = σ(Qi · st + Ui · ht−1 + bi) ft = σ(Qf · st + Uf · ht−1 + bf )\nĉt = tanh(Qc · st + Uc · ht−1 + bc) ct = it ◦ ĉt + ft ◦ ct−1\not = σ(Qo · st + Uo · ht−1 + bo) ht = ot ◦ tanh(ct)\nwhere st is the tth segment representation from BERT [CLS] output and ht is the tth hidden state generated from LSTM. Qi, Qf , Qc, Qo, Ui, Uf ,\n3https://huggingface.co/ bert-base-uncased\nUc and Uo are weight matrices, and bi, bf , bc, and bo are bias vectors.\nThe attention pooling operation we use is similar to the work of (Dong et al., 2017), which is defined as follows:\nα̂i = tanh(Qa · hi + ba) αi = eqa·α̂i∑ eqa·α̂j\no= ∑\nαi · hi o is the segment-scale essay representation corresponding to the scale ki. αi is the attention weight for hidden state hi. Qa, ba, qa are the weight matrix, bias and weight vector respectively."
    }, {
      "heading" : "2.3 Model Architecture",
      "text" : "The model architecture is depicted in Figure 1.\nWe apply one BERT model to obtain the document-scale and token-scale essay representation. The concatenation of them is input into a dense regression layer which predicts the score corresponding to the document-scale and token-scale. For each segment-scale k with number of segments m, we apply another BERT model to get m CLS outputs, and apply an LSTM model followed by an attention layer to get the segment-scale representation. We input the segment-scale representation into another dense regression layer to get the scores corresponding to segment-scale k. The final score is obtained by adding the scores of all S segmentscales and the score of the document-scale and token-scale, which is illustrated as below:\ny = ∑\nyk + ydoc,tok yk = Ŵseg · ok + bseg\nydoc,tok = Ŵdoc,tok ·Hdoc,tok + bdoc,tok Hdoc,tok = wdoc ⊕ W\nyk is the predicted score corresponding to segment-scale k. ydoc,tok is the predicted score corresponding to the document-scale and tokenscale. Ŵseg and bseg are weight matrix and bias for segment-scale respectively. Wdoc,tok and bdoc,tok are weight matrix and bias for document and tokenscales, ok is the segment-scale essay representation with the scale k. wdoc is the document-scale essay representation. W is the word-scale essay representation. Hdoc,tok is the concatenation of documentscale and word-scale essay representations."
    }, {
      "heading" : "2.4 Loss Function",
      "text" : "We use three loss functions to train the model.\nMSE measures the average value of square errors between predicted scores and labels, which is\ndefined as below: MSE(y, ŷ) = 1N ∑ (yi − ŷi)2\nwhere yi and ŷi are the predicted score and the label for the ith essay respectively, N is the number of the essays.\nSimilarity (SIM) measures whether two vectors are similar or dissimilar by using cosine function. A teacher will take into account the overall level distribution of all the students when rating an essay. Following such intuition, we introduce the SIM loss to the AES task. In each training step, we take the predicted scores of the essays in the batch as the predicted vector y, and the labels as the label vector ŷ. The SIM loss awards the similar vector pairs to make the model think more about the correlation among the batch of essays. The SIM loss is defined as below:\nSIM(y, ŷ) = 1− cos(y, ŷ) y = [y1, y2, ..., yn] ŷ = [ŷ1, ŷ2, ..., ŷN ]\nwhere yi and ŷi are the predicted score and label for the ith essay respectively, N is the number of the essays.\nMargin Ranking (MR) measures the ranking orders for each essay pair in the batch. We intuitively introduce MR loss because the sorting property between essays is a key factor to scoring. For each batch of essays, we first enumerate all the essay pairs, and then compute the MR loss as follows. The MR loss attempts to make the model penalize wrong order.\nMR(y, ŷ) = 1N ∑ max(0,−rij(yi − yj) + b)\nrij =  1 ŷi > ŷj -1 ŷi < ŷj -sgn(yi − yj) ŷi = ŷj\nyi and ŷi are the predicted score and label for the ith essay respectively. N is the number of the essays. b is a hyper parameter, which is set to 0 in our experiment. For each sample pair (i, j), when the label ŷi is larger than ŷj , the predicted result yi should be larger than yj , otherwise, the pair contributes yj − yi to the loss. When ŷi is equal to ŷj , the loss is actually |yi − yj |.\nThe combined loss is described as below: Losstotal(y, ŷ) = αMSE(y, ŷ)+βMR(y, ŷ)+\nγSIM(y, ŷ). α, β, γ are weight parameters which are tuned according to the performance on develop set."
    }, {
      "heading" : "3 Experiment",
      "text" : ""
    }, {
      "heading" : "3.1 Data and Evaluation",
      "text" : "ASAP data set is widely used in the AES task, which contains eight different prompts. A detailed description can be seen in Table 1. For each prompt, the WordPiece length indicates the smallest number which is bigger than the length of 90% of the essays in terms of WordPiece number. We evaluate the scoring performance using QWK on ASAP data set, which is the official metric in the ASAP competition.\nCRP data set provides 2834 excerpts from several time periods and reading ease scores which range from -3.68 to 1.72. The average length of the excerpts is 175 and the WordPiece length is 252. We also use 5-fold cross validation to evaluate our system with a 60/20/20 split for train, develop and\ntest sets on CRP data set. As the RMSE mertic is used in CRP competition, we also use it to evaluate our system in ease score prediction task."
    }, {
      "heading" : "3.2 Baseline",
      "text" : "The baseline models for comparison are described as follows.\nEASE 4 is the best open-source system that participated in the ASAP competition and ranked the third place among 154 participants. EASE uses regression techniques with handcrafted features. Results of EASE with the settings of Support Vector Regression (SVR) and Bayesian Linear Ridge Regression (BLRR) are reported in (Phandi et al., 2015).\nCNN+RNN Various deep neural networks based on CNN and RNN for AES are studied by (Taghipour and Ng, 2016). They combine CNN ensembles and LSTM ensembles over 10 runs and get the best result in their experiment.\nHierarchical LSTM-CNN-Attention (Dong et al., 2017) builds a hierarchical sentencedocument model, which uses CNN to encode sentences and LSTM to encode texts. The attention mechanism is used to automatically determine the relative weights of words and sentences in generating sentence representations and text represen-\n4http://github.com/edx/ease\ntations respectively. They obtain the state-of-theart result among all neural models without pretraining.\nSKIPFLOW (Tay et al., 2018) proposes to use SKIPFLOW mechanism to model the relationships between snapshots of the hidden representations of an LSTM. The work of (Tay et al., 2018) also obtains the state-of-the-art result among all neural models without pre-training.\nDilated LSTM with Reinforcement Learning (Wang et al., 2018) proposes a method using a dilated LSTM network in a reinforcement learning framework. They attempt to directly optimize the model using the QWK metric which considers the rating schema.\nBERT+SST+DAT and HA-LSTM+SST+DAT (Cao et al., 2020) proposes to use two selfsupervised tasks and a domain adversarial training technique to optimize their training, which is the first work to use pre-trained language model to outperform LSTM based methods. They experiment with both hierarchical LSTM model and BERT in their work, which are HA−LSTM+SST+DAT and BERT + SST +DAT respectively.\nBERT2 (Yang et al., 2020) combine regression and ranking to fine-tune BERT model which also outperform LSTM based methods and even obtain the new state-of-the-art."
    }, {
      "heading" : "3.3 Settings",
      "text" : "To compare with the baseline models and further study the effectiveness of multi-scale essay representations, losses and transfer learning, we conduct the following experiments.\nMulti-Scale Models. These models are optimized with MSE loss, and BERT-DOC represents essays with document-scale features based on BERT. BERT-TOK represents essays with token-scale features based on BERT. BERT-DOCTOK represents essays with both document-scale and token-scale features based on BERT. BERTDOC-TOK-SEG represents essays with documentscale, token-scale, and multiple segment-scale features based on BERT. Longformer (Beltagy et al., 2020) is an extension for transformers with an attention mechanism that scales linearly with sequence length, making it easy to process long documents. We conduct experiments to show that our multi-scale features also works with Longformer and can further improve the performance in long text tasks. Longformer-DOC-TOK-SEG uses\ndocument-scale, token-scale, and multiple segmentscale features to represent essays, but based on Longformer instead of BERT. Longformer-DOC represents essays with document-scale features based on Longformer.\nModels with Transfer Learning. To transfer learn from the out-domain essays 5, we additionally employ a pre-training stage, which is similar to the work of (Song et al., 2020). In this stage, we scale all the labels of essays from out-domain data into range 0-1 and pre-train them with MSE loss. After the pre-training stage, we continue to finetune the model on in-domain essays. Tran-BERTMS has the same modules as BERT-DOC-TOKSEG with pre-training on out-domain data. MS means multiple scale features.\nModels with Multiple Losses. Based on TranBERT-MS model, we explore the performance of adding multiple loss functions. Tran-BERT-MSML additionally employs MR loss and SIM loss. ML means multiple losses. Tran-BERT-MS-MLR incorporates R-Drop strategy (Liang et al., 2021) in training based on Tran-BERT-MS-ML model.\nFor the proposed model architecture which is depicted in Figure 1, the BERT model in the left part are shared by the document-scale and token-scale essay representations, and the other BERT model in the right part are shared by all segment-scale essay representations. We use the \"bert-base-uncased\" which includes 12 transformer layers and the hidden size is 768. In the training stage, we freeze all the layers in the BERT models except the last layer, which is more task related than other layers. The Longformer model used in our work is \"longformer-base-4096\". For the MR loss, we set b to 0. The weights α, β and γ are tuned according to the performance on develop set. We use Adam optimizer (Kingma and Ba, 2015) to fine-tune model parameters in an end-to-end fashion with learning rate of 6e-5, β1=0.9, β2=0.999, L2 weight decay of 0.005. The coefficient weight α in R-Drop is 9. We set the batch size to 32. We use dropout in the training stage and the drop rate is set to 0.1. We train all the models for 80 epochs, and select the best model according the performance on the develop set. We use a greedy search method to find the best combination of segment scales, which is shown in detail in Appendix A. Following (Cao et al., 2020), we perform the significance test for\n5For each prompt, we use all the essays from other prompts in ASAP data set."
    }, {
      "heading" : "ID Models P1 P2 P8 Average",
      "text" : "our models."
    }, {
      "heading" : "3.4 Results",
      "text" : "Table 2 shows the performance of baseline models and our proposed models with joint learning of multi-scale essay representation. Table 3 shows the results of our model and the state-of-the-art models on essays in prompt 1, 2 and 8, whose averaged WordPiece lengths are longer than 510. We summarize some findings from the experiment results.\n• Our model 12 almost obtains the published state-of-the-art for neural approaches. For the prompts 1,2 and 8, the essays in which have more than 510 tokens, we improve the result from 0.761 to 0.772. The results demonstrate the effectiveness of the proposed framework for encoding and scoring essays. Before that, the conventional way of using BERT can not surpass the performance of models 4 and 6. We further re-implement BERT2 proposed by (Yang et al., 2020), and the performance is not so strong as the published state-of-theart like models 9, 10 and 12. Though (Uto et al., 2020) obtain a much better result(QWK 0.801), our method perform much better than their system with only neural features(QWK 0.730), which demonstrates the strong essay encoding ability of our neural approach.\n• Compared to the models 4 and 6, our model 11 uses multi-scale features to encode essays instead of LSTM based models, and we use the same regression loss to optimize the model. Our model simply changes the representation way and significantly improves the result from 0.764 to 0.782, which demonstrates the strong encoding ability armed by multi-scale representation for long text."
    }, {
      "heading" : "3.5 Further analysis",
      "text" : "Multi-scale representation We further analyze the effectiveness of employing each scale essay representation to the joint learning process.\nTable 4 and Table 5 show the performance of our models to represent essays on different feature scales, which are trained with MSE loss and without transfer learning. Table 4 shows the performance on ASAP data set while Table 5 shows the performance on CRP data set. The improvement of BERT-DOC-TOK-SEG over BERT-DOC, BERTTOK, BERT-DOC-TOK are significant (p<0.0001)\non CRP data set, and are significant (p<0.0001) in most cases on ASAP data set. Results on both table indicates the similar findings.\nReasons for Effectiness of Multi-scale representation Though the experiment shows the effectiveness of multi-scale representation, we further explore the reason. We could doubt that the effectiveness comes from supporting long sequences, not the multi-scale itself. As Longformer is good at dealing with long texts, we compare the results between Longformer-DOC and LongformerDOC-TOK-SEG. The results of the significance test show that the improvement of LongformerDOC-TOK-SEG over Longformer-DOC are significantly (p<0.0001) in most cases. Performance of the two models are shown in Table 6, we get the following findings.\n• Though Longformer-DOC supports long sequences encoding, it performs poor, which indicates us that supporting long sequence ability is not enough for a good essay scoring system.\n• Longformer-DOC-TOK-SEG outperforms Longformer-DOC significantly, which indicates the effectiveness of our model comes from encoding essays by multi-scale features, not only comes from the ability to deal with long texts.\nThese results are consistent with our intuition that our approach takes into account different level features of essays and predict the scores more accurately. We consider it caused by that multi-scale features are not effectively constructed in the representation layer of pre-trained model due to the lack of data for fine-tuning in the AES task. Therefore, we need to explicitly model the multi-scale information of the essay data and combine it with the powerful linguistic knowledge of pre-trained model.\nTransfer Learning with Multiple Losses and R-Drop We further explore the effectiveness of pretraining with adding multiple loss functions and employing R-Drop. As is shown in table 7, by incorporating the pre-training stage which learns the knowledge from out-domain data, Tran-BERT-MS model improves the result from 0.782 to to 0.788 compared to BERT-DOC-TOK-SEG model. The model Tran-BERT-MS-ML which jointly learns with multiple loss functions further improves the performance from 0.788 to 0.790. We consider it due to the reason that MR brings ranking information and SIM takes into account the overall score distribution information. Diverse losses bring different but positive influence on the optimization direction and act as an ensembler. By employing RDrop, Tran-BERT-MS-ML-R improves the QWK slightly, which comes from the fact that R-Drop plays a regularization role."
    }, {
      "heading" : "4 Conclusion and Future Work",
      "text" : "In this paper, we propose a novel multi-scale representation approach based on pre-trained language model, and employ multiple losses and transfer learning. We obtain the state-of-the-art results among deep learning models. In particular, multiscale representation has a very significant advantage in dealing with long text.\nOne of the future directions can be exploring more efficient and soft multi-scale representation. Introducing linguistic knowledge to segment a more reasonable scale may bring further improvement."
    }, {
      "heading" : "A Appendix",
      "text" : "All the segment-scales we explore range from 10 to 190. The interval between two neighbor scales is 20. As the combination number of all segment-scales is exponential, we use a greedy search method to find the best combination.\n1. Initialize the segment-scale value set R as the document-scale and token-scale.\n2. Experiment the combination of each segmentscale with the token-scale and document-scale essay representation, and compute the average QWK on develop set for all segment-scales, which is denoted as QWKave. The scale with higher QWK compared to QWKave is added to the candidate scale list L and the scales in\nL are sorted according to their QWK values from large to small.\n3. For each i from 1 to |L|, we perform experiments on the combination of the first i segment-scales in L with the token-scale and document-scale. The combination segmentscales with the best performance on develop set are added to the segment-scale value set R"
    } ],
    "references" : [ {
      "title" : "Automatic text scoring using neural networks",
      "author" : [ "Dimitrios Alikaniotis", "Helen Yannakoudakis", "Marek Rei." ],
      "venue" : "Proceedings of the 54th Annual Meeting of the Association for Computational Linguistics, pages 715–725.",
      "citeRegEx" : "Alikaniotis et al\\.,? 2016",
      "shortCiteRegEx" : "Alikaniotis et al\\.",
      "year" : 2016
    }, {
      "title" : "Automated essay scoring with e-rater® v.2",
      "author" : [ "Yigal Attali", "Jill Burstein" ],
      "venue" : "The Journal of Technology, Learning, and Assessment,",
      "citeRegEx" : "Attali and Burstein.,? \\Q2006\\E",
      "shortCiteRegEx" : "Attali and Burstein.",
      "year" : 2006
    }, {
      "title" : "Longformer: The long-document transformer",
      "author" : [ "Iz Beltagy", "Matthew E. Peters", "Arman Cohan." ],
      "venue" : "arXiv: Computation and Language.",
      "citeRegEx" : "Beltagy et al\\.,? 2020",
      "shortCiteRegEx" : "Beltagy et al\\.",
      "year" : 2020
    }, {
      "title" : "Domain-adaptive neural automated essay scoring",
      "author" : [ "Yue Cao", "Hanqi Jin", "Xiaojun Wan", "Zhiwei Yu." ],
      "venue" : "SIGIR ’20: Proceedings of the 43rd International ACM SIGIR Conference on Research and Development in Information.",
      "citeRegEx" : "Cao et al\\.,? 2020",
      "shortCiteRegEx" : "Cao et al\\.",
      "year" : 2020
    }, {
      "title" : "Automated essay scoring by maximizing human-machine agreement",
      "author" : [ "Hongbo Chen", "Ben He." ],
      "venue" : "Proceedings of the 2013 Conference on Empirical Methods in Natural Language Processing, pages 1741–1752.",
      "citeRegEx" : "Chen and He.,? 2013",
      "shortCiteRegEx" : "Chen and He.",
      "year" : 2013
    }, {
      "title" : "Weighted kappa: nominal scale agreement provision for scaled disagreement or partial credit",
      "author" : [ "J Cohen." ],
      "venue" : "Psychological bulletin, 70(4):213–220.",
      "citeRegEx" : "Cohen.,? 1968",
      "shortCiteRegEx" : "Cohen.",
      "year" : 1968
    }, {
      "title" : "Automated essay scoring with string kernels and word embeddings",
      "author" : [ "Mădălina Cozma", "Andrei M. Butnaru", "Radu Tudor Ionescu." ],
      "venue" : "Proceedings of the 56th Annual Meeting of the Association for Computational Linguistics.",
      "citeRegEx" : "Cozma et al\\.,? 2018",
      "shortCiteRegEx" : "Cozma et al\\.",
      "year" : 2018
    }, {
      "title" : "Augmenting textual qualitative features in deep convolution recurrent neural network for automatic essay scoring",
      "author" : [ "Tirthankar Dasgupta", "Abir Naskar", "Rupsa Saha", "Lipika Dey." ],
      "venue" : "Proceedings of the 5th Workshop on Natural Language Processing Tech-",
      "citeRegEx" : "Dasgupta et al\\.,? 2018",
      "shortCiteRegEx" : "Dasgupta et al\\.",
      "year" : 2018
    }, {
      "title" : "Bert: Pre-training of deep bidirectional transformers for language understanding",
      "author" : [ "Jacob Devlin", "Ming-Wei Chang", "Kenton Lee", "Kristina Toutanova." ],
      "venue" : "Proceedings of the 2019 Conference of the North American Chapter of the Association for Com-",
      "citeRegEx" : "Devlin et al\\.,? 2019",
      "shortCiteRegEx" : "Devlin et al\\.",
      "year" : 2019
    }, {
      "title" : "Automatic features for essay scoring – an empirical study",
      "author" : [ "Fei Dong", "Yue Zhang." ],
      "venue" : "Proceedings of the 2016 Conference on Empirical Methods in Natural Language Processing, pages 1072–1077.",
      "citeRegEx" : "Dong and Zhang.,? 2016",
      "shortCiteRegEx" : "Dong and Zhang.",
      "year" : 2016
    }, {
      "title" : "Attentionbased recurrent convolutional neural network for automatic essay scoring",
      "author" : [ "Fei Dong", "Yue Zhang", "Jie Yang." ],
      "venue" : "Proceedings of the 21st Conference on Computational Natural Language Learning (CoNLL 2017), pages 153–162.",
      "citeRegEx" : "Dong et al\\.,? 2017",
      "shortCiteRegEx" : "Dong et al\\.",
      "year" : 2017
    }, {
      "title" : "Neural automated essay scoring and coherence",
      "author" : [ "Youmna Farag", "Helen Yannakoudakis", "Ted Briscoe" ],
      "venue" : null,
      "citeRegEx" : "Farag et al\\.,? \\Q2018\\E",
      "shortCiteRegEx" : "Farag et al\\.",
      "year" : 2018
    }, {
      "title" : "Tdnn: A two-stage deep neural network for promptindependent automated essay scoring",
      "author" : [ "Cancan Jin", "Ben He", "Kai Hui", "Le Sun." ],
      "venue" : "Proceedings of the 56th Annual Meeting of the Association for Computational Linguistics, pages 1088–1097.",
      "citeRegEx" : "Jin et al\\.,? 2018",
      "shortCiteRegEx" : "Jin et al\\.",
      "year" : 2018
    }, {
      "title" : "Adam: A method for stochastic optimization",
      "author" : [ "Diederik P. Kingma", "Jimmy Ba." ],
      "venue" : "3rd International Conference for Learning Representations.",
      "citeRegEx" : "Kingma and Ba.,? 2015",
      "shortCiteRegEx" : "Kingma and Ba.",
      "year" : 2015
    }, {
      "title" : "Automatic essay grading using text categorization techniques",
      "author" : [ "Leah S. Larkey." ],
      "venue" : "SIGIR ’98 Proceedings of the 21st annual international ACM SIGIR conference on Research and development in information retrieva, pages 90–95.",
      "citeRegEx" : "Larkey.,? 1998",
      "shortCiteRegEx" : "Larkey.",
      "year" : 1998
    }, {
      "title" : "R-drop: Regularized dropout for neural networks",
      "author" : [ "Xiaobo Liang", "Lijun Wu", "Juntao Li", "Yue Wang", "Qi Meng", "Tao Qin", "Wei Chen", "Min Zhang", "TieYan Liu." ],
      "venue" : "NeurIPS.",
      "citeRegEx" : "Liang et al\\.,? 2021",
      "shortCiteRegEx" : "Liang et al\\.",
      "year" : 2021
    }, {
      "title" : "Should you fine-tune bert for automated essay scoring",
      "author" : [ "Elijah Mayfield", "Alan W Black" ],
      "venue" : "In Proceedings of the 15th Workshop on Innovative Use of NLP for Building Educational Applications",
      "citeRegEx" : "Mayfield and Black.,? \\Q2020\\E",
      "shortCiteRegEx" : "Mayfield and Black.",
      "year" : 2020
    }, {
      "title" : "Phenotyping of clinical notes with improved document classification models using contextualized neural language models",
      "author" : [ "Andriy Mulyar", "Elliot Schumacher", "Masoud Rouhizadeh", "Mark Dredze." ],
      "venue" : "33rd Conference on Neural",
      "citeRegEx" : "Mulyar et al\\.,? 2019",
      "shortCiteRegEx" : "Mulyar et al\\.",
      "year" : 2019
    }, {
      "title" : "Flexible domain adaptation for automated essay scoring using correlated linear regression",
      "author" : [ "Peter Phandi", "Kian Ming A. Chai", "Hwee Tou Ng." ],
      "venue" : "Proceedings of the 2015 Conference on Empirical Methods in Natural Language Processing, pages 431–",
      "citeRegEx" : "Phandi et al\\.,? 2015",
      "shortCiteRegEx" : "Phandi et al\\.",
      "year" : 2015
    }, {
      "title" : "Automated cross-prompt scoring of essay traits",
      "author" : [ "Robert Ridley", "Liang He", "Xinyu Dai", "Shujian Huang", "Jiajun Chen." ],
      "venue" : "Proceedings of the AAAI Conference on Artificial Intelligence, pages 13745– 13753.",
      "citeRegEx" : "Ridley et al\\.,? 2021",
      "shortCiteRegEx" : "Ridley et al\\.",
      "year" : 2021
    }, {
      "title" : "Language models and automated essay scoring",
      "author" : [ "Pedro Uria Rodriguez", "Amir Jafari", "Christopher M. Ormerod." ],
      "venue" : "arXiv: Computation and Language.",
      "citeRegEx" : "Rodriguez et al\\.,? 2019",
      "shortCiteRegEx" : "Rodriguez et al\\.",
      "year" : 2019
    }, {
      "title" : "Automated essay scoring using bayes’ theorem",
      "author" : [ "Lawrence M. Rudner", "Tahung Liang." ],
      "venue" : "The Journal of Technology, Learning, and Assessment, 1(2):3–21.",
      "citeRegEx" : "Rudner and Liang.,? 2002",
      "shortCiteRegEx" : "Rudner and Liang.",
      "year" : 2002
    }, {
      "title" : "Multi-stage pre-training for automated chinese essay scoring",
      "author" : [ "Wei Song", "Kai Zhang", "Ruiji Fu", "Lizhen Liu", "Ting Liu", "Miaomiao Cheng." ],
      "venue" : "Proceedings of the 2020 Conference on Empirical Methods in Natural Language Processing (EMNLP), pages 6723–",
      "citeRegEx" : "Song et al\\.,? 2020",
      "shortCiteRegEx" : "Song et al\\.",
      "year" : 2020
    }, {
      "title" : "2016. A neural",
      "author" : [ "Kaveh Taghipour", "Hwee Tou Ng" ],
      "venue" : null,
      "citeRegEx" : "Taghipour and Ng.,? \\Q2016\\E",
      "shortCiteRegEx" : "Taghipour and Ng.",
      "year" : 2016
    }, {
      "title" : "Automatic essay scoring",
      "author" : [ "anjing Huang" ],
      "venue" : null,
      "citeRegEx" : "Huang.,? \\Q2018\\E",
      "shortCiteRegEx" : "Huang.",
      "year" : 2018
    } ],
    "referenceMentions" : [ {
      "referenceID" : 12,
      "context" : "By ensembling traditional and deep neural network approaches, AES can even obtain a better result, which benefits from both representations (Jin et al., 2018; Dasgupta et al., 2018; Uto et al., 2020).",
      "startOffset" : 140,
      "endOffset" : 199
    }, {
      "referenceID" : 7,
      "context" : "By ensembling traditional and deep neural network approaches, AES can even obtain a better result, which benefits from both representations (Jin et al., 2018; Dasgupta et al., 2018; Uto et al., 2020).",
      "startOffset" : 140,
      "endOffset" : 199
    }, {
      "referenceID" : 10,
      "context" : "Black, 2020) fail to show an advantage over other deep learning methods (Dong et al., 2017; Tay et al., 2018) in AES task.",
      "startOffset" : 72,
      "endOffset" : 109
    }, {
      "referenceID" : 16,
      "context" : ", 2020) considers the essay length is long while (Mayfield and Black, 2020) considers the hyper parameter optimization and curriculum learning are complex.",
      "startOffset" : 49,
      "endOffset" : 75
    }, {
      "referenceID" : 20,
      "context" : "(Rodriguez et al., 2019) suggests that the AES has reached its ceiling in terms of modeling.",
      "startOffset" : 0,
      "endOffset" : 24
    }, {
      "referenceID" : 20,
      "context" : "Some researchers (Uto et al., 2020; Rodriguez et al., 2019; Mayfield and Black, 2020) attempt to use BERT (Devlin et al.",
      "startOffset" : 17,
      "endOffset" : 85
    }, {
      "referenceID" : 16,
      "context" : "Some researchers (Uto et al., 2020; Rodriguez et al., 2019; Mayfield and Black, 2020) attempt to use BERT (Devlin et al.",
      "startOffset" : 17,
      "endOffset" : 85
    }, {
      "referenceID" : 8,
      "context" : ", 2019; Mayfield and Black, 2020) attempt to use BERT (Devlin et al., 2019) in their AES systems but fail to achieve competitive results as previous state-of-the-art results of deep neural networks methods.",
      "startOffset" : 54,
      "endOffset" : 75
    }, {
      "referenceID" : 10,
      "context" : "Through the above attempts, our model outperforms the state-of-the-art deep learning models based on LSTM (Dong et al., 2017; Tay et al., 2018).",
      "startOffset" : 106,
      "endOffset" : 143
    }, {
      "referenceID" : 15,
      "context" : "• We introduce two other loss functions which are inspired by the mental process of teacher rating essays, and employ transfer learning from out-domain essays with R-Drop (Liang et al., 2021), which further improves the performance for rating essays.",
      "startOffset" : 171,
      "endOffset" : 191
    }, {
      "referenceID" : 5,
      "context" : "Quadratic Weighted Kappa (QWK) (Cohen, 1968) metric is commonly used to evaluate AES systems by researchers, which measures the agreement between the scoring results of two raters.",
      "startOffset" : 31,
      "endOffset" : 44
    }, {
      "referenceID" : 8,
      "context" : "Token-scale and Document-scale Input We apply one pre-trained BERT (Devlin et al., 2019) model for token-scale and document-scale essay representations.",
      "startOffset" : 67,
      "endOffset" : 88
    }, {
      "referenceID" : 8,
      "context" : "A detailed description can be found in the work of BERT (Devlin et al., 2019).",
      "startOffset" : 56,
      "endOffset" : 77
    }, {
      "referenceID" : 8,
      "context" : "Token-scale As the BERT model is pre-trained by Masked Language Modeling (Devlin et al., 2019), the sequence outputs can capture the context information to represent each token.",
      "startOffset" : 73,
      "endOffset" : 94
    }, {
      "referenceID" : 17,
      "context" : "Divide the token sequence into m = ⌈np/ki⌉ segments and each segment is of length ki except for the last segment, which is similar to the work of (Mulyar et al., 2019).",
      "startOffset" : 146,
      "endOffset" : 167
    }, {
      "referenceID" : 10,
      "context" : "The attention pooling operation we use is similar to the work of (Dong et al., 2017), which is defined as follows:",
      "startOffset" : 65,
      "endOffset" : 84
    }, {
      "referenceID" : 18,
      "context" : "Results of EASE with the settings of Support Vector Regression (SVR) and Bayesian Linear Ridge Regression (BLRR) are reported in (Phandi et al., 2015).",
      "startOffset" : 129,
      "endOffset" : 150
    }, {
      "referenceID" : 23,
      "context" : "CNN+RNN Various deep neural networks based on CNN and RNN for AES are studied by (Taghipour and Ng, 2016).",
      "startOffset" : 81,
      "endOffset" : 105
    }, {
      "referenceID" : 10,
      "context" : "Hierarchical LSTM-CNN-Attention (Dong et al., 2017) builds a hierarchical sentencedocument model, which uses CNN to encode sentences and LSTM to encode texts.",
      "startOffset" : 32,
      "endOffset" : 51
    }, {
      "referenceID" : 3,
      "context" : "BERT+SST+DAT and HA-LSTM+SST+DAT (Cao et al., 2020) proposes to use two selfsupervised tasks and a domain adversarial training technique to optimize their training, which is the first work to use pre-trained language model to outperform LSTM based methods.",
      "startOffset" : 33,
      "endOffset" : 51
    }, {
      "referenceID" : 2,
      "context" : "Longformer (Beltagy et al., 2020) is an extension for transformers with an attention mechanism that scales linearly with sequence length, making it easy to process long documents.",
      "startOffset" : 11,
      "endOffset" : 33
    }, {
      "referenceID" : 22,
      "context" : "To transfer learn from the out-domain essays 5, we additionally employ a pre-training stage, which is similar to the work of (Song et al., 2020).",
      "startOffset" : 125,
      "endOffset" : 144
    }, {
      "referenceID" : 15,
      "context" : "Tran-BERT-MS-MLR incorporates R-Drop strategy (Liang et al., 2021) in training based on Tran-BERT-MS-ML model.",
      "startOffset" : 46,
      "endOffset" : 66
    }, {
      "referenceID" : 13,
      "context" : "We use Adam optimizer (Kingma and Ba, 2015) to fine-tune model parameters in an end-to-end fashion with learning rate of 6e-5, β1=0.",
      "startOffset" : 22,
      "endOffset" : 43
    }, {
      "referenceID" : 3,
      "context" : "Following (Cao et al., 2020), we perform the significance test for",
      "startOffset" : 10,
      "endOffset" : 28
    }, {
      "referenceID" : 10,
      "context" : "761 4 Hierarchical LSTM-CNN-Attention (Dong et al., 2017) 0.",
      "startOffset" : 38,
      "endOffset" : 57
    } ],
    "year" : 0,
    "abstractText" : "In recent years, the pre-trained model has become dominant in most natural language processing (NLP) tasks. However, most researchers in the area of Automated Essay Scoring (AES) have not been able to properly use the pre-trained model such as BERT to outperform other deep learning models such as LSTM. In this paper, we introduce a novel multi-scale essay representation for BERT to jointly learn. To further improve the performance of our model, we also employ multiple losses and transfer learning from out-domain essays. Experiment results show that our approach derives much benefit from joint learning of multi-scale essay representation and obtains the state-ofthe-art results in the ASAP1 task. Multi-scale essay representation also generalizes well to CommonLit Readability Prize (CRP2) data set, which indicates that our novel text representation is a new choice for long text tasks when equipped with BERT.",
    "creator" : null
  }
}