{
  "name" : "ARR_2022_144_paper.pdf",
  "metadata" : {
    "source" : "CRF",
    "title" : "The Moral Debater: A Study on the Computational Generation of Morally Framed Arguments",
    "authors" : [ ],
    "emails" : [ ],
    "sections" : [ {
      "heading" : "1 Introduction",
      "text" : "In the last years, more research has been dedicated to studying prior beliefs in argumentation. Understanding the role of prior beliefs helps people craft more effective arguments when targeting a particular audience. Accordingly, operationalizing knowledge about the audience as part of supporting tools for humans or realized in fully automated debating technologies (Slonim et al., 2021) could benefit the production of arguments that bridge the gap between disputed parties by focusing on the shared beliefs rather than divisive ones.\nIn social psychology, a body of research employs the notion of morals to understand people’s judgments on controversial topics (Haidt, 2012; Fulgoni et al., 2016). Feinberg and Willer (2015) demonstrated that arguments become more effective when they match the morals of the target audience. Multiple works in computational linguistics have analyzed the persuasive effectiveness of arguments depending on the target audience (Durmus and Cardie, 2018; El Baff et al., 2020), showing\nthat audience-based features reliably predict effectiveness. Different proxies of beliefs have been proposed as part of this, ranging from interests and personality traits (Al Khatib et al., 2020) to stances on popular issues (Alshomary et al., 2021a). The authors of the latter used the stances to control the generation of argumentative texts. However, they did not assess the effectiveness of these texts on the audience, leaving the importance of encoding beliefs ultimately unclear. Beyond that, little research has been done on generating arguments tailored towards a specific audience, let alone on the importance of morals in achieving agreement.\nThis work studies the feasibility of generating morally framed arguments computationally as well as the effect of these arguments on different audiences. For this, we rely on the moral foundation theory (Haidt, 2012) that projects the moral system into five foundations: care, fairness, loyalty, authority, and purity. To produce arguments that address specific morals, we extend the capabilities of Project Debater (Slonim et al., 2021).1 Project Debater includes a hybrid approach of multiple components designed to generate arguments of high quality that compete with human arguments. Building on this technology helps us focus on evaluating the impact of morally framed arguments, as it ensures a certain base quality level in the generation.\nIn particular, our proposed extended system takes as input a controversial topic, a stance, and a set of morals. It retrieves a set of argumentative texts, filters the ones conveying the input morals, and finally phrases an argument holding the given stance on the given topic focusing on the given morals. To identify morals in texts, we rely on distant supervision: We use the Reddit dataset of Schiller et al. (2020), which contains argumentative texts with annotated aspects, along with the moral-to-concept lexicon of Hulpus et al. (2020)\n1Available via an API under: https://early-access-program. debater.res.ibm.com/\nfor the automatic mapping from aspects to morals. Then, we train a BERT-based classifier, achieving high performance on the moral dataset of Kobbe et al. (2020) compared to ablation baselines.\nTo assess the effect of morally framed arguments on a particular audience, we consider liberals and conservatives as alternative target audiences. We study the question as to whether morally loaded arguments are more effective on a specific audience. Additionally, we investigate whether differentlyframed moral arguments (targeting different moral foundations) vary in their effect on liberals and conservatives. In line with El Baff et al. (2018), we design an in-depth user study to answer both questions. Our study separately asks three liberals and three conservatives to rank different arguments on specific controversial issues based on how effective the arguments were in challenging or empowering the audience’s stance.\nThe results suggest that, when arguments challenge the stance, the morally framed ones are generally more effective, especially for the conservative audience. We find that liberals value arguments that focus on their own morals care and fairness the most, especially when their stance is challenged. Although conservatives also value respective arguments, a focus on typically conservative morals (loyalty, authority, and purity) becomes more relevant to them when their stance is challenged. Despite the limited size of our user study, these findings hint at the importance of utilizing morals to craft more effective arguments. The code, the trained model, and the data will be publicly available.2 The contributions of this work can be summarized as follows:\n• A state-of-the-art model for mining statements with defined morals from argumentative texts.\n• A system, based on Project Debater, for generating morally-framed arguments.\n• A user-study giving empirical evidence for the impact of morally-framed arguments on audiences of different political ideologies."
    }, {
      "heading" : "2 Related Work",
      "text" : "Prior Beliefs in Argumentation Studying persuasiveness in argumentation is an active field of research. Besides planning argument content,\n2Reviewers can find all in the supplementary material.\nstructure, and style (Wachsmuth et al., 2018), researchers also considered audience-based features to model persuasiveness. Among these, both Durmus and Cardie (2018) and El Baff et al. (2020) study how user factors such as religion and political background affect persuasiveness, whereas Al Khatib et al. (2020) demonstrated thats userbased features reflecting beliefs, characteristics, and personality can increase the predictability of argument persuasiveness.\nThe moral foundation theory offers another conceptual model of understanding human judgments in daily life (Haidt and Joseph, 2004). According to the theory, humans subconsciously adhere to five basic moral foundations when judging controversial issues: fairness (importance of justice, rights, and equality), care (being kind, and avoiding harm), loyalty (self-sacrifice, solidarity, belongingness), authority (respect to traditions and hierarchy), and purity (sacredness of religion and human). Based on the theory, the disagreement between liberals and conservatives can be explained by the moral gap between the two parties, for example. While liberals rely mainly on care and fairness (so called individualizing morals) in their assessment of controversial issues, conservatives consider all moral foundations more evenly, somewhat skewed towards the binding morals though, that is, loyalty, authority, and purity (Graham et al., 2009).\nSeveral studies provided evidence of the robustness of the moral foundation theory in understanding people’s behaviors and decisions (Feinberg and Willer, 2015; Fulgoni et al., 2016; Johnson and Goldwasser, 2018). For computational purposes, Kobbe et al. (2020) annotated moral foundations in arguments and analyzed the correlation between morals and argument quality. We user their corpus in our experiments to evaluate our moral classifier.\nArgument Generation Argument generation approaches have been proposed for a spectrum of different tasks. Hua et al. (2019) and Alshomary et al. (2021b) worked on counter-argument generation, tackling the task by rebutting an argument’s conclusion or by undermining one of its weak premises respectively. Others opposed a given claim (Bilu et al., 2015; Hidey and McKeown, 2019), generated argumentative claims on a given topic controlled for certain aspects (Schiller et al., 2020), or reconstructed implicit conclusions (Alshomary et al., 2020; Syed et al., 2021). However, none of these approaches considered generating augmenta-\ntive texts that target a specific audience. Recently, Alshomary et al. (2021a) introduced the task of belief-based claim generation, aiming to generate claims on a given topic that match a given target audience. As a model of beliefs, they considered people’s stances on big issues. While they demonstrated the feasibility of encoding beliefs into claims, they did not study the effectiveness of these claims on an audience. Another driver in the field of argument generation is Project Debater by Slonim et al. (2021). Project Debater is an endto-end system for argument mining, retrieval, and generation. For generation, it relies on a hybrid approach consisting of retrieval, mining, clustering, and rephrasing components. In their manual evaluation, Slonim et al. (2021) observe a competent quality of generated arguments compared to those crafted by humans. To generate morally framed arguments, we extend their system. Relying on Project Debater helps us alleviate confounding effects of argument quality and, so, to focus on testing whether moral utilization affects the audience."
    }, {
      "heading" : "3 Moral Foundation Classification",
      "text" : "Our proposed system relies on the ability to identify morals in arguments automatically. Existing approaches to mining morals from texts are either lexicon-based or machine learning-based. Several datasets have been constructed for domains such as social media or news articles. For argumentative texts, Kobbe et al. (2020) manually annotated a small dataset of 220 arguments, which is only suitable for evaluation. We therefore decided to develop a moral foundation classifier based on data collected automatically using distant supervision, as explained in the following."
    }, {
      "heading" : "3.1 Data Collection",
      "text" : "To circumvent the need for annotated data, we construct a training dataset following a distantsupervision approach. In particular, moral founda-\ntions are revealed as aspects of concerns in discussions of controversial topics. For example, when discussing School Uniform from the authority perspective, aspects such as respect and obedience often arise. Given this observation, we referred to the dataset of Schiller et al. (2020) which contains short argumentative texts on eight topics along with automatically-annotated aspects for each text. We then assigned each argumentative text a set of moral foundations based on the aspects appearing in the text. To map aspects to moral foundations, we employed the lexicon of Hulpus et al. (2020) which connects moral foundations to Wikipedia concepts. After filtering out arguments without any mapping and balancing the data across the five moral foundations, this resulted in a dataset with 230k argumentative texts and the corresponding morals. We split the dataset into six topics for training and two for validation (testing will happen on other data below). Details on the distribution of the morals across topics are found in Table 1.\nTo assess the quality of the distantly supervised dataset, two authors of the paper manually evaluated the correctness of the assigned morals on a sample of 100 examples. 77% of the cases were considered correct by at least one author, 44% by both. The Cohen’s κ agreement was 0.32, which is not high, but in line with other subjective argumentrelated annotations (El Baff et al., 2018). Table 2 shows example sentences with assigned morals from the dataset."
    }, {
      "heading" : "3.2 Model and Evaluation",
      "text" : "We rely on a BERT-based classifier to identify morals in texts (Devlin et al., 2019), starting from the pre-trained bert-based-cased model. We finetuned the model on our training set for three epochs with batch size of 16 and a learning rate of 3−e5. In the training phase, the input was an argumentative sentence and the corresponding moral foundation. Since an argument may contain multiple sentences, each reflecting a specific moral, an argument’s fi-"
    }, {
      "heading" : "Argumentative Sentence Moral",
      "text" : "Abortion isn’t murder because abortion is legal and murder is an illegal killing of another person. Care\nThe simple fact, is if your wages are not fair, you have the right to unionize and get better wages. Fairness\nThis intertribal coalition also pushed for a new standard for national monuments and tribal involvement. Loyalty\nGun laws are only obeyed by law abiding people. Authority\nPeople that ignore the social contract and human decency aren’t deterred by any punishment. Purity"
    }, {
      "heading" : "Approach Care Fairn. Loyalty Auth. Purity Macro",
      "text" : "nal set of morals consists of all sentences’ morals predicted with confidence above 0.5. To assess the classifier’s effectiveness more reliably, we trained six models on different random samples of size 50k and computed their average F1-score.\nFor comparison, we consider two baselines. The first is the model performing best in the experiments of Kobbe et al. (2020), which is a multi-label BERT-based model trained on the Twitter moral corpus of Hoover et al. (2020). We trained our own version on the same dataset and refer to it as mBERT. The second baseline is a simple lexiconbased approach that computes the frequency of words belonging to each of the moral foundations (Araque et al., 2020), called Lexicon below. As a lexion, we used the moralstrength library.3.\nWe tested all models on the dataset of Kobbe et al. (2020), which consists of 220 arguments annotated for moral foundations by two annotators. Table 3 shows the F1-score of all evaluated models for each moral as well as the macro F1-score. Our approach outperforms both baselines across all moral foundations except for care. Having considerable higher effectiveness on average signals the advantage of using the proposed dataset. Hence, we use this model in our system for morally framed argument generation.\n3Link: https://github.com/oaraque/moral-foundations"
    }, {
      "heading" : "Component",
      "text" : ""
    }, {
      "heading" : "Moral Tagging and Filtering",
      "text" : ""
    }, {
      "heading" : "4 The Moral Debater System",
      "text" : "This section describes the system that we develop to study the effect of morally framed arguments on the audience. Our design extends the capabilities available via the Project Debater API with the moral foundation classifier from Section 3. As input, it takes a controversial topic (say, “globalization”), a stance on the topic (say, pro), and a set of morals to be targeted (say, loyalty, authority, and purity). Then, it determines a collection of claims and evidence on the given topic that focus on the given morals, from which it constructs an argument with the given stance. Figure 1 shows the high-level process of the proposed system. In the following, we describe the three-step process in detail, highlighting our proposed integration.\nQuery Generation + Sentence Retrieval First, the system retrieves a collection of argumentative sentences discussing the controversial topic from Project Debater’s index, which contains 400 million news articles. The articles are split into sentences and indexed along with several metaannotations. We generate several queries containing only the topic keywords without any topic expansion to focus on relevant sentences. We restrict the retrieved sentences to only those annotated as having sentiment or causality markers. Section 5 gives more details on the constructed queries.\nMoral Tagging and Filtering + Component Extraction Second, the system applies the trained classifier to annotate each argumentative sentence for all likely moral foundations. It then filters out those sentences that either do not have any moral or contain at least one moral not given as input. Next, through Project Debater’s API, the system generates for each of the remaining sentences a likelihood score reflecting whether it contains a claim or evidence following the approach of EinDor et al. (2020). We instruct the API to keep only sentences having a claim with likelihood higher than claim_threshold or evidence with likelihood higher than evidence_threshold (the exact thresholds are given in Section 5). Additionally, for sentences containing claims, the API identifies claim-boundaries and extracts the exact span of text containing the claim."
    }, {
      "heading" : "Input Aggregation + Narrative Generation",
      "text" : "Third, our proposed extension aggregates the given list of claims and evidence sentences with the input topic and stance. It then uses Project Debater’s narrative generation API to generate the final argument. The narrative generation identifies the stance of claims and evidence towards the topic according to the approach of Bar-Haim et al. (2017). Only those matching the input stance are kept. Redundant elements are then filtered out, and the remaining ones are grouped into thematic clusters, where a theme is a Wikipedia title (Slonim et al., 2005). The process of building these clusters also includes extracting one claim that represents the theme. Each theme will then be represented by a paragraph in the output argument. Finally, a set of algorithms is used to perform various kinds of re-phrasing on the argument level (e.g., pronoun resolution) and on the paragraph level (e.g., ensuring that different arguments are put together) (Slonim et al., 2021).\nExample arguments with and without controlled morals are shown in Table 4. By concept, each argument starts with an introductory paragraph listing the main themes of discussion, followed by a set of paragraphs, each combining claims and evidence on one theme."
    }, {
      "heading" : "5 Studying the Effect of Moral Framing",
      "text" : "To evaluate our hypothesis on the effect of morally framed arguments, we carried out a user study with two opposing target audiences, liberals and conservatives. Our primary goal was to investigate whether morally framed arguments are more ef-\nfective than uncontrolled ones. Additionally, we sought to find out whether differently-framed arguments affect liberals and conservatives differently."
    }, {
      "heading" : "5.1 Experimental Setup",
      "text" : "Arguments We considered ten popular topics from the website debate.org, called big issues there. For each topic, we used our system to construct three arguments: one argument focusing on care\nand fairness (individualizing), one focusing on loyalty, authority, and purity (binding), and one baseline argument where we did not control the morals targeted (uncontrolled). We created arguments separately for both stances (pro and con), resulting in a total of 10 · 3 · 2 = 60 arguments.\nTo construct each argument, we used the following parameters. For each topic, we built four queries, retrieving 10k sentences with 6 to 60 tokens per query. The first query retrieved sentences containing the topic. The second and third query targeted claim-like sentences, requiring the occurrence of (a) at least one causality marker or (b) both a causality and a sentiment marker. Each needed to appear together with the topic in a window of 12 tokens. The last query aimed to retrieve evidence by filtering only those sentences that contained any of the following tokens: “surveys”, “analyses”, “researches”, “reports”, “research”, and “survey”. A moral was assigned to a retrieved sentence if the probability of our classifier was higher than 0.5. After initial tests, we set the claim_threshold and evidence_threshold to 0.8 and 0.6 respectively. We left all other settings to the default values of Project Debater’s API.\nInternal Study on Argument Quality Before we launched our main study, two authors of this paper manually assessed the quality of the generated arguments and the morals addressed in each. In particular, each of them read all 60 arguments and ranked their relevance, coherence, and argumentativeness on a 5-point Likert scale. While reading each argument, they also highlighted spans of text that they found to reflect a specific moral."
    }, {
      "heading" : "External Study on Argument Effectiveness To",
      "text" : "answer our research questions, we conducted a twophase user study on the platform Upwork: First, we determined the political ideology of each participant, and then, we let selected participants rank the different arguments.\nIn the first phase, we asked people living in the US that are experienced in writing and content editing to perform the Political Typology Quiz, available through the Pew Research Center, in order to identify their political ideology.4 In 17 questions, the quiz asks participants to state their views on controversial issues in the US. The test results place the participants on a spectrum of ideologies from\n4Political Typology Quiz: https://www.pewresearch.org/ politics/quiz/political-typology/"
    }, {
      "heading" : "Type Argumentativeness Relevance Coherence",
      "text" : ""
    }, {
      "heading" : "Type Care Fairness Loyalty Authority Purity",
      "text" : "solid liberal (left) to core conservative (right). In the second phase, we chose only six participants from the first phase due to budget constraints, three solid liberals (one male, two female) and three core conservatives (two males, one female). We showed each of them three arguments (one individualizing, one binding, one uncontrolled) for all 20 topic-stance pairs. For each pair, the participants read the three arguments and ranked them by perceived effectiveness. We followed El Baff et al. (2018), defining the effectiveness of an argument either by how empowering it is (if the participant has the same stance on the topic) or by how challenging it is (otherwise). For this purpose, the participants self-assessed their stances on each topic on a 5- point Likert scale, from 1 (strongly disagree) to 5 (strongly support) before reading the arguments. Given an estimated workload of 3 to 3.5 hours, we paid each participant a fixed rate of $75 and rewarded the responsive ones with a $5 bonus."
    }, {
      "heading" : "5.2 Results",
      "text" : "In the following, we present the results of both studies, attempting to answer our research questions.\nArgument Quality Table 5 presents the quality scores for each argument type and Table 6 the distribution of moral foundations. Comparing the scores of binding and individualizing arguments to the uncontrolled ones, we see that our method did not notably worsen the quality of the generated arguments. The moral foundation distribution indicates that binding arguments have a relatively higher focus on loyalty, authority, and purity than the individualizing arguments and a lower focus on fairness and care. This supports the impact of our method on controlling morals in argument generation."
    }, {
      "heading" : "Ideology Morals Rank 1 Rank 2 Rank 3 Mean",
      "text" : "Empowering vs. Challenging Figure 2 shows the distribution of challenging and empowering arguments. Liberals were more decisive with their stance on the given topics, with 73% being on the pro side, whereas only 30% of the conservatives were on that side (50% con side, 20% no stance). Since we present arguments for both sides for each topic, we had an equal distribution of empowering and challenging arguments for the liberals. However, for conservatives, we had 40% empowering and 40% challenging arguments due to the 20% undecided cases. Since arguments supporting one side of a debate are rather challenging for the undecided audience, in our analysis below, we consider the 20% undecided cases to be challenging.\nEffectiveness of Moral Arguments Table 7 shows the rank distribution for morally-framed arguments (binding and individualizing) compared to the uncontrolled ones for liberals, conservatives, and all together. In general, the participants ranked the arguments framed in terms of fairness and care (individualizing) better than the uncontrolled ones, with an average rank of 1.72 compared to 2.08. This signals a positive answer to our first research"
    }, {
      "heading" : "Ideology Moral Empowering Challenging Both",
      "text" : "question: a focus on morals can make arguments more effective. A closer look at the distribution of arguments at Rank 1 shows that conservatives were more susceptible to moral arguments (75% binding and individualizing) compared to liberals (63%).\nNext, we examine whether arguments with different morals affect liberals and conservatives differently by looking at the achieved ranks of both empowering and challenging arguments.\nEffectiveness depending on Ideology Looking at the mean ranks assigned by liberals in Table 8, we observe that challenging arguments which focus on the individualizing morals (care and fairness) are most effective. This is in line with Feinberg and Willer (2015) who found that arguments framed in terms of liberal morals were more convincing to liberals. Notably, this effectiveness slightly decreases when arguments are empowering. A reasonable hypothesis is that, in case of empowering arguments, the audience may be more interested in the opposing views which might be covered by the uncontrolled arguments. We investigate this hypothesis further via a follow-up questionnaire below.\nBefore, we look at the conservatives. Although they also valued the individual arguments the most, we observe that, when arguments challenged their views, a focus on binding morals (loyalty, authority, and purity) became more effective than the uncontrolled arguments. Generally, morally framed arguments that challenged the views of conservatives were more effective than uncontrolled ones.\nAgreement across Ideologies We measured inter-annotator agreement between the participants using Kendall’sW (Kendall and Smith, 1939). The agreement of all six participants was 0.29. In con-\ntrast, when considering liberals and conservatives separately, it increased to 0.35 for liberals and 0.51 for conservatives. This indicates higher agreement between participants having similar political ideology and matches the common notion that conservatives are more unified in their views than liberals."
    }, {
      "heading" : "Reasons behind Effectiveness Judgments In a",
      "text" : "follow-up questionnaire, we investigated our participants’ judgments. We asked them to self-assess whether they prefer (1) arguments with knowledge they have or they are not familiar with, (2) arguments that matched or challenged their own views, and (3) argument that share or oppose others’ views, each in empowering and in challenging cases. In addition, we asked what affected their judgments of argument effectiveness more: knowledge or views.\nTable 9 shows that the participants ranked knowledge as the most relevant aspect for effectiveness. In terms of others’ views, the majority valued arguments that focuses on the opposing views, whereas preferences differ for empowering and challenging arguments on own views. Due to the reliability issues of self-assessment of one’s moral judgments (Pizarro, 2000), we acknowledge the limitation of this study, though. We present details on the questionnaire and its results in the appendix."
    }, {
      "heading" : "6 Discussion and Limitations",
      "text" : "The results of our evaluation indicate that arguments targeting the moral foundations of care and fairness are more effective than others. Also, we observed that focusing on the audience’s views in challenging arguments makes them more effective. Regarding political ideologies, while our results\nmatch the literature in that liberals were affected more by arguments focusing on their views (care and fairness), especially when challenged, conservatives did not rank binding arguments higher than individualizing ones. However, the conservatives still showed a higher tendency to be affected by morally framed arguments than liberals.\nOur approach is limited by its capablitity to retrieve argumentative texts that discuss the topic from different moral perspectives. In the retrieval component, we have so far focused on obtaining sentences containing precisely the addressed topic. A more elaborated approach could broaden the search to relevant topics through topic expansion. Further, we could use Project Debater only through the predefined API, restricting the way we integrate the moral tagging of sentences. Ideally, it would be performed during indexing; then, the choice of morals to focus on could be defined as part of the queries. Also, it is noteworthy that our moral classifier is trained on an automatically annotated dataset which may have limited its performance.\nStill, we demonstrated that it is feasible to tune arguments automatically to target certain morals and that such arguments tend to be more effective. Moreover, our results indicate that differently framed arguments have a different effect on different audiences. This opens opportunities for generating more effective arguments when targeting a specific audience, bridging the gap between disagreeing parties by focusing on the shared beliefs."
    }, {
      "heading" : "7 Conclusion",
      "text" : "In this work, we have proposed an extension of Project Debater that generates morally framed arguments. Due to the lack of training data for classifying morals, we have used distant supervision to collect a large set of argumentative sentences automatically annotated for moral foundations. Training a BERT-based classifier on the data yielded stateof-the-art results. We have integrated the classifier with functionalities of Project Debater to tune arguments tuned towards specific morals. According to our user study, arguments with morals relevant to liberals are more effective than arguments without any control of morals. Also, conservatives were more affected by moral arguments. Our results demonstrate the feasibility of generating morally framed arguments. By focusing on shared morals, we believe that a respective system helps bridge disagreement of opposing audiences in practice."
    }, {
      "heading" : "8 Ethical Statement",
      "text" : "Working on technologies that aim to persuade an audience raises ethical concerns. Using knowledge about a user’s morals is a critical act, and if done, it should be clearly communicated to the users. Similarly, generating arguments aiming to convince the audience could be thought of as a manipulation attempt. To avoid manipulation, any technology aiming at convincing the audience should be transparent about it by keeping the user informed of how their information is being used. Since we rely on the arguments provided by the Project Debater API, we ultimately cannot control their content, but our internal quality assessment study did not raise any notable concerns on the information contained.\nIn our external study, we did not gather any personal information about the participants that could connect their ideologies to their identity. Also, we ensured that they get paid more than the minimum wage in the U.S., as specified in the paper."
    }, {
      "heading" : "A The follow-up questionnaire",
      "text" : "This section details the follow-up questionnaire we carried to investigate users’ judgments of effectiveness in both challenging and empowering arguments. In the questionnaire, we asked our six annotators the following four questions regarding the challenging arguments:\n• Your views: When arguments contested your stance on the topic, which of the following arguments did you see as more effective:\n1. Arguments that matched your views 2. Arguments that challenged your views 3. Neither of those was important\n• Your knowledge: When arguments contested your stance on the topic, which of the following arguments did you see as more effective:\n1. Arguments based on views you already knew about\n2. Arguments that introduce views you were not familiar with\n3. Neither of those was important\n• Others’ views: When arguments contested your stance on the topic, which of the following arguments did you see as more effective:\n1. Arguments you saw as particularly convincing to people that share your views\n2. Arguments you saw as particularly convincing to people that rather oppose your views\n3. Neither of those was important\n• Effectiveness: When arguments contested your stance on the topic, which of the above three was most important for you to judge about effectiveness:\n1. Your views\n2. Your knowledge 3. Others’ views\nSimilarly, we ask the same questions in the case of empowering arguments. Table 9 summarizes the results of the four asked questions in both empowering and challenging arguments. In general, among the three aspects, the knowledge aspect was the most relevant one to the majority of the annotators (last row). When the annotators were asked about the their own views (first row), conservatives favored mostly arguments that challenged their own views, while liberals favored mostly empowering arguments that matched their views. Regarding others’ views, most conservatives and liberals valued empowering arguments that were particularly convincing to people that oppose their views. Nevertheless, we acknowledge the limited reliability of such self-assessment of one’s moral judgments due to the complicated cognitive mechanisms behind it (Pizarro, 2000)."
    }, {
      "heading" : "B Example Generated Arguments",
      "text" : "We present in Table 7-9 a sample of generated arguments on three topics focusing on both individualizing and binding morals, as well as uncontrolled."
    }, {
      "heading" : "Topic: Globalization",
      "text" : "Binding argument: The crowd raised four issues, explaining its views. The first claim is that globalization is reducing the importance of nation-states. The next issue will show how Globalization and structural forces aggravate poverty. In addition, we will hear about pollution and Culture. Starting with nation states. Globalization is reducing the importance of nation-states. It has fueled the rise of transnational corporations, and their power has vaulted to the point where they can now rival many nation states. This trend may threaten national identity because globalization undermines the importance of being a citizen of a particular country. According to Ramonet, globalization and ultra-liberalism threaten the sovereignty of national states. Some scholars have argued that increasing globalization has actually led to a contemporary form of imperialism, in which economic and cultural norms and discourses are imposed by dominant nations on weaker nations. Turning to poverty. Critics of globalization say that it disadvantages poorer countries. Globalization and structural forces aggravate poverty and continue to push individuals to the margins of society. Academic contributors to The Routledge Handbook of Poverty in the United States postulate that new and extreme forms of poverty have emerged in the U.S. as a result of neoliberal structural adjustment policies and globalization, which have rendered economically marginalized communities as destitute \"surplus populations\" in need of control and punishment. Pollution was also mentioned. Globalization creates risks that concern people from all different classes; for example, radioactivity, pollution, and even unemployment. As International commerce develops new trade routes, markets and products it facilitates the spread of invasive species. Lastly, Culture. Globalization has destabilized previously immutable social institutions, shifting cultural value away from old traditions to new more individualistic and market friendly ideas. It is often said to have a negative effect on the world’s cultural diversity. Cultural and geographical dimensions of transformational leadership become blurred as globalization renders ethnically specific collectivist and individualistic effects of organizational behavior obsolete in a more diversified workplace.\nIndividualizing argument: The crowd raised four issues, explaining its views. The first claim is that Globalization on its own cannot end gender inequality. In addition, we will hear about harm, economy and processes. Starting with gender inequality. There are various studies available that depict globalization as a hindrance toward gender inequality. Globalization on its own cannot end gender inequality. Turning to harm. Some critics of globalization argue that it harms the diversity of cultures. Globalization is a threat to culture and religion, and it harms indigenous people groups while multinational corporations profit from it. It has been criticized for benefiting those who are already large and in power at the risk and growing vulnerability of the countries’ indigenous population. As of recently, it has been argued that globalization poses a threat to the CHS way of thinking because it often leads to the dissolution of distinct states. Economy was also mentioned. According to many left-wing greens, economic globalization is considered a threat to wellbeing, which will replace natural environments and local cultures with a single trade economy, termed the global economic monoculture. Globalisation is the cause of slow growth, unemployment and excessive debt in Western economies. It makes people poor by taking away money from people who formerly had it. Globalization does not work for all the economies that it affects, and that it does not always deliver the economic growth that is expected of it. It is pretty much making all poor countries richer with the exception of various african countries because of their continious state of war between the local tribes. Lastly, processes. Processes of globalization present humankind with many issues that are considered problematic in at least one culture or society, and often multiple societies. The books suggest that contemporary processes of globalization and mediatization have contributed to materially abstracting relations between people, with major consequences for how we live our lives. On the other side, the process of globalization has generated universal disenchantment.\nUncontrolled argument: The crowd raised four issues, explaining its views. The first claim is that globalisation creates economic and cultural imbalances in developing nations. The next issue will show how globalization is reducing the importance of nation-states. And the third point is that globalization is a threat. In addition, we will hear about processes. Starting with economy. Globalization does not work for all the economies that it affects, and that it does not always deliver the economic growth that is expected of it. Globalisation and neoliberalism have exacerbated already unequal economic relations. Although globalization takes similar steps in most countries, scholars such as Hodge claim that it might not be effective to certain countries and that globalization has actually moved some countries backward instead of developing them. Turning to nation states. Globalization is reducing the importance of nation-states. It engenders conflicts within and between nations over domestic norms and social institutions. This trend may threaten national identity because globalization undermines the importance of being a citizen of a particular country. According to Ramonet, globalization and ultra-liberalism threaten the sovereignty of national states. Threats was also mentioned. Case studies of Thailand and the Arab nations’ view of globalization show that globalization is a threat to culture and religion, and it harms indigenous people groups while multinational corporations profit from it. As of recently, it has been argued that globalization poses a threat to the CHS way of thinking because it often leads to the dissolution of distinct states. Lastly, processes. The combined processes of industrialization and globalization have disrupted longstanding livelihoods and systems of production, forcing many families to focus more on income-generating activities than on subsistence practices. Academic contributors to The Routledge Handbook of Poverty in the United States postulate that new and extreme forms of poverty have emerged in the U.S. as a result of neoliberal structural adjustment policies and globalization, which have rendered economically marginalized communities as destitute \"surplus populations\" in need of control and punishment.\nTable 11: Example generated arguments against Globalization for different focused morals."
    }, {
      "heading" : "Topic: Affirmative Actions",
      "text" : "Binding argument: Law, students, policy and women are the four issues the crowd elaborated on. Let’s explore the issue of law. The court found that the University of Michigan’s Law School’s affirmative action admission policies were promoting diversity within its school. Liberals have also argued for affirmative action to increase the representation of women and minorities among law students and law faculty. Following the enactment of Civil Rights laws in the 1960s, all educational institutions in the United States that receive federal funding have undertaken affirmative action to increase their racial diversity. The next issue is students. Another controversial decision of the Rehnquist court in 2003 was Grutter v. Bollinger which upheld affirmative action. It was in essence an affirmative action scheme to assist geographically disadvantaged students to gain tertiary education. The obvious solution to all the Affirmative Action controversy is to offer full financial assistance to all university students with need, regardless of race. Moving on to policy. This executive order created a National Women’s Business Enterprise Policy and required government agencies to take affirmative action in support of women’s business enterprises. Following the riots, the Malaysian Government introduced affirmative action policies to help the Bumiputera to achieve a higher economic quality of life than the Chinese. Ethiopian government policy has supported affirmative action for women since its inception in 1994. The ACLU’s official position statements, as of January 2012, included the following policies: Affirmative action - The ACLU supports affirmative action. The last issue mentioned was women. Hunter is a supporter of affirmative action for women. He is highly in favor of affirmative action and supports setting aside funds for women and minorities. According to a poll taken by USA Today in 2005, the majority of Americans support affirmative action for women, while views on minority groups were more split. It support affirmative action for women. Affirmative Action and Impact Sourcing Tata BSS is an avid supporter of Affirmative Action and hence employs huge number of SC/ST community people in their operations thereby making a huge impact on the society.\nIndividualizing argument: Employment, discrimination, universities and policy are the four issues the crowd elaborated on. Let’s explore the issue of employment. Affirmative action legislation has led to substantial improvements in the employment of minorities and women. They also require Federal contractors and subcontractors to take affirmative action to ensure equal employment opportunity in their employment processes. Historically and internationally, support for affirmative action has sought to achieve goals such as bridging inequalities in employment and pay, increasing access to education, promoting diversity, and redressing apparent past wrongs, harms, or hindrance. The next issue is discrimination. The affirmative action program is designed to remedy the effects of past discrimination. In 2004, he reiterated his support, \"I support affirmative action programs, including in appropriate instances consideration of race and gender in government contracting decisions, when the affirmative action program is designed to remedy the effects of past discrimination.\". Alongside the prohibition against unfair discrimination, affirmative action is the second cornerstone of the EEA. A common approach to remedying discrimination is affirmative action. Moving on to universities. The National Conference of State Legislatures held in Washington D.C. stated in a 2014 overview that many supporters for affirmative action argue that policies stemming from affirmative action help to open doors for historically excluded groups in workplace settings and higher education. Race-based affirmative action was necessary to achieve diversity and its educational benefits. Affirmative action provides some disadvantaged youth with increased chances of attending top-tier university. Action is thus more important than abstract knowledge. The last issue mentioned was policy. According to its website, the NCP is committed to ideals of social justice, expressing support for affirmative action policies for the downtrodden members of society and for ensuring equal opportunities for all. Such legislation and affirmative action policies have been critical to bringing changes in societal attitudes. The school applies an affirmative action policy to ensure marginalized students from hardship semi-arid areas are given a chance. Affirmative Action Policy is to ensure the peace and stability in the pluralist society of Malaysia. It was found to address Malay grievances."
    }, {
      "heading" : "Uncontrolled argument:",
      "text" : "Discrimination, effectiveness, the supreme court and women are the four issues the crowd elaborated on. Let’s explore the issue of discrimination. 1961: Executive Order 10925: Required government contractors to \"take affirmative action\" to ensure non-discriminatory employment practices. It supports affirmative action as necessary in the fight for equality and it opposes all forms of racism and religious bigotry. Right to affirmative action All federal employers or federal contractors are required to take affirmative action to help counteract the effects of historical discrimination. CAMERA argues the Law of Return is justified under the Convention on the Elimination of All Forms of Racial Discrimination Article I, which CAMERA argues allows for affirmative action, because of the discrimination Jews faced during the Holocaust. The next issue is effectiveness. In philosophy, Action is effective will. Collective action is the most effective means of preventing potential state and non-state aggressors from threatening other states. Such action is effective in spreading our message. Moving on to the supreme court. Utter v. Bollinger: The Supreme Court of the United States upholds affirmative action in university admissions. The court found that the University of Michigan’s Law School’s affirmative action admission policies were promoting diversity within its school. Importantly, though, it ruled that a university was entitled to \"no deference\" on its judgment that race-based affirmative action was necessary to achieve diversity and its educational benefits. Another controversial decision of the Rehnquist court in 2003 was Grutter v. Bollinger which upheld affirmative action. A prominent advocate of affirmative action, he played a leading role in the twin Supreme Court cases-Grutter v Bollinger and Gratz v Bollinger-that upheld and clarified the importance of diversity as a compelling justification for affirmative action in higher education. The last issue mentioned was women. Affirmative action programs to women in an effort to end gender discrimination. Genderaffirmative practices recognize and support an individual’s unique gender self-identification and expression. Wesolowski supported affirmative action programs for Saskatoon Catholic teachers in 2001, arguing that past policies had discriminated against women and aboriginals. For women business owners, affirmative action programs are considered legislation that encourage government agencies and contractors to do business with women-owned businesses.\nTable 12: Example generated arguments supporting Affirmative Actions for different focused morals."
    }, {
      "heading" : "Topic: Legalizing Prostitution Binding argument:",
      "text" : "These are the four issues the crowd addressed: the netherlands, adulthood, government and drugs. Starting with the netherlands. Prostitution is legal and regulated in the Netherlands. In Switzerland, it has been legal since 1942. As a result of such views on prostitution, countries such as Germany, the Netherlands and New Zealand have fully legalized prostitution. Adulthood was also mentioned. Prostitution of adults is legal in 10 rural counties in Nevada. Prostitution is a consensual sex act between adults and a victimless crime, thus the government should not prohibit this practice. The impugned Criminal Code provisions, by criminalizing many of the activities surrounding prostitution, adversely affect a great number of women. Prostitution was legal, as long as the women paid their license fees. It should not be illegal because the customers are satisfied. Turning to government. Prostitution should be decriminalized, and as a libertarian insists the sex trade should not be regulated by the government. According to data from the Office for National Statistics, it contributed 5.3 billion to the UK economy in 2009. This, the sex work perspective asserts, will allow prostitution to be regulated by governments and business codes, protect sex trade workers, and improve the ability to prosecute people who hurt them. In 2005 the government also drafted the Sex Regulation Act which sought to further legalise and regulate prostitution. According to a Portuguese Government spokesperson, \"The Government’s opinion was that prostitution was not a crime. The last issue mentioned was drugs. Mick Jagger has called for all drugs to be legalised on the Isle of Man. The Act legalised prostitution and put the women involved under police and medical control. In 2012, newly elected Guatemalan president Otto Perez Molina argued that all drugs should be legalized while attending the United Nations. Because of this, the Austrian Federal Ministry of the Interior wants to transform illegal prostitution into legal regulated prostitution.\nIndividualizing argument: These are the four issues the crowd addressed: regulation, gambling, rape and crime. Starting with regulation. According to proponents of regulation, prostitution should be considered a legitimate activity, which must be recognized and regulated, in order to protect the workers’ rights and to prevent abuse. It should be legalised so it could be controlled safety. Maxine is a strong supporter of legalised brothels, more regulations around employment in the sex industry and increased sentences for perpetrators of violent crime. Barbara Brents and Kathryn Hausbeck state in their study that the legalization of prostitution in Nevada’s brothels allows for improved regulation and protection for both businesses and workers. Gambling was also mentioned. D’Amato believed that legalized gambling would be good for both the city and for those with businesses related to the entertainment industry. Maher favors ending corporate welfare and federal funding of non-profits as well as the legalization of gambling, prostitution, and cannabis. Turning to rape. Kimberly Kay Hoang, assistant professor of sociology at the University of Chicago, who conducted a 2011 study of prostitutes in Ho Chi Minh City is quoted as saying \"Legalising prostitution would also reduce violence and sex crimes such as rape and sexual violence. Legalising prostitution would also reduce violence and sex crimes such as rape and sexual violence. In 2006, the National Assembly legalized abortion care in cases of rape, as women regularly faced sexual violence, rape, and gang rape in the war-ravaged country. Legalizing brothels would make prostitution safer for women because it would allow prostitution to take place indoors. The last issue mentioned was crime. Proposition K would decriminalize prostitution, enforce laws against crimes on sex workers, and disclose all investigations and prosecutions of violent crimes against sex workers. A May 1990 Australian Institute of Criminology report recommended that prostitution not be a criminal offence, since the laws were ineffective and endangered sex workers. In 1908, the king passed laws to legalize prostitution and help sex workers get medical care."
    }, {
      "heading" : "Uncontrolled argument:",
      "text" : "These are the four issues the crowd addressed: offices, sex workers, drugs and rural. Starting with offices. Citizens’ Assembly’s Vanadzor Office president, Artur Sakunts, called for prostitution to be legalised and regulated. Prostitution in Hungary has been legalized and regulated by the government since 1999. In several countries, lotteries are legalized by the governments themselves. In response to the 1995 Federal-Provincial-Territorial Working Group on Prostitution report \"Dealing with Prostitution in Canada,\" Toronto’s Board of Health advocated decriminalisation in 1995, with the City taking the responsibility of regulating the industry. Sex workers was also mentioned. The sex workers organisation \"Guyana Sex Worker Coalition\" and several NGOs called for prostitution to be legalised and regularization of sex work. Some sex-positive feminists believe that women and men can have positive experiences as sex workers and that where it is illegal, prostitution should be decriminalized. Since the mid-1970s, sex workers across the world have organised, demanding the decriminalisation of prostitution, equal protection under the law, improved working conditions, the right to pay taxes, travel and receive social benefits such as pensions. The sex work perspective maintains that prostitution is a legitimate form of work for women faced with the option of other bad jobs, therefore women ought to have the right to work in the sex trade free of prosecution or the fear of it. Turning to drugs. If they did, prostitution and drugs would be legal. The Act legalised prostitution and put the women involved under police and medical control. In 2012, newly elected Guatemalan president Otto Perez Molina argued that all drugs should be legalized while attending the United Nations. He has studied the effects of drug criminalization for 15 years, and argues that all drugs should be legalized. The last issue mentioned was rural. Prostitution of adults is legal in 11 rural counties in Nevada. Mayor Goodman supports legalizing prostitution in the city’s downtown area as a revenue generator and tool for revitalization, although a majority of Nevadans polled in 2003 opposed the mayor’s position.\nTable 13: Example generated arguments supporting Legalizing Prostitution for different focused morals."
    } ],
    "references" : [ {
      "title" : "Exploiting personal characteristics of debaters for predicting persuasiveness",
      "author" : [ "Khalid Al Khatib", "Michael Völske", "Shahbaz Syed", "Nikolay Kolyada", "Benno Stein." ],
      "venue" : "Proceedings of the 58th Annual Meeting of the Association for Computational",
      "citeRegEx" : "Khatib et al\\.,? 2020",
      "shortCiteRegEx" : "Khatib et al\\.",
      "year" : 2020
    }, {
      "title" : "Belief-based generation of argumentative claims",
      "author" : [ "Milad Alshomary", "Wei-Fan Chen", "Timon Gurcke", "Henning Wachsmuth." ],
      "venue" : "Proceedings of the 16th Conference of the European Chapter of the Association for Computational Linguistics: Main Vol-",
      "citeRegEx" : "Alshomary et al\\.,? 2021a",
      "shortCiteRegEx" : "Alshomary et al\\.",
      "year" : 2021
    }, {
      "title" : "Target inference in argument conclusion generation",
      "author" : [ "Milad Alshomary", "Shahbaz Syed", "Martin Potthast", "Henning Wachsmuth." ],
      "venue" : "Proceedings of the 58th Annual Meeting of the Association for Computational Linguistics, pages 4334–4345, On-",
      "citeRegEx" : "Alshomary et al\\.,? 2020",
      "shortCiteRegEx" : "Alshomary et al\\.",
      "year" : 2020
    }, {
      "title" : "Argument undermining: Counter-argument generation by attacking weak premises",
      "author" : [ "Milad Alshomary", "Shahbaz Syed", "Martin Potthast", "Henning Wachsmuth." ],
      "venue" : "arXiv preprint arXiv:2105.11752.",
      "citeRegEx" : "Alshomary et al\\.,? 2021b",
      "shortCiteRegEx" : "Alshomary et al\\.",
      "year" : 2021
    }, {
      "title" : "Moralstrength: Exploiting a moral lexicon and embedding similarity for moral foundations prediction",
      "author" : [ "Oscar Araque", "Lorenzo Gatti", "Kyriaki Kalimeri." ],
      "venue" : "Knowledge-based systems, 191:105184.",
      "citeRegEx" : "Araque et al\\.,? 2020",
      "shortCiteRegEx" : "Araque et al\\.",
      "year" : 2020
    }, {
      "title" : "Stance classification of context-dependent claims",
      "author" : [ "Roy Bar-Haim", "Indrajit Bhattacharya", "Francesco Dinuzzo", "Amrita Saha", "Noam Slonim." ],
      "venue" : "Proceedings of the 15th Conference of the European",
      "citeRegEx" : "Bar.Haim et al\\.,? 2017",
      "shortCiteRegEx" : "Bar.Haim et al\\.",
      "year" : 2017
    }, {
      "title" : "Automatic claim negation: Why, how and when",
      "author" : [ "Yonatan Bilu", "Daniel Hershcovich", "Noam Slonim." ],
      "venue" : "Proceedings of the 2nd Workshop on Argumentation Mining, pages 84–93, Denver, CO. Association for Computational Linguistics.",
      "citeRegEx" : "Bilu et al\\.,? 2015",
      "shortCiteRegEx" : "Bilu et al\\.",
      "year" : 2015
    }, {
      "title" : "Bert: Pre-training of deep bidirectional transformers for language understanding",
      "author" : [ "Jacob Devlin", "Ming-Wei Chang", "Kenton Lee", "Kristina Toutanova." ],
      "venue" : "NAACL-HLT (1).",
      "citeRegEx" : "Devlin et al\\.,? 2019",
      "shortCiteRegEx" : "Devlin et al\\.",
      "year" : 2019
    }, {
      "title" : "Exploring the role of prior beliefs for argument persuasion",
      "author" : [ "Esin Durmus", "Claire Cardie." ],
      "venue" : "Proceedings of the 2018 Conference of the North American Chapter of the Association for Computational Linguistics: Human Language Technologies,",
      "citeRegEx" : "Durmus and Cardie.,? 2018",
      "shortCiteRegEx" : "Durmus and Cardie.",
      "year" : 2018
    }, {
      "title" : "Corpus wide argument mining?a working solution",
      "author" : [ "Liat Ein-Dor", "Eyal Shnarch", "Lena Dankin", "Alon Halfon", "Benjamin Sznajder", "Ariel Gera", "Carlos Alzate", "Martin Gleize", "Leshem Choshen", "Yufang Hou" ],
      "venue" : "In Proceedings of the AAAI Conference",
      "citeRegEx" : "Ein.Dor et al\\.,? \\Q2020\\E",
      "shortCiteRegEx" : "Ein.Dor et al\\.",
      "year" : 2020
    }, {
      "title" : "Persuasiveness of news editorials depending on ideology and personality",
      "author" : [ "Roxanne El Baff", "Khalid Al Khatib", "Benno Stein", "Henning Wachsmuth." ],
      "venue" : "Third Workshop on Computational Modeling of People’s Opinions, Personality, and Emotion’s in So-",
      "citeRegEx" : "Baff et al\\.,? 2020",
      "shortCiteRegEx" : "Baff et al\\.",
      "year" : 2020
    }, {
      "title" : "Challenge or empower: Revisiting argumentation quality in a news editorial corpus",
      "author" : [ "Roxanne El Baff", "Henning Wachsmuth", "Khalid Al Khatib", "Benno Stein." ],
      "venue" : "Proceedings of the 22nd Conference on Computational Natural Language Learning,",
      "citeRegEx" : "Baff et al\\.,? 2018",
      "shortCiteRegEx" : "Baff et al\\.",
      "year" : 2018
    }, {
      "title" : "From gulf to bridge: When do moral arguments facilitate political influence",
      "author" : [ "Matthew Feinberg", "Robb Willer" ],
      "venue" : "Personality and Social Psychology Bulletin,",
      "citeRegEx" : "Feinberg and Willer.,? \\Q2015\\E",
      "shortCiteRegEx" : "Feinberg and Willer.",
      "year" : 2015
    }, {
      "title" : "An empirical exploration of moral foundations theory in partisan news sources",
      "author" : [ "Dean Fulgoni", "Jordan Carpenter", "Lyle Ungar", "Daniel Preoţiuc-Pietro." ],
      "venue" : "Proceedings of the Tenth International Conference on Language Resources and Evaluation",
      "citeRegEx" : "Fulgoni et al\\.,? 2016",
      "shortCiteRegEx" : "Fulgoni et al\\.",
      "year" : 2016
    }, {
      "title" : "Liberals and conservatives rely on different sets of moral foundations",
      "author" : [ "Jesse Graham", "Jonathan Haidt", "Brian A Nosek." ],
      "venue" : "Journal of personality and social psychology, 96(5):1029.",
      "citeRegEx" : "Graham et al\\.,? 2009",
      "shortCiteRegEx" : "Graham et al\\.",
      "year" : 2009
    }, {
      "title" : "The righteous mind: Why good people are divided by politics and religion",
      "author" : [ "Jonathan Haidt." ],
      "venue" : "Vintage.",
      "citeRegEx" : "Haidt.,? 2012",
      "shortCiteRegEx" : "Haidt.",
      "year" : 2012
    }, {
      "title" : "Intuitive ethics: How innately prepared intuitions generate culturally variable virtues",
      "author" : [ "Jonathan Haidt", "Craig Joseph." ],
      "venue" : "Daedalus, 133(4):55–66.",
      "citeRegEx" : "Haidt and Joseph.,? 2004",
      "shortCiteRegEx" : "Haidt and Joseph.",
      "year" : 2004
    }, {
      "title" : "Fixed that for you: Generating contrastive claims with semantic edits",
      "author" : [ "Christopher Hidey", "Kathleen McKeown." ],
      "venue" : "Proceedings of the 2019 Conference of the North American Chapter of the Association for Computational Linguistics: Human",
      "citeRegEx" : "Hidey and McKeown.,? 2019",
      "shortCiteRegEx" : "Hidey and McKeown.",
      "year" : 2019
    }, {
      "title" : "Moral foundations twitter corpus: A collection of 35k tweets",
      "author" : [ "Joe Hoover", "Gwenyth Portillo-Wightman", "Leigh Yeh", "Shreya Havaldar", "Aida Mostafazadeh Davani", "Ying Lin", "Brendan Kennedy", "Mohammad Atari", "Zahra Kamel", "Madelyn Mendlen" ],
      "venue" : null,
      "citeRegEx" : "Hoover et al\\.,? \\Q2020\\E",
      "shortCiteRegEx" : "Hoover et al\\.",
      "year" : 2020
    }, {
      "title" : "Argument generation with retrieval, planning, and realization",
      "author" : [ "Xinyu Hua", "Zhe Hu", "Lu Wang." ],
      "venue" : "Proceedings of the 57th Annual Meeting of the Association for Computational Linguistics, pages 2661–2672.",
      "citeRegEx" : "Hua et al\\.,? 2019",
      "shortCiteRegEx" : "Hua et al\\.",
      "year" : 2019
    }, {
      "title" : "Knowledge graphs meet moral values",
      "author" : [ "Ioana Hulpus", "Jonathan Kobbe", "Heiner Stuckenschmidt", "Graeme Hirst." ],
      "venue" : "Association for Computational Linguistics.",
      "citeRegEx" : "Hulpus et al\\.,? 2020",
      "shortCiteRegEx" : "Hulpus et al\\.",
      "year" : 2020
    }, {
      "title" : "Classification of moral foundations in microblog political discourse",
      "author" : [ "Kristen Johnson", "Dan Goldwasser." ],
      "venue" : "Proceedings of the 56th Annual Meeting of the Association for Computational Linguistics (Volume 1: Long Papers), pages 720–730.",
      "citeRegEx" : "Johnson and Goldwasser.,? 2018",
      "shortCiteRegEx" : "Johnson and Goldwasser.",
      "year" : 2018
    }, {
      "title" : "The problem of m rankings",
      "author" : [ "Maurice G Kendall", "B Babington Smith." ],
      "venue" : "The annals of mathematical statistics, 10(3):275–287.",
      "citeRegEx" : "Kendall and Smith.,? 1939",
      "shortCiteRegEx" : "Kendall and Smith.",
      "year" : 1939
    }, {
      "title" : "Exploring morality in argumentation",
      "author" : [ "Jonathan Kobbe", "Ines Rehbein", "Ioana Hulpu", "Heiner Stuckenschmidt" ],
      "venue" : "In Proceedings of the 7th Workshop on Argument Mining,",
      "citeRegEx" : "Kobbe et al\\.,? \\Q2020\\E",
      "shortCiteRegEx" : "Kobbe et al\\.",
      "year" : 2020
    }, {
      "title" : "Nothing more than feelings? the role of emotions in moral judgment",
      "author" : [ "David Pizarro." ],
      "venue" : "Journal for the Theory of Social Behaviour, 30(4):355–375.",
      "citeRegEx" : "Pizarro.,? 2000",
      "shortCiteRegEx" : "Pizarro.",
      "year" : 2000
    }, {
      "title" : "Aspect-controlled neural argument generation",
      "author" : [ "Benjamin Schiller", "Johannes Daxenberger", "Iryna Gurevych." ],
      "venue" : "arXiv preprint arXiv:2005.00084.",
      "citeRegEx" : "Schiller et al\\.,? 2020",
      "shortCiteRegEx" : "Schiller et al\\.",
      "year" : 2020
    }, {
      "title" : "Information-based clustering",
      "author" : [ "Noam Slonim", "Gurinder Singh Atwal", "Gašper Tkačik", "William Bialek." ],
      "venue" : "Proceedings of the National Academy of Sciences, 102(51):18297–18302.",
      "citeRegEx" : "Slonim et al\\.,? 2005",
      "shortCiteRegEx" : "Slonim et al\\.",
      "year" : 2005
    }, {
      "title" : "Generating informative conclusions for argumentative texts",
      "author" : [ "Shahbaz Syed", "Khalid Al-Khatib", "Milad Alshomary", "Henning Wachsmuth", "Martin Potthast." ],
      "venue" : "arXiv preprint arXiv:2106.01064.",
      "citeRegEx" : "Syed et al\\.,? 2021",
      "shortCiteRegEx" : "Syed et al\\.",
      "year" : 2021
    }, {
      "title" : "Argumentation synthesis following rhetorical strategies",
      "author" : [ "Henning Wachsmuth", "Manfred Stede", "Roxanne El Baff", "Khalid Al Khatib", "Maria Skeppstedt", "Benno Stein." ],
      "venue" : "Proceedings of the 27th International Conference on Computational Linguis-",
      "citeRegEx" : "Wachsmuth et al\\.,? 2018",
      "shortCiteRegEx" : "Wachsmuth et al\\.",
      "year" : 2018
    }, {
      "title" : "argued that all drugs should be legalized while attending the United Nations. He has studied the effects of drug criminalization for 15 years, and argues that all drugs should be legalized. The last issue mentioned was rural. Prostitution of adults is legal in 11 rural counties in Nevada. Mayor Goodman supports legalizing prostitution in the city’s downtown area as a revenue generator and tool for revitalization, although a majority",
      "author" : [ ],
      "venue" : "under police and medical control",
      "citeRegEx" : "Molina,? \\Q2012\\E",
      "shortCiteRegEx" : "Molina",
      "year" : 2012
    } ],
    "referenceMentions" : [ {
      "referenceID" : 15,
      "context" : "In social psychology, a body of research employs the notion of morals to understand people’s judgments on controversial topics (Haidt, 2012; Fulgoni et al., 2016).",
      "startOffset" : 127,
      "endOffset" : 162
    }, {
      "referenceID" : 13,
      "context" : "In social psychology, a body of research employs the notion of morals to understand people’s judgments on controversial topics (Haidt, 2012; Fulgoni et al., 2016).",
      "startOffset" : 127,
      "endOffset" : 162
    }, {
      "referenceID" : 8,
      "context" : "Multiple works in computational linguistics have analyzed the persuasive effectiveness of arguments depending on the target audience (Durmus and Cardie, 2018; El Baff et al., 2020), showing that audience-based features reliably predict effectiveness.",
      "startOffset" : 133,
      "endOffset" : 180
    }, {
      "referenceID" : 1,
      "context" : ", 2020) to stances on popular issues (Alshomary et al., 2021a).",
      "startOffset" : 37,
      "endOffset" : 62
    }, {
      "referenceID" : 5,
      "context" : "Feinberg and Willer (2015) demonstrated that arguments become more effective when they match the morals of the target audience.",
      "startOffset" : 0,
      "endOffset" : 27
    }, {
      "referenceID" : 15,
      "context" : "For this, we rely on the moral foundation theory (Haidt, 2012) that projects the moral system into five foundations: care, fairness, loyalty, authority, and purity.",
      "startOffset" : 49,
      "endOffset" : 62
    }, {
      "referenceID" : 24,
      "context" : "To identify morals in texts, we rely on distant supervision: We use the Reddit dataset of Schiller et al. (2020), which contains argumentative texts with annotated aspects, along with the moral-to-concept lexicon of Hulpus et al.",
      "startOffset" : 90,
      "endOffset" : 113
    }, {
      "referenceID" : 20,
      "context" : "(2020), which contains argumentative texts with annotated aspects, along with the moral-to-concept lexicon of Hulpus et al. (2020)",
      "startOffset" : 110,
      "endOffset" : 131
    }, {
      "referenceID" : 23,
      "context" : "high performance on the moral dataset of Kobbe et al. (2020) compared to ablation baselines.",
      "startOffset" : 41,
      "endOffset" : 61
    }, {
      "referenceID" : 10,
      "context" : "In line with El Baff et al. (2018), we design an in-depth user study to answer both ques-",
      "startOffset" : 16,
      "endOffset" : 35
    }, {
      "referenceID" : 28,
      "context" : "structure, and style (Wachsmuth et al., 2018), researchers also considered audience-based features",
      "startOffset" : 21,
      "endOffset" : 45
    }, {
      "referenceID" : 7,
      "context" : "Among these, both Durmus and Cardie (2018) and El Baff et al.",
      "startOffset" : 18,
      "endOffset" : 43
    }, {
      "referenceID" : 7,
      "context" : "Among these, both Durmus and Cardie (2018) and El Baff et al. (2020) study how user factors such as religion and political background affect persuasiveness, whereas Al Khatib et al.",
      "startOffset" : 18,
      "endOffset" : 69
    }, {
      "referenceID" : 0,
      "context" : "(2020) study how user factors such as religion and political background affect persuasiveness, whereas Al Khatib et al. (2020) demonstrated thats user-",
      "startOffset" : 106,
      "endOffset" : 127
    }, {
      "referenceID" : 16,
      "context" : "The moral foundation theory offers another conceptual model of understanding human judgments in daily life (Haidt and Joseph, 2004).",
      "startOffset" : 107,
      "endOffset" : 131
    }, {
      "referenceID" : 12,
      "context" : "ness of the moral foundation theory in understanding people’s behaviors and decisions (Feinberg and Willer, 2015; Fulgoni et al., 2016; Johnson and Goldwasser, 2018).",
      "startOffset" : 86,
      "endOffset" : 165
    }, {
      "referenceID" : 13,
      "context" : "ness of the moral foundation theory in understanding people’s behaviors and decisions (Feinberg and Willer, 2015; Fulgoni et al., 2016; Johnson and Goldwasser, 2018).",
      "startOffset" : 86,
      "endOffset" : 165
    }, {
      "referenceID" : 21,
      "context" : "ness of the moral foundation theory in understanding people’s behaviors and decisions (Feinberg and Willer, 2015; Fulgoni et al., 2016; Johnson and Goldwasser, 2018).",
      "startOffset" : 86,
      "endOffset" : 165
    }, {
      "referenceID" : 12,
      "context" : "ness of the moral foundation theory in understanding people’s behaviors and decisions (Feinberg and Willer, 2015; Fulgoni et al., 2016; Johnson and Goldwasser, 2018). For computational purposes, Kobbe et al. (2020) annotated moral foundations",
      "startOffset" : 87,
      "endOffset" : 215
    }, {
      "referenceID" : 6,
      "context" : "Others opposed a given claim (Bilu et al., 2015; Hidey and McKeown, 2019), generated argumentative claims on a given topic controlled for certain aspects (Schiller et al.",
      "startOffset" : 29,
      "endOffset" : 73
    }, {
      "referenceID" : 17,
      "context" : "Others opposed a given claim (Bilu et al., 2015; Hidey and McKeown, 2019), generated argumentative claims on a given topic controlled for certain aspects (Schiller et al.",
      "startOffset" : 29,
      "endOffset" : 73
    }, {
      "referenceID" : 25,
      "context" : ", 2015; Hidey and McKeown, 2019), generated argumentative claims on a given topic controlled for certain aspects (Schiller et al., 2020), or reconstructed implicit conclusions (Alshomary et al.",
      "startOffset" : 113,
      "endOffset" : 136
    }, {
      "referenceID" : 2,
      "context" : ", 2020), or reconstructed implicit conclusions (Alshomary et al., 2020; Syed et al., 2021).",
      "startOffset" : 47,
      "endOffset" : 90
    }, {
      "referenceID" : 27,
      "context" : ", 2020), or reconstructed implicit conclusions (Alshomary et al., 2020; Syed et al., 2021).",
      "startOffset" : 47,
      "endOffset" : 90
    }, {
      "referenceID" : 1,
      "context" : "(2019) and Alshomary et al. (2021b) worked on counter-argument generation, tackling the task by rebutting an argument’s conclusion or by undermining one of its weak premises respectively.",
      "startOffset" : 11,
      "endOffset" : 36
    }, {
      "referenceID" : 1,
      "context" : "Recently, Alshomary et al. (2021a) introduced the task of belief-based claim generation, aiming to",
      "startOffset" : 10,
      "endOffset" : 35
    }, {
      "referenceID" : 26,
      "context" : "Another driver in the field of argument generation is Project Debater by Slonim et al. (2021). Project Debater is an endto-end system for argument mining, retrieval, and generation.",
      "startOffset" : 73,
      "endOffset" : 94
    }, {
      "referenceID" : 26,
      "context" : "In their manual evaluation, Slonim et al. (2021) observe a competent quality of generated arguments compared to those crafted by humans.",
      "startOffset" : 28,
      "endOffset" : 49
    }, {
      "referenceID" : 23,
      "context" : "For argumentative texts, Kobbe et al. (2020) manually annotated",
      "startOffset" : 25,
      "endOffset" : 45
    }, {
      "referenceID" : 25,
      "context" : "Given this observation, we referred to the dataset of Schiller et al. (2020) which contains short argumentative texts on eight topics along",
      "startOffset" : 54,
      "endOffset" : 77
    }, {
      "referenceID" : 20,
      "context" : "To map aspects to moral foundations, we employed the lexicon of Hulpus et al. (2020)",
      "startOffset" : 64,
      "endOffset" : 85
    }, {
      "referenceID" : 7,
      "context" : "We rely on a BERT-based classifier to identify morals in texts (Devlin et al., 2019), starting from the pre-trained bert-based-cased model.",
      "startOffset" : 63,
      "endOffset" : 84
    }, {
      "referenceID" : 22,
      "context" : "first is the model performing best in the experiments of Kobbe et al. (2020), which is a multi-label BERT-based model trained on the Twitter moral corpus of Hoover et al.",
      "startOffset" : 57,
      "endOffset" : 77
    }, {
      "referenceID" : 18,
      "context" : "(2020), which is a multi-label BERT-based model trained on the Twitter moral corpus of Hoover et al. (2020). We trained our own version on the same dataset and refer to it as mBERT.",
      "startOffset" : 87,
      "endOffset" : 108
    }, {
      "referenceID" : 4,
      "context" : "based approach that computes the frequency of words belonging to each of the moral foundations (Araque et al., 2020), called Lexicon below.",
      "startOffset" : 95,
      "endOffset" : 116
    }, {
      "referenceID" : 23,
      "context" : "We tested all models on the dataset of Kobbe et al. (2020), which consists of 220 arguments annotated for moral foundations by two annotators.",
      "startOffset" : 39,
      "endOffset" : 59
    }, {
      "referenceID" : 5,
      "context" : "The narrative generation identifies the stance of claims and evidence towards the topic according to the approach of Bar-Haim et al. (2017). Only",
      "startOffset" : 117,
      "endOffset" : 140
    }, {
      "referenceID" : 26,
      "context" : "Redundant elements are then filtered out, and the remaining ones are grouped into thematic clusters, where a theme is a Wikipedia title (Slonim et al., 2005).",
      "startOffset" : 136,
      "endOffset" : 157
    }, {
      "referenceID" : 10,
      "context" : "We followed El Baff et al. (2018), defining the effectiveness of an argument either by how empowering it is (if the participant has the same stance on the topic) or by how challenging it is (otherwise).",
      "startOffset" : 15,
      "endOffset" : 34
    }, {
      "referenceID" : 12,
      "context" : "This is in line with Feinberg and Willer (2015) who found that arguments framed in terms of liberal morals were more convincing to liberals.",
      "startOffset" : 21,
      "endOffset" : 48
    }, {
      "referenceID" : 22,
      "context" : "Agreement across Ideologies We measured inter-annotator agreement between the participants using Kendall’sW (Kendall and Smith, 1939).",
      "startOffset" : 108,
      "endOffset" : 133
    }, {
      "referenceID" : 24,
      "context" : "Due to the reliability issues of self-assessment of one’s moral judgments (Pizarro, 2000), we acknowledge the limitation of this study, though.",
      "startOffset" : 74,
      "endOffset" : 89
    } ],
    "year" : 0,
    "abstractText" : "An audience’s prior beliefs and morals are strong indicators of how likely they will be affected by a given argument. Utilizing such knowledge can help focus on shared values to bring disagreeing parties towards agreement. In argumentation technology, however, this is barely exploited so far. This paper studies the feasibility of automatically generating morally framed arguments as well as their effect on different audiences. Following the moral foundation theory, we propose a system that effectively generates arguments focusing on different morals. In an in-depth user study, we ask liberals and conservatives to evaluate the impact of these arguments. Our results suggest that, particularly when prior beliefs are challenged, an audience becomes more affected by morally framed arguments.",
    "creator" : null
  }
}