{
  "name" : "ARR_2022_136_paper.pdf",
  "metadata" : {
    "source" : "CRF",
    "title" : "CBLUE: A Chinese Biomedical Language Understanding Evaluation Benchmark",
    "authors" : [ ],
    "emails" : [ ],
    "sections" : [ {
      "heading" : "1 Introduction",
      "text" : "Artificial intelligence is gradually changing the landscape of healthcare, and biomedical research (Yu et al., 2018). With the fast advancement of biomedical datasets, biomedical natural language processing (BioNLP) has facilitated a broad range of applications such as biomedical text mining, which leverages textual data in Electronic Health Records (EHRs).\nA key driving force behind such improvements and rapid iterations of models is the use of general evaluation datasets and benchmarks (Gijsbers et al., 2019). Pioneer benchmarks, such as BLURB (Gu et al., 2020), PubMedQA (Jin et al., 2019), and others, have provided us with the opportunity to conduct research on biomedical language understanding and developing real-world applications. Unfortunately, most of these benchmarks are developed in English, which makes the development of the associated machine intelligence Anglo-centric.\nMeanwhile, other languages, such as Chinese, have unique linguistic characteristics and categories that need to be considered. Even though Chinese speakers account for a quarter of the world population, there have been no existing Chinese biomedical language understanding evaluation benchmarks.\nTo address this issue and facilitate natural language processing studies in Chinese, we take the first step in introducing a comprehensive Chinese Biomedical Language Understanding Evaluation (CBLUE) benchmark with eight biomedical language understanding tasks. These tasks include named entity recognition, information extraction, clinical diagnosis normalization, short text classification, question answering (in transfer learning setting), intent classification, semantic similarity, and so on. We evaluate several pre-trained Chinese language models on CBLUE and report their performance. The current models still perform by far worse than the standard of single-human performance, leaving room for future improvements. We also conduct a comprehensive analysis using case studies to indicate the challenges and linguistic differences in Chinese biomedical language understanding. We intend to develop a universal GLUElike open platform for the Chinese BioNLP community, and this work is a small step in that direction. Overall, the main contributions of this study are as follows:\n• We propose the first Chinese biomedical language understanding benchmark, an openended, community-driven project with diverse tasks. The proposed benchmark serves as a platform for the Chinese BioNLP community and encourages new dataset contributions.\n• We report a systematic evaluation of 11 Chinese pre-trained language models to understand the challenges derived by these tasks. We release the source code of the baselines as a toolkit for future research purposes."
    }, {
      "heading" : "2 Related Work",
      "text" : "Several benchmarks have been developed to evaluate general language understanding over the past few years. GLUE (Wang et al., 2019b) is one of the first frameworks developed as a formal challenge affording straightforward comparison between taskagnostic transfer learning techniques. SuperGLUE (Wang et al., 2019a), styled after GLUE, introduce a new set of more difficult language understanding datasets. Other similarly motivated benchmarks include DecaNLP (McCann et al., 2018), which recast a set of target tasks into a general questionanswering format and prohibit task-specific parameters, and SentEval (Conneau and Kiela, 2018), which evaluate explicitly fixed-size sentence embeddings. Non-English benchmarks include RussianSuperGLUE (Shavrina et al., 2020) and CLUE (Xu et al., 2020), which is a community-driven benchmark with nine Chinese natural language understanding tasks. These benchmarks in the general domain provide a north star goal for researchers and are part of the reason we can confidently say we have made great strides in our field.\nFor BioNLP, many datasets and benchmarks have been proposed (Wang et al., 2020; Li et al., 2016; Wu et al., 2019) which promote the biomedical language understanding (Beltagy et al., 2019; Lewis et al., 2020; Lee et al., 2020). Tsatsaronis et al. (2015) propose biomedical language understanding datasets as well as a competition on largescale biomedical semantic indexing and question answering. Jin et al. (2019) propose PubMedQA, a novel biomedical question answering dataset collected from PubMed abstracts. Pappas et al. (2018) propose BioRead, which is a publicly available cloze-style biomedical machine reading compre-\nhension (MRC) dataset. Gu et al. (2020) create a leaderboard featuring the Biomedical Language Understanding & Reasoning Benchmark (BLURB). Unlike a general domain corpus, the annotation of a biomedical corpus needs expert intervention and is labor-intensive and time-consuming. Moreover, most of the benchmarks are based on English; ignoring other languages means that potentially valuable information may be lost, which can be helpful for generalization.\nIn this study, we focus on Chinese to fill the gap and aim to develop the first Chinese biomedical language understanding benchmark. Note that Chinese biomedical text is linguistically different from English and has its domain characteristics, necessitating an evaluation BioNLP benchmark designed explicitly for Chinese."
    }, {
      "heading" : "3 CBLUE Overview",
      "text" : ""
    }, {
      "heading" : "3.1 Design Principle",
      "text" : "CBLUE consists of 8 biomedical language understanding tasks.Unlike CLUE (Xu et al., 2020) as shown in Table 2, CBLUE has a diverse data source (the annotation is expensive), richer task setting, thus, more challenging for NLP models. We introduce the design principle of CBLUE as follows:\n1) Diverse tasks: CBLUE contain widespread token-level, sequence-level, sequence-pair tasks.\n2) Variety of differently distributed data: CBLUE collect data from various sources, including clinical trials, EHRs, medical forum, textbooks, and search engine logs with the read-world distribution.\n3) Quality control with long-term maintenance: We ask domain experts (doctors from Class A tertiary hospitals) to annotate datasets and carefully\nreview data to ensure data quality."
    }, {
      "heading" : "3.2 Tasks",
      "text" : "CMeEE Chinese Medical Named Entity Recognition, a dataset first released in CHIP20201, is used for CMeEE task. Given a pre-defined schema, the task is to identify and extract entities from the given sentence and classify them into nine categories: disease, clinical manifestations, drugs, medical equipment, medical procedures, body, medical examinations, microorganisms, and department.\nCMeIE Chinese Medical Information Extraction, a dataset that is also released in CHIP2020 (Guan et al., 2020), is used for CMeIE task. The task is aimed at identifying both entities and relations in a sentence following the schema constraints. There are 53 relations defined in the dataset, including 10 synonymous sub-relationships and 43 other subrelationships.\nCHIP-CDN CHIP Clinical Diagnosis Normalization, a dataset that aims to standardize the terms from the final diagnoses of Chinese electronic medical records, is used for the CHIP-CDN task. Given the original phrase, the task is required to normalize it to standard terminology based on the International Classification of Diseases (ICD-10) standard for Beijing Clinical Edition v601.\nCHIP-CTC CHIP Clinical Trial Classification, a dataset aimed at classifying clinical trials eligibility criteria, which are fundamental guidelines of clinical trials defined to identify whether a subject meets a clinical trial or not (Zong et al., 2021), is used for the CHIP-CTC task. All text data are collected from the website of the Chinese Clinical Trial Registry (ChiCTR) 2, and a total of 44 categories are defined. The task is like text clas-\n1http://cips-chip.org.cn/ 2http://chictr.org.cn/\nsification; although it is not a new task, studies and corpus for the Chinese clinical trial criterion are still limited, and we hope to promote future researches for social benefits.\nCHIP-STS CHIP Semantic Textual Similarity, a dataset for sentence similarity in the non-i.i.d. (nonindependent and identically distributed) setting, is used for the CHIP-STS task. Specifically, the task aims to transfer learning between disease types on Chinese disease questions and answer data. Given question pairs related to 5 different diseases (The disease types in the training and testing set are different), the task intends to determine whether the semantics of the two sentences are similar.\nKUAKE-QIC KUAKE Query Intent Classification, a dataset for intent classification, is used for the KUAKE-QIC task. Given the queries of search engines, the task requires to classify each of them into one of 11 medical intent categories defined in KUAKE-QIC, including diagnosis, etiology analysis, treatment plan, medical advice, test result analysis, disease description, consequence prediction, precautions, intended effects, treatment fees, and others.\nKUAKE-QTR KUAKE Query Title Relevance, a dataset used to estimate the relevance of the title of a query document, is used for the KUAKE-QTR task. Given a query (e.g., “Symptoms of vitamin B deficiency”), the task aims to find the relevant title (e.g., “The main manifestations of vitamin B deficiency”).\nKUAKE-QQR KUAKE Query-Query Relevance, a dataset used to evaluate the relevance of the content expressed in two queries, is used for the KUAKE-QQR task. Similar to KUAKE-QTR, the task aims to estimate query-query relevance, which is an essential and challenging task in real-world search engines."
    }, {
      "heading" : "3.3 Data Collection",
      "text" : "Since machine learning models are mostly datadriven, data plays a critical role, and it is pretty often in the form of a static dataset (Gebru et al., 2018). We collect data for different tasks from diverse sources, including clinical trials, EHRs, medical books, and search logs from real-world search engines. As biomedical data may contain private information such as the patient’s name, age, and gender, all collected datasets are anonymized and reviewed by the IRB committee of each data provider to preserve privacy. We introduce the data collection details followingly."
    }, {
      "heading" : "Collection from Clinical Trials",
      "text" : "Clinical trial eligibility criteria text is collected from ChiCTR, a non-profit organization that provides registration for clinical trial information for public research use. Eligibility criteria text is organized as a paragraph in the inclusion criteria and exclusion criteria in each trial registry file. The meaningless text was excluded, such as \"The criteria is as follows,\" and the remained text was annotated to generate the CHIP-CTC dataset."
    }, {
      "heading" : "Collection from EHRs",
      "text" : "We obtain the final diagnoses of the medical records from several Class A tertiary hospitals and sample a few diagnosis items from different medical departments to construct the CHIP-CDN dataset for research purposes. The diagnosis items are randomly sampled from the items not covered by the common medical synonyms dict. No privacy information is involved in the final diagnoses."
    }, {
      "heading" : "Collection from Medical Forum and Textbooks",
      "text" : "Due to the COVID-19 pandemic, online consultation has become more and more popular via the Internet. To promote data diversity, we select the online questions by patients to build the CHIP-STS dataset. Note that most of the questions are chief complaints. To ensure the authority and practicability of the corpus, we also select medical textbooks of Pediatrics (Wang et al., 2018), Clinical Pediatrics (Shen and Gui, 2013) and Clinical Practice3. We collect data from these sources to construct the CMeIE and CMeEE datasets.\n3http://www.nhc.gov.cn/"
    }, {
      "heading" : "Collection from Search Engine Logs",
      "text" : "We also collect search logs from real-world search engines like the Alibaba KUAKE Search Engine4. First, we filter the search queries in the raw search logs by the medical tag to obtain candidate medical texts. Then, we sample the documents for each query with non-zero relevance scores (i.e., to determine if the document is relevant to the query). Specifically, we divide all the documents into three categories, namely high, middle, and tail documents, and then uniformly sample the data to guarantee diversity. We leverage the data from search logs to construct KUAKE-QTC, KUAKEQTR, and KUAKE-QQR datasets."
    }, {
      "heading" : "3.4 Annotation",
      "text" : "Each sample is annotated by three to five domain experts, and the annotation with the majority of votes is taken to estimate human performance. During the annotation phase, we add control questions to prevent dishonest behaviors by the domain experts. Consequently, we reject any annotations made by domain experts who fail in the training phase and do not adopt the results of those who achieved low performance on the control tasks. We maintain strict and high criteria for approval and review at least 10 random samples from each worker to decide whether to approve or reject all their HITs. We also calculate the average interrater agreement between annotators using Fleiss’ Kappa scores (Fleiss, 1971), finding that five out of six annotations show almost perfect agreement (κ = 0.9)."
    }, {
      "heading" : "3.5 Characteristics",
      "text" : "Utility-preserving Anonymization Biomedical data may be considered as a breach in the privacy of individuals because they usually contain sensitive information. Thus, we conduct utilitypreserving anonymization following (Lee et al., 2017) to anonymize the data before releasing the benchmark.\nReal-world Distribution To promote the generalization of models, all the data in our CBLUE benchmark follow real-world distribution without up/downsampling. As shown in Figure 1(a), our dataset follows long-tail distribution following Zipf’s law so that all data will inevitably be long-tailed. However, long-tail distribution has no\n4https://www.myquark.cn/\nsignificant effect on performance. Further, some datasets, such as CMedIE, have label hierarchy with both coarse-grained and fine-grained relation labels, as shown in Figure 1(b).\nDiverse Tasks Setting Our CBLUE benchmark includes eight diverse tasks, including named entity recognition, relation extraction, and singlesentence/sentence-pair classification. Besides the independent and i.i.d. scenarios, our CBLUE benchmark also contains a specific transfer learning scenario supported by the CHIP-STS dataset, in which the testing set has a different distribution from the training set."
    }, {
      "heading" : "3.6 Leaderboard",
      "text" : "We provide a leaderboard for users to submit their own results on CBLUE. The evaluation system will give final scores for each task when users submit their prediction results. The platform offers 60 free GPU hours from Aliyun5 to help researchers develop and train their models."
    }, {
      "heading" : "3.7 Distribution and Maintenance",
      "text" : "Our CBLUE benchmark was released online on April 1, 2021. Up to now, more than 300 researchers have applied the dataset, and over 80 teams have submitted their model predictions to our platform, including medical institutions (Peking Union Medical College Hospital, etc.), universities\n5https://tianchi.aliyun.com/ notebook-ai/\n(Tsinghua University, Zhejiang University, etc.), and companies (Baidu, JD, etc.). We will continue to maintain the benchmark by attending to meet new requests and adding new tasks."
    }, {
      "heading" : "3.8 Reproducibility",
      "text" : "To make it easier to use the CBLUE benchmark, we also offer a toolkit implemented in PyTorch (Paszke et al., 2019) for reproducibility. Our toolkit supports mainstream pre-training models and a wide range of target tasks."
    }, {
      "heading" : "4 Experiments",
      "text" : "Baselines We conduct experiments with baselines based on different Chinese pre-trained language models. We add an additional output layer (e.g., MLP) for each CBLUE task and fine-tune the pre-trained models.\nModels We evaluate CBLUE on the following public available Chinese pre-trained models:\n• BERT-base (Devlin et al., 2018). We use the base model with 12 layers, 768 hidden layers, 12 heads, and 110 million parameters.\n• BERT-wwm-ext-base (Cui et al., 2019). A Chinese pre-trained BERT model with whole word masking.\n• RoBERTa-large (Liu et al., 2019). Compared with BERT, RoBERTa removes the next sentence prediction objective and dynamically\nchanges the masking pattern applied to the training data.\n• RoBERTa-wwm-ext-base/large. RoBERTawwm-ext is an efficient pre-trained model which integrates the advantages of RoBERTa and BERT-wwm.\n• ALBERT-tiny/xxlarge (Lan et al., 2019). ALBERT is a pre-trained model with two objectives: Masked Language Modeling (MLM) and Sentence Ordering Prediction (SOP).\n• ZEN (Diao et al., 2019). A BERT-based Chinese text encoder enhanced by N-gram representations, where different combinations of characters are considered during training.\n• Mac-BERT-base/large (Cui et al., 2020). MacBERT is an improved BERT with novel MLM as a correction pre-training task.\n• PCL-MedBERT6. A pre-trained medical language model proposed by the Peng Cheng Laboratory.\nWe implement all baselines with PyTorch (Paszke et al., 2019). All the training details can be found in the appendix."
    }, {
      "heading" : "4.1 Benchmark Results",
      "text" : "We report the results of our baseline models on the CBLUE benchmark in Table 3. We notice that the model obtain better performance with larger pre-trained language models. Since Chinese text is composed of terminologies, and carefully designed masking strategies may be helpful for representation learning. However, we observe that\n6https://code.ihub.org.cn/projects/ 1775\nmodels which use whole word masking do not always yield better performance than others in some tasks, such as CTC, QIC, QTR, and QQR, indicating that tasks in our benchmark are challenging and more sophisticated technologies should be developed. Further, we find that ALBERT-tiny achieves comparable performance to base models in tasks of CDN, STS, QTR, and QQR, illustrating that smaller models may also be efficient in specific tasks. We think this is caused by the different distribution between pretrained corpus and Chinese medical text; thus, large PTLMs may not obtain satisfactory performance. Finally, we notice that PCL-MedBERT, which tends to be state-of-the-art in Chinese biomedical text processing tasks, while does not perform as well as we expected. This further demonstrates the difficulty of our benchmark, and contemporary models may find it difficult to quickly achieve outstanding performance."
    }, {
      "heading" : "4.2 Human Performance",
      "text" : "For all of the tasks in CBLUE, we ask human amateur annotators with no medical experience to label instances from the testing set and compute the annotators’ majority vote against the gold label annotated by specialists. Similar to SuperGLUE (Wang et al., 2019a), we first need to train the annotators before they work on the testing data. Annotators are asked to annotate some data from the development set; then, their annotations are validated against the gold standard. Annotators need to correct their annotation mistakes repeatedly so that they can master the specific tasks. Finally, they annotate instances from the testing data, and these annotations are used to compute the final human scores. The results are shown in Table 4 and the last row of Table 3. In most tasks, humans tend to\nhave better performance."
    }, {
      "heading" : "4.3 Case studies",
      "text" : "We choose two datasets: CMeEE and KUAKEQIC, a sequence labeling and classification task, respectively, to conduct case studies. As shown in Figure 2, we report the statistics of the proportion of various types of error cases7. For CMeEE, we notice that overlap entity8, ambiguity9, need domain knowledge10, annotation error11 are major reasons that result in the prediction failure. Furthermore, there exist many instances with overlap entity, which may lead to confusion for the named entity recognition task. While in the analysis for KUAKE-QIC, almost half of bad cases are due to multiple triggers12 and colloquialism. Colloquialism13 is natural in search queries, which means that\n7See definitions of errors in the appendix. 8There exist multiple overlapping entities in the instance. 9The instance has a similar context but different meaning, which mislead the prediction. 10There exist biomedical terminologies in the instance which require domain knowledge to understand. 11The annotated label is wrong. 12There exist multiple indicative words which mislead the prediction. 13The instance is quite different from written language (e.g., with many abbreviations)\nsome descriptions of the Chinese medical text are too simplified, colloquial, or inaccurate.\nWe show some cases on CMeEE in Table 5. In the second row, we notice that given the instance of “皮疹可因宿主产生特异性的抗毒素抗体 而减少 (Rash can be reduced by the host producing specificanti-toxin antibodies.)”, ROBERTA and PCL-MedBERT obtain different predictions. The reason is that there exist medical terminologies such as “抗毒素抗体 (anti-toxin antibodies)”. ROBERTA can not identify those tokens correctly, but PCL-MedBERT, pre-trained on the medical corpus, can successfully make it. Moreover, PCLMedBERT can extract entities “缺失,易位,倒位 (eletions, translocations, inversions)” from the long sentences, which is challenging for other models.\nWe further show some cases on KUAKE-QIC in Table 6. In the first case, we notice that both BERT and BERT-ext fail to obtain the intent label of the query “请问淋巴细胞比率偏高、中 性细胞比率偏低有事吗? (Does it matter if the ratio of lymphocytes is high and the ratio of neutrophils is low?)”, while MedBERT can obtain the correct prediction. Since “淋巴细胞比率 (ratio of lymphocytes)” and “中性细胞比率 (ratio of neutrophils)” are biomedical terminologies, and the\ngeneral pre-trained language model has to leverage domain knowledge to understand those phrases.\nAs shown in Table 5 and Table 6, compared with other languages, the Chinese language is very colloquial even in medical texts. Furthermore, Chinese is also a tonal language, and the meaning of a word changes according to its tone, which usually causes confusion and difficulties for machine reading. In summary, we conclude that tasks in CBLUE are not easy to solve since the Chinese language has unique characteristics, and more robust models should be developed."
    }, {
      "heading" : "5 Conclusion",
      "text" : "In this paper, we present a Chinese Biomedical Language Understanding Evaluation (CBLUE) benchmark. We evaluate 11 current language representation models on CBLUE and analyzed their results. The results illustrate the limited ability of state-ofthe-art models to handle some of the more challenging tasks. In contrast to English benchmarks such as GLUE/SuperGLUE and BLURB, whose model performance already matches human performance, we observe that this is far from the truth for Chinese biomedical language understanding."
    }, {
      "heading" : "Ethical Considerations",
      "text" : "We collected all the data with authorization from the organization that owned the data and signed the agreement. We release the benchmark following the CC BY-NC 4.0 license. All collected datasets are anonymized and reviewed by the IRB committee of each data provider to preserve privacy. Since we collect data following real-world distribution, there may exist popularity bias that cannot be ignored."
    }, {
      "heading" : "A Broader Impact",
      "text" : "The COVID-19 (coronavirus disease 2019) pandemic has had a significant impact on society, both because of the severe health effects of COVID19 and the public health measures implemented to slow its spread. A lack of information fundamentally causes many difficulties experienced during the outbreak; attempts to address these needs caused an information overload for both researchers and the public. Biomedical natural language processing—the branch of artificial intelligence that interprets human language—can be applied to address many of the information needs making urgent by the COVID-19 pandemic. Unfortunately, most language benchmarks are in English, and no biomedical benchmark currently exists in Chinese. Our benchmark CBLUE, as the first Chinese biomedical language understanding benchmark, can serve as an open testbed for model evaluations to promote the advancement of this technology."
    }, {
      "heading" : "B Negative Impact",
      "text" : "Although we ask domain experts and doctors to annotate all the corpus, there still exist some instances with wrong annotated labels. If a model was chosen based on numbers on the benchmark, this could cause real-world harm. Moreover, our benchmark lowers the bar of entry to work with biomedical data. While generally a good thing, it may dilute the pool of data-driven work in the biomedical field even more than it already is, making it hard for experts to spot the relevant work."
    }, {
      "heading" : "C Limitations",
      "text" : "Although our CBLUE offers diverse settings, there are still some tasks not covered by the benchmark, such as medical dialogue generation (Liu et al., 2020; Lin et al., 2020; Zeng et al., 2020) or medical diagnosis (Wei et al., 2018). We encourage\nresearchers in both academics and industry to contribute new datasets. Besides, our benchmark is static; thus, models may still achieve outstanding performance on tasks but fail on simple challenge examples and falter in real-world scenarios. We leave this as future works to construct a platform including dataset creation, model development, and assessment, leading to more robust and informative benchmarks."
    }, {
      "heading" : "D CBLUE Background",
      "text" : "Standard datasets and shared tasks have played essential roles in promoting the development of AI technology. Taking the Chinese BioNLP community as an example, the CHIP (China Health Information Processing) conference releases biomedicalrelated shared tasks every year, which has extensively advanced Chinese biomedical NLP technology. However, some datasets are no longer available after the end of shared tasks, which has raised issues in the data acquisition and future research of the datasets.\nIn recent years, we can obtain state-of-the-art performance for many downstream tasks with the help of pre-trained language models. A significant trend is the emergence of multi-task leaderboards, such as GLUE (General Language Understanding Evaluation) and CLUE (Chinese Language Understanding Evaluation). These leaderboards provide a fair benchmark that attracts the attention of many researchers and further promotes the development of language model technology. For example, Microsoft has released BLURB (Biomedical Language Understanding & Reasoning Evaluation) at the end of 2020 in the medical field. Recently, the Tianchi platform has launched the CBLUE (Chinese Biomedical Language Understanding Evaluation) public benchmark under the guidance of the CHIP Society. We believe that the release of the CBLUE will further attract researchers’ attention to the medical AI field and promote the development of the community.\nCBLUE 1.014 comprises the previous shared tasks of the CHIP conference and the dataset from Alibaba QUAKE Search Engine, including named entity recognition, information extraction, clinical diagnosis normalization, single-sentence/sentencepair classification.\n14We release the benchmark following the CC BY-NC 4.0 license."
    }, {
      "heading" : "E Detailed Task Introduction",
      "text" : ""
    }, {
      "heading" : "E.1 Chinese Medical Named Entity Recognition Dataset (CMeEE)",
      "text" : "Task Background As an essential subtask of information extraction, entity recognition has achieved promising results in recent years. Biomedical texts such as textbooks, encyclopedias, clinical trials, medical literature, electronic health records, and medical examination reports contain rich medical knowledge. Named entity recognition is the process of extracting medical terminologies, such as diseases and symptoms, from the above mentioned unstructured or semi-structured texts, and it can help significantly improve the efficiency of scientific research. CMeEE dataset is proposed for this purpose, and the original dataset was released at the CHIP2020 conference.\nTask Description This task is defined as given the pre-defined schema and an input sentence to identify medical entities and to classify them into 9 categories, including disease (dis), clinical symptoms(sym), drugs (dru), medical equipment (equ), medical procedures (pro), body (bod), medical examination items (ite), microorganisms (mic), department (dep). For the detailed annotation instructions, please refer to the CBLUE official website, and examples are shown in Table 7.\nAnnotation Process The annotation guide was conducted by two medical experts from Class A tertiary hospitals and optimized during the trail annotation process. A total of 32 annotators had participated in the annotation process, including 2 medical experts who are also the owner of the annotation guideline, 4 experts from the biomedical informatics field, 6 medical M.D., and 22 master students from computer science majors. The annotation lasts for about three months (from October 2018 to December 2018), as well as an additional month’s time for curation. The total expense is about 50,000 RMB.\nThe annotation process was divided into two stages.\n• Stage1: This stage was called the trail annotation phase. The medical experts gave training to the annotators to make sure they had a comprehensive understanding of the task. Two rounds of trail annotation were conducted by the annotators, with the purpose of getting familiar with the annotation task as well as\ndiscovering the unclear points of the guideline, and annotation problems were discussed, and the medical experts improved the annotation guidelines according to the feedback iteratively.\n• Stage2: For the first phase, each record was assigned to two annotators to label independently, and the medical experts and biomedical informatics experts would give in time help. The annotation results were compared automatically by the annotation tools (developed for CMeEE and CMeIE tasks), and any disagreement was recorded and handed over to the next phase. In the second phase, medical experts and the annotators had a discussion for the disagreements records as well as other annotation problems, and the annotators made corrections. After the two stages, the IAA score (Kappa score) is 0.8537, which satisfied the research goal.\nPII and IRB The corpus is collected from authorized medical textbooks or Clinical Practice, and no personally identifiable information or offensive content is involved in the text.\nNo PII is included in the above-mentioned resources. The dataset does not refer to ethics, which has been checked by the IRB committee of the provider.\nThe original dataset format is a self-defined plain text format. To simplify the data pre-processing step, the CBLUE team has converted the data format to the unified JSON format with the permission of the data provider.\nEvaluation Metrics This task uses strict MicroF1 metrics.\nDataset Statistic This task has 15,000 training set data, 5,000 validation set data, 3,000 test set data. The corpus contains 938 files and 47,194 sentences. The average number of words contained per file is 2,355. The dataset contains 504 common pediatric diseases, 7,085 body parts, 12,907 clinical symptoms, and 4,354 medical procedures in total.\nDataset Provider The dataset is provided by:\n• Key Laboratory of Computational Linguistics, Peking University, Ministry of Education, China\n• Laboratory of Natural Language Processing, Zhengzhou University, China\n• The Research Center for Artificial Intelligence, Peng Cheng Laboratory, China\n• Harbin Institute of Technology, Shenzhen, China"
    }, {
      "heading" : "E.2 Chinese Medical Information Extraction Dataset (CMeIE)",
      "text" : "Task Background Entity and relation extraction is an essential information extraction task for natural language processing and knowledge graph (KG), which is used to detect pairs of entities and their relations from unstructured text. The technology of this task can apply to the medical field. For example, with entity and relation extraction, unstructured and semi-structured medical texts can construct medical knowledge graphs, which can serve lots of downstream tasks.\nTask Description Given the schema and sentence, in which defines the relation (Predicate)\nand its related Subject and Object, such as (“subject_type”: “疾病”，“predicate”: “药物 治疗”，“object_type”: “药物”). The task requires the model to automatically analyze the sentence and then extract all the Triples = [(S1, P1, O1), (S2, P2, O2)...] in the sentence. Table 8 shows the examples in the data set, and 53 SCHEMAs include 10 kinds of genus relations, 43 other sub-relations. The details are in the 53_schema.json file. For the detailed annotation instructions, please refer to the CBLUE official website, and examples are shown in Table 8.\nAnnotation Process The annotation guide was conducted by two medical experts from Class A tertiary hospitals and optimized during the trail annotation process. A total of 20 annotators had participated in the annotation process, including 2 medical experts who are also the owner of the annotation guideline, 2 experts from the biomedical\ninformatics field, 4 medical M.D., and 14 master students from computer science majors. The annotation lasts for about four months (from October 2018 to December 2018), which contains the annotation time as well as the curation time. The total expense is about 40,000 RMB. Similar to the CMeEE dataset, the annotation process for CMeIE also contains the trail annotation stage and the formal annotation stage following the same process. Besides, an additional step called the Chinese segmentation validation step was added for this dataset. The data provider has developed a segmentation tool for the medical texts\nwhich could generate the segment as well as the POS tagging, and some specified POS types (like ’disease,’ ’drug’) could help validate if there were potential missing named entities for this task automatically, which could help assist the annotators to check the missing labels. The final IAA for this dataset is 0.83, which could satisfy the research purpose.\nPII and IRB The corpus is collected from authorized medical textbooks or Clinical Practice, and no personally identifiable information or offensive content is involved in the text.\nNo PII is included in the above-mentioned resources. The dataset does not refer to ethics, which has been checked by the IRB committee of the provider.\nEvaluation Metrics The SPO results given by the participants need to be accurately matched. The strict Micro-F1 is used for evaluation.\nDataset Statistic This task has 14,339 training set data, 3,585 validation set data, 4,482 test set data. The dataset is from the pediatric corpus and common disease corpus. The pediatric corpus originates from 518 pediatric diseases, and the common disease corpus is derived from 109 common diseases. The dataset contains nearly 75,000 triples, 28,000 disease sentences, and 53 schemas.\nDataset Provider The dataset is provided by:\n• Key Laboratory of Computational Linguistics, Peking University, Ministry of Education, China\n• Laboratory of Natural Language Processing, Zhengzhou University, China\n• The Research Center for Artificial Intelligence, Peng Cheng Laboratory, China\n• Harbin Institute of Technology, Shenzhen, China"
    }, {
      "heading" : "E.3 CHIP - Clinical Diagnosis Normalization Dataset (CHIP-CDN)",
      "text" : "Task Background Clinical term normalization is a crucial task for both research and industry use. Clinically, there might be up to hundreds of different synonyms for the same diagnosis, symptoms, or procedures; for example, “heart tack” and “MI” both stand for the standard terminology “myocardial infarction”. The goal of this task is to find\nthe standard phrases (i.e., ICD codes) for the given clinical term. With the help of the standard code, it can help ease the burden of researchers for the statistical analysis of clinical trials; also, it can be helpful for the insurance companies on the DRGs or DIP-related applications. This task is proposed for this purpose, and the originally shared task was released at the CHIP2020 conference.\nTask Description The task aims to standardize the terms from the final diagnoses of Chinese electronic medical records. No privacy information is involved in the final diagnosis. Given the original terms, it is required to predict its corresponding standard phrase from the standard vocabulary of “International Classification of Diseases (ICD-10) for Beijing Clinical Edition v601”. For the detailed annotation instructions, please refer to the CBLUE official website. Examples are shown in Table 9.\nAnnotation Process The Chinese Diagnostic Normalization Data Set (CHIP-CDN) was annotated by the medical team of Yidu Cloud. They are all composed of people with medical backgrounds and clinician qualification certificates. This work took about 2 months, and since the work was done by internal staff, the estimated cost was around 100,000 RMB in total.\nThe Chinese Diagnostic Normalization Data Set (CHIP-CDN) is completed by one round of labeling, one round of full audit, and one round of random quality inspection. Labeling and review are completed by ordinary labeling personnel with clinical qualifications, and random quality inspections are completed by high-level terminology experts.\nPII and IRB The corpus is collected from EMR(electronic medical records), and only the final diagnoses part is chosen for research purposes. The dataset does not refer to ethics.\nAs shown in the example table, the final diagnosis has no PII included.\nThe original dataset format is a self-defined xlsx format. To unify the data pre-processing step, the CBLUE team has converted the data format to the JSON format with the permission of the data provider.\nEvaluation Metrics The F1 score is calculated with (original diagnosis terms, standard phrases) pairs. Say, if the test set has m golden pairs, and the predicted result has n pairs, where k pairs are\npredicted correctly, then:\nP = k/n,R = k/m,F1 = 2 ∗ P ∗R/(P +R). (1)\nDataset Statistic 8,000 training instances and 10,000 testing instances are provided. We split the original training set into 6,000 and 2,000 for the training and validation set, respectively.\nDataset Provider The dataset is provided by Yidu Cloud Technology Inc."
    }, {
      "heading" : "E.4 Clinical Trial Criterion Dataset (CHIP-CTC)",
      "text" : "Task Background Clinical trials refer to scientific research conducted by human volunteers to determine the efficacy, safety, and side effects of a drug or a treatment method. It plays a crucial role in promoting the development of medicine and improving human health. Depending on the purpose of the experiment, the subjects may be patients or healthy volunteers. The goal of this task is to predict whether a subject meets a clinical trial or not. Recruitment of subjects for clinical trials is generally done through manual comparison of medical records and clinical trial screening criteria, which is time-consuming, laborious, and inefficient. In recent years, methods based on natural language processing have got successful in many biomedical applications. This task is proposed with the purpose of automatically classifying clinical trial eligibility criteria for the Chinese language, and the original task is released at the CHIP2019 conference. All the data comes from real clinical trials\ncollected from the website of the Chinese Clinical Trial Registry (ChiCTR) 15, which is a non-profit organization providing registration for public research use. Each\nTask Description A total of 44 pre-defined semantic categories are defined for this task, and the goal is to predict a given text to the correct category. For the detailed annotation instructions, please refer to the CBLUE official website. Examples of labeled data are shown in Table 10.\nAnnotation Process The CHIP-CTC corpus was annotated by three annotators. The first annotator is Zuofeng Li, a principal scientist in Philips Research China, with more than a decade of research experience in the biomedical domain. Other annotators were Zeyu Zhang (Ph.D. candidate) and Jinxuan Yang (Ph.D. candidate) in the biomedical informatics field from Tongji University. The annotation started in July 2019 and took about 1 month. Further, the corpus was used in the CHIP 2019 shared task. The annotation was related to the annotator’s research project, and no payment was required.\nOne experienced biomedical researcher (Z.L) and two raters (Z.Z and J.Y, Ph.D. candidate for biomedical informatics) of biomedical domains labeled the CHIP-CTC corpus with the 44 categories. First, they studied these categories’ definitions, investigated a large number of expression patterns of criteria sentences, and chose criteria examples of each category. Next, the two raters indepen-\n15http://chictr.org.cn/\ndently annotated the same 1000 sentences, then they checked annotations and discussed contradictions with Z.L until consensus was achieved. This step repeated 20 iterations, and 20000 criteria sentences were annotated, which were later used to calculate the inter-annotator agreement score (0.9920 by Cohen’s kappa score). Finally, the remaining 18341 sentences were assigned to the two raters for annotation.\nPII and IRB The corpus is collected from the Chinese Clinical Trial Registry (ChiCTR) website, which is a non-profit organization providing registration for public research use. For each registered clinical trial case on this website, it is already approved by the ethics committee of the organization. In addition, the annotation and corpus have also been reviewed and approved by Internal Committee on Biomedical Experiments (ICBE) in Philips. It is encouraged to use the corpus for academic research.\nFor each registered clinical trial report, no PII is included.\nThe original dataset format is a self-defined csv format. To unify the data pre-processing step, the CBLUE team has converted the data format to the JSON format with the permission of the data provider.\nEvaluation Metrics The evaluation of this task uses Macro-F1. Suppose we have n categories, C1, ..., Ci, ..., Cn. The accuracy rate Pi is the number of records correctly predicted to class Ci / the number of records predicted to be class Ci. Recall rate Ri = the number of records correctly predicted as the class Ci / the number of records of the real Ci class.\nAverage− F1 = (1/n) n∑\ni=1\n2 ∗ Pi ∗Ri Pi+Ri (2)\nDataset Statistic This task has 22,962 training sets, 7,682 validation sets, and 10000 test sets.\nDataset Provider The dataset is provided by the School of Life Sciences and Technology, Tongji University, and Philips Research China."
    }, {
      "heading" : "E.5 Semantic Textual Similarity Dataset (CHIP-STS)",
      "text" : "Task Background CHIP-STS task aims to learn similar knowledge between disease types based on the Chinese online medical questions. Specifically, given question pairs from 5 different diseases, it is required to determine whether the semantics of the two sentences are similar or not. The originally shared task was released at the CHIP2019 conference.\nTask Description The category represents the name of the disease type, including diabetes, hypertension, hepatitis, aids, and breast cancer. The label indicates whether the semantics of the questions are the same. If they are the same, they are marked as 1, and if they are not the same, they are marked as 0. Examples of labeling are shown in Table 11.\nAnnotation Process The CHIP-STS corpus was annotated by five undergraduate annotators from medical colleges under the guidance of one surgeon and one physician. The task is relatively simple since it is a two-class classification one; the annotation process, as well as the time of verification, lasts for two weeks. A total of 30,000 sentences pairs are annotated, and the annotation expense is 25,000 RMB.\nThere are five types of diseases, so each annotator was assigned two types of disease to the label to guarantee that each type of disease was annotated by two raters. During the trail annotation process, each annotator was given 100 records to label, which aimed to test if they could understand\nthe tasks thoroughly. Following that, the annotators start to label the process, and medical experts would give necessary help, like explaining the disease mechanism to assist the raters. Finally, each record was labeled by two different labelers, and the disagreed pairs were selected for discussion and case study; the annotators would recheck the previous labeled results according to the experts’ feedback. The IAA score was 0.93.\nPII and IRB The corpus is collected from online questions from the medical forum, and it doesn’t refer to the ethics, which has been checked by the IRB committee of the provider.\nDuring the annotation step, sentences with PHI information are discarded by the annotators manually. The CBLUE team has also validated the dataset record by record to guarantee there is no PII included.\nThe original dataset format is a self-defined csv format. To unify the data pre-processing step, the CBLUE team has converted the data format to the JSON format with the permission of the data provider.\nEvaluation Metrics The evaluation of this task is Macro-F1.\nDataset Statistic This task has 16,000 training sets, 4,000 validation sets, and 10,000 tests set data.\nDataset Provider The dataset is provided by Ping An Technology."
    }, {
      "heading" : "E.6 KUAKE-Query Intent Classification Dataset (KUAKE-QIC)",
      "text" : "Task Background In medical search scenarios, the understanding of query intent can significantly improve the relevance of search results. In particular, medical knowledge is highly specialized, and classifying query intentions can also help integrate medical knowledge to enhance the performance\nof search results. This task is proposed for this purpose.\nTask Description There are 11 categories of medical intent labels, including diagnosis, etiology analysis, treatment plan, medical advice, test result analysis, disease description, consequence prediction, precautions, intended effects, treatment fees, and others. For the detailed annotation instructions, please refer to the CBLUE official website. Examples are shown in Table 12.\nAnnotation Process The KUAKE-QIC corpus was annotated by six annotators who graduated from medical college; they were employed by Alibaba as full-time employees for the KUAKE department. They must get past the test for the specified annotation tasks before the annotation starts. This task cost about 2 weeks, and the annotation fee was 6,600 RMB with 22,000 labeled records, that’s to say, 0.3 RMB / per record.\nThe annotation process was divided into three steps:\nThe first step was the trail annotation step; 2,000 records were selected for this stage. The annotators were grouped into 2 groups, each with 3 persons. The data provider had a strict metric for quality control, say, the IAA between the three persons within the same group must exceed 0.9.\nThe second stage is the formal annotation phase, and during this stage, 6 annotators were divided into three groups, each with 2 persons. A total of 20,000 records were annotated; IAA for this step was 0.9230.\nThe last step was the quality control step, the sampling strategy was adopted, and 300 records were sampled for validation; some common annotation problems were raised by the medical experts, and the data would be fixed in a batch mode. In addition, some disagreed cases were made final decisions by the medical experts.\nPII and IRB The corpus is collected from user queries from the KUAKE search engine, and it doesn’t refer to the ethics, which has been checked by the IRB committee of the provider.\nDuring the annotation step, sentences with PHI information or offensive information (like sexual queries) are discarded by the annotators manually. The dataset also got passed the data disclosure process of Alibaba.\nThe CBLUE team has also validated the dataset record by record to guarantee there is no PII included.\nEvaluation Metrics Accuracy is used for the evaluation of this task.\nDataset Statistic This task has 6,931 training set data, 1,955 validation set data, and 1,994 test set data.\nDataset Provider The dataset is provided by Alibaba QUAKE Search Engine."
    }, {
      "heading" : "E.7 KUAKE- Query Title Relevance Dataset (KUAKE-QTR)",
      "text" : "Task Background KUAKE Query Title Relevance is a dataset for query document (title) relevance estimation. For example, give the query “Symptoms of vitamin B deficiency”, the relevant title should be “The main manifestations of vitamin B deficiency”.\nTask Description The correlation between Query and Title is divided into 4 levels (0-3), 0 is the worst, and 3 stands for the best match. For the detailed annotation instructions, please refer to the CBLUE official website. Examples are shown in Table 13.\nAnnotation Process The KUAKE-QTR corpus was annotated by a total of nine annotators, among which seven were from third-party crowd-sourcing undergraduates from medical colleges, and two were from Alibaba full-time employees with medical backgrounds. The crowd-sourcing annotators were required to get trained and pass the annotation test before they could execute the task. The annotations lasted for 2 weeks, and a total of 28,000 RMB was used.\nSimilar to the KUAKE-QIC task, the KUAKEQTR annotation process was divided into three steps with minor changes:\nThe training and examination stage: The seven annotators got trained by the two FTE (full-time employee) experts to understand the tasks, then each one was given 200 records to label, which have ground-truth answer annotated by FTE experts. The precision must be above 85% to get past the test.\nThe second step was the formal annotation step, and Each annotator was given 3,000 records to label, among which 100 were with golden labels. The\nannotation tools would automatically evaluate the annotation quality by comparing the label between the annotators’ ones and the golden ones. Help would be given to the annotators if necessary. Only the precision exceeding the threshold 0.85 would be handed to the next round.\nThe last step was the quality control step, the sampling strategy was adopted, and 100 records were sampled for validation by the FTE medical experts; bad cases would be returned to the crowdsourcing annotators to be fixed.\nPII and IRB The corpus is collected from user queries from the KUAKE search engine, and it doesn’t refer to the ethics, which has been checked by the IRB committee of the provider.\nDuring the annotation step, sentences with PHI information or offensive information (like sexual queries) are discarded by the annotators manually. The dataset also got passed the data disclosure process of Alibaba.\nThe CBLUE team has also validated the dataset record by record to guarantee there is no PII included. One record with the NULL label was discarded with the permission of the provider.\nEvaluation Metrics Same as the KUAKE-QIC task, accuracy is used for the evaluation of this task.\nDataset Statistic This task has 24,174 training set data, 2,913 validation set data, and 54,65 test set data.\nDataset Provider This dataset is provided by Alibaba QUAKE Search Engine."
    }, {
      "heading" : "E.8 KUAKE - Query Query Relevance Dataset (KUAKE-QQR)",
      "text" : "Task Background KUAKE Query-Query Relevance is a dataset that evaluates the relevance between two given queries to resolve the long-tail challenges for search engines. Similar to KUAKEQTR, query-query relevance is an essential and challenging task in real-world search engines.\nTask Description The correlation between Query and Title is divided into 3 levels (0-2), 0 is the worst, and 2 stands for the best correlation. For the detailed annotation instructions, please refer to the CBLUE official website. Examples are shown in Table 14.\nAnnotation Process The same as KUAKE-QTR except for the expense, which is 22,000 RMB in total.\nPII and IRB The same as KUAKE-QTR.\nEvaluation Metrics Same with the KUAKEQIC and KUAKE-QTR tasks, accuracy is used for the evaluation metrics.\nDataset Statistic This task has 15,000 training set data, 1,600 validation set data, and 1,596 test set data.\nDataset Provider This dataset is provided by Alibaba QUAKE Search Engine."
    }, {
      "heading" : "F Experiments Details",
      "text" : "This section details the training procedures and hyper-parameters for each of the data sets. We\nutilize Pytorch to conduct experiments, and all running hyper-parameters are shown in the following Tables. There are two stages in CMeIE, namely, entity recognition (CMeEE-ER) and relation classification (CMeEE-RE). So we detail the hyperparameters in CMeEE-ER and CMeEE-RE, respectively.\nRequirements\n• python3\n• pytorch 1.7\n• transformers 4.5.1\n• jieba\n• gensim\nHyper-parameters for Specific Task is shown in Table 15-26"
    }, {
      "heading" : "G Error Analysis for Other Tasks",
      "text" : "We introduce the error definition as follows and illustrate some error cases for other tasks in Table 27 to 32.\nAmbiguity indicates that the instance has a similar context but different meaning, which mislead the prediction.\nNeed domain knowledge indicates that there exist biomedical terminologies in the instance which require domain knowledge to understand.\nNeed syntactic knowledge indicates that there exists complex syntactic structure in the instance, and the model fails to understand the correct meaning.\nOverlap entity indicates there exist multiple overlapping entities in the instance.\nLong sequence indicates that the input instance is very long.\nAnnotation error indicates that the annotated label is wrong.\nWrong entity boundary indicates that the instance has the wrong entity boundary.\nRare words indicates that there exist lowfrequency words in the instance.\nMultiple triggers indicates that there exist multiple indicative words which mislead the prediction.\nColloquialism (very common in the search queries) indicates that the instance is quite different from written language (e.g., with many abbreviations), thus, challenging the prediction model.\nIrrelevant description indicates that the instance has lots of irrelevant information, which mislead the prediction."
    } ],
    "references" : [ {
      "title" : "Scibert: A pretrained language model for scientific text",
      "author" : [ "Iz Beltagy", "Kyle Lo", "Arman Cohan." ],
      "venue" : "Proceedings of the 2019 Conference on Empirical Methods in Natural Language Processing and the 9th International Joint Conference on Natural",
      "citeRegEx" : "Beltagy et al\\.,? 2019",
      "shortCiteRegEx" : "Beltagy et al\\.",
      "year" : 2019
    }, {
      "title" : "Senteval: An evaluation toolkit for universal sentence representations",
      "author" : [ "Alexis Conneau", "Douwe Kiela." ],
      "venue" : "Proceedings of the Eleventh International Conference on Language Resources and Evaluation, LREC 2018, Miyazaki, Japan, May 7-12, 2018. Eu-",
      "citeRegEx" : "Conneau and Kiela.,? 2018",
      "shortCiteRegEx" : "Conneau and Kiela.",
      "year" : 2018
    }, {
      "title" : "Revisiting pretrained models for chinese natural language processing",
      "author" : [ "Yiming Cui", "Wanxiang Che", "Ting Liu", "Bing Qin", "Shijin Wang", "Guoping Hu." ],
      "venue" : "arXiv preprint arXiv:2004.13922.",
      "citeRegEx" : "Cui et al\\.,? 2020",
      "shortCiteRegEx" : "Cui et al\\.",
      "year" : 2020
    }, {
      "title" : "Pre-training with whole word masking for chinese bert",
      "author" : [ "Yiming Cui", "Wanxiang Che", "Ting Liu", "Bing Qin", "Ziqing Yang", "Shijin Wang", "Guoping Hu." ],
      "venue" : "arXiv preprint arXiv:1906.08101.",
      "citeRegEx" : "Cui et al\\.,? 2019",
      "shortCiteRegEx" : "Cui et al\\.",
      "year" : 2019
    }, {
      "title" : "Bert: Pre-training of deep bidirectional transformers for language understanding",
      "author" : [ "Jacob Devlin", "Ming-Wei Chang", "Kenton Lee", "Kristina Toutanova." ],
      "venue" : "NAACL-HLT.",
      "citeRegEx" : "Devlin et al\\.,? 2018",
      "shortCiteRegEx" : "Devlin et al\\.",
      "year" : 2018
    }, {
      "title" : "Zen: pre-training chinese text encoder enhanced by n-gram representations",
      "author" : [ "Shizhe Diao", "Jiaxin Bai", "Yan Song", "Tong Zhang", "Yonggang Wang." ],
      "venue" : "arXiv preprint arXiv:1911.00720.",
      "citeRegEx" : "Diao et al\\.,? 2019",
      "shortCiteRegEx" : "Diao et al\\.",
      "year" : 2019
    }, {
      "title" : "Measuring nominal scale agreement among many raters",
      "author" : [ "Joseph L Fleiss." ],
      "venue" : "Psychological bulletin, 76(5):378.",
      "citeRegEx" : "Fleiss.,? 1971",
      "shortCiteRegEx" : "Fleiss.",
      "year" : 1971
    }, {
      "title" : "Datasheets for datasets",
      "author" : [ "Timnit Gebru", "Jamie Morgenstern", "Briana Vecchione", "Jennifer Wortman Vaughan", "Hanna M. Wallach", "Hal Daumé III", "Kate Crawford." ],
      "venue" : "CoRR, abs/1803.09010.",
      "citeRegEx" : "Gebru et al\\.,? 2018",
      "shortCiteRegEx" : "Gebru et al\\.",
      "year" : 2018
    }, {
      "title" : "An open source automl benchmark",
      "author" : [ "Pieter Gijsbers", "Erin LeDell", "Janek Thomas", "Sébastien Poirier", "Bernd Bischl", "Joaquin Vanschoren." ],
      "venue" : "arXiv preprint arXiv:1907.00909.",
      "citeRegEx" : "Gijsbers et al\\.,? 2019",
      "shortCiteRegEx" : "Gijsbers et al\\.",
      "year" : 2019
    }, {
      "title" : "Domain-specific language model pretraining for biomedical natural language processing",
      "author" : [ "Yu Gu", "Robert Tinn", "Hao Cheng", "Michael Lucas", "Naoto Usuyama", "Xiaodong Liu", "Tristan Naumann", "Jianfeng Gao", "Hoifung Poon." ],
      "venue" : "CoRR,",
      "citeRegEx" : "Gu et al\\.,? 2020",
      "shortCiteRegEx" : "Gu et al\\.",
      "year" : 2020
    }, {
      "title" : "CMeIE: Construction and Evaluation of Chinese Medical Information Extraction Dataset",
      "author" : [ "T. Guan", "H. Zan", "X. Zhou", "H. Xu", "K Zhang." ],
      "venue" : "Natural Language Processing and Chinese Computing, 9th CCF International Conference, NLPCC 2020,",
      "citeRegEx" : "Guan et al\\.,? 2020",
      "shortCiteRegEx" : "Guan et al\\.",
      "year" : 2020
    }, {
      "title" : "Pubmedqa: A dataset for biomedical research question answering",
      "author" : [ "Qiao Jin", "Bhuwan Dhingra", "Zhengping Liu", "William W. Cohen", "Xinghua Lu." ],
      "venue" : "Proceedings of the 2019 Conference on Empirical Methods in Natural Language Processing and",
      "citeRegEx" : "Jin et al\\.,? 2019",
      "shortCiteRegEx" : "Jin et al\\.",
      "year" : 2019
    }, {
      "title" : "Albert: A lite bert for self-supervised learning of language representations",
      "author" : [ "Zhenzhong Lan", "Mingda Chen", "Sebastian Goodman", "Kevin Gimpel", "Piyush Sharma", "Radu Soricut." ],
      "venue" : "arXiv preprint arXiv:1909.11942.",
      "citeRegEx" : "Lan et al\\.,? 2019",
      "shortCiteRegEx" : "Lan et al\\.",
      "year" : 2019
    }, {
      "title" : "Utility-preserving anonymization for health data publishing",
      "author" : [ "Hyukki Lee", "Soohyung Kim", "Jong Wook Kim", "Yon Dohn Chung." ],
      "venue" : "BMC Medical Informatics Decis. Mak., 17(1):104:1– 104:12.",
      "citeRegEx" : "Lee et al\\.,? 2017",
      "shortCiteRegEx" : "Lee et al\\.",
      "year" : 2017
    }, {
      "title" : "Biobert: a pre-trained biomedical language representation model for biomedical text mining",
      "author" : [ "Jinhyuk Lee", "Wonjin Yoon", "Sungdong Kim", "Donghyeon Kim", "Sunkyu Kim", "Chan Ho So", "Jaewoo Kang." ],
      "venue" : "Bioinformatics, 36(4):1234–1240.",
      "citeRegEx" : "Lee et al\\.,? 2020",
      "shortCiteRegEx" : "Lee et al\\.",
      "year" : 2020
    }, {
      "title" : "Pretrained language models for biomedical and clinical tasks: Understanding and extending the state-of-the-art",
      "author" : [ "Patrick Lewis", "Myle Ott", "Jingfei Du", "Veselin Stoyanov." ],
      "venue" : "Proceedings of the 3rd Clinical Natural Language Processing Workshop,",
      "citeRegEx" : "Lewis et al\\.,? 2020",
      "shortCiteRegEx" : "Lewis et al\\.",
      "year" : 2020
    }, {
      "title" : "Biocreative v cdr task corpus: a resource for chemical disease relation extraction",
      "author" : [ "J. Li", "Yueping Sun", "Robin J. Johnson", "Daniela Sciaky", "Chih-Hsuan Wei", "Robert Leaman", "A.P. Davis", "C. Mattingly", "Thomas C. Wiegers", "Zhiyong Lu." ],
      "venue" : "Database:",
      "citeRegEx" : "Li et al\\.,? 2016",
      "shortCiteRegEx" : "Li et al\\.",
      "year" : 2016
    }, {
      "title" : "Graph-evolving meta-learning for lowresource medical dialogue generation",
      "author" : [ "Shuai Lin", "Pan Zhou", "Xiaodan Liang", "Jianheng Tang", "Ruihui Zhao", "Ziliang Chen", "Liang Lin." ],
      "venue" : "CoRR, abs/2012.11988.",
      "citeRegEx" : "Lin et al\\.,? 2020",
      "shortCiteRegEx" : "Lin et al\\.",
      "year" : 2020
    }, {
      "title" : "Meddg: A large-scale medical consultation dataset for building medical dialogue system",
      "author" : [ "Wenge Liu", "Jianheng Tang", "Jinghui Qin", "Lin Xu", "Zhen Li", "Xiaodan Liang." ],
      "venue" : "CoRR, abs/2010.07497.",
      "citeRegEx" : "Liu et al\\.,? 2020",
      "shortCiteRegEx" : "Liu et al\\.",
      "year" : 2020
    }, {
      "title" : "Roberta: A robustly optimized bert pretraining approach",
      "author" : [ "Yinhan Liu", "Myle Ott", "Naman Goyal", "Jingfei Du", "Mandar Joshi", "Danqi Chen", "Omer Levy", "Mike Lewis", "Luke Zettlemoyer", "Veselin Stoyanov." ],
      "venue" : "arXiv preprint arXiv:1907.11692.",
      "citeRegEx" : "Liu et al\\.,? 2019",
      "shortCiteRegEx" : "Liu et al\\.",
      "year" : 2019
    }, {
      "title" : "The natural language decathlon: Multitask learning as question answering",
      "author" : [ "Bryan McCann", "Nitish Shirish Keskar", "Caiming Xiong", "Richard Socher." ],
      "venue" : "CoRR, abs/1806.08730.",
      "citeRegEx" : "McCann et al\\.,? 2018",
      "shortCiteRegEx" : "McCann et al\\.",
      "year" : 2018
    }, {
      "title" : "Bioread: A new dataset for biomedical reading comprehension",
      "author" : [ "Dimitris Pappas", "Ion Androutsopoulos", "Haris Papageorgiou." ],
      "venue" : "Proceedings of the Eleventh International Conference on Language Resources and Evaluation, LREC 2018,",
      "citeRegEx" : "Pappas et al\\.,? 2018",
      "shortCiteRegEx" : "Pappas et al\\.",
      "year" : 2018
    }, {
      "title" : "Pytorch: An imperative style, high-performance deep learning library",
      "author" : [ "Adam Paszke", "Sam Gross", "Francisco Massa", "Adam Lerer", "James Bradbury", "Gregory Chanan", "Trevor Killeen", "Zeming Lin", "Natalia Gimelshein", "Luca Antiga" ],
      "venue" : null,
      "citeRegEx" : "Paszke et al\\.,? \\Q2019\\E",
      "shortCiteRegEx" : "Paszke et al\\.",
      "year" : 2019
    }, {
      "title" : "Russiansuperglue: A russian language",
      "author" : [ "Tatiana Shavrina", "Alena Fenogenova", "Anton A. Emelyanov", "Denis Shevelev", "Ekaterina Artemova", "Valentin Malykh", "Vladislav Mikhailov", "Maria Tikhonova", "Andrey Chertok", "Andrey Evlampiev" ],
      "venue" : null,
      "citeRegEx" : "Shavrina et al\\.,? \\Q2020\\E",
      "shortCiteRegEx" : "Shavrina et al\\.",
      "year" : 2020
    }, {
      "title" : "Clinical Pediatrics 2nd edn",
      "author" : [ "Xiaoming Shen", "Yonghao Gui." ],
      "venue" : "People’s Medical Publishing House.",
      "citeRegEx" : "Shen and Gui.,? 2013",
      "shortCiteRegEx" : "Shen and Gui.",
      "year" : 2013
    }, {
      "title" : "An overview of the BIOASQ large-scale biomedical",
      "author" : [ "las Baskiotis", "Patrick Gallinari", "Thierry Artières", "Axel-Cyrille Ngonga Ngomo", "Norman Heino", "Éric Gaussier", "Liliana Barrio-Alvers", "Michael Schroeder", "Ion Androutsopoulos", "Georgios Paliouras" ],
      "venue" : null,
      "citeRegEx" : "Baskiotis et al\\.,? \\Q2015\\E",
      "shortCiteRegEx" : "Baskiotis et al\\.",
      "year" : 2015
    }, {
      "title" : "Superglue: A stickier benchmark for general-purpose language understanding systems",
      "author" : [ "Alex Wang", "Yada Pruksachatkun", "Nikita Nangia", "Amanpreet Singh", "Julian Michael", "Felix Hill", "Omer Levy", "Samuel R. Bowman." ],
      "venue" : "Advances in Neural Infor-",
      "citeRegEx" : "Wang et al\\.,? 2019a",
      "shortCiteRegEx" : "Wang et al\\.",
      "year" : 2019
    }, {
      "title" : "GLUE: A multi-task benchmark and analysis platform for natural language understanding",
      "author" : [ "Alex Wang", "Amanpreet Singh", "Julian Michael", "Felix Hill", "Omer Levy", "Samuel R. Bowman." ],
      "venue" : "7th International Conference on Learning Representa-",
      "citeRegEx" : "Wang et al\\.,? 2019b",
      "shortCiteRegEx" : "Wang et al\\.",
      "year" : 2019
    }, {
      "title" : "CORD19: the covid-19 open research dataset. CoRR, abs/2004.10706",
      "author" : [ "son", "Alex D. Wade", "Kuansan Wang", "Chris Wilhelm", "Boya Xie", "Douglas Raymond", "Daniel S. Weld", "Oren Etzioni", "Sebastian Kohlmeier" ],
      "venue" : null,
      "citeRegEx" : "son et al\\.,? \\Q2020\\E",
      "shortCiteRegEx" : "son et al\\.",
      "year" : 2020
    }, {
      "title" : "Pediatrics 9th edn",
      "author" : [ "Weiping Wang", "Kun Song", "Liwen Chang." ],
      "venue" : "People’s Medical Publishing House.",
      "citeRegEx" : "Wang et al\\.,? 2018",
      "shortCiteRegEx" : "Wang et al\\.",
      "year" : 2018
    }, {
      "title" : "Task-oriented dialogue system for automatic diagnosis",
      "author" : [ "Zhongyu Wei", "Qianlong Liu", "Baolin Peng", "Huaixiao Tou", "Ting Chen", "Xuanjing Huang", "Kam-Fai Wong", "Xiangying Dai." ],
      "venue" : "Proceedings of the 56th Annual Meeting of the Association for Com-",
      "citeRegEx" : "Wei et al\\.,? 2018",
      "shortCiteRegEx" : "Wei et al\\.",
      "year" : 2018
    }, {
      "title" : "Renet: A deep learning approach for extracting gene-disease associations from literature",
      "author" : [ "Y. Wu", "Ruibang Luo", "H. Leung", "H. Ting", "T. Lam." ],
      "venue" : "RECOMB.",
      "citeRegEx" : "Wu et al\\.,? 2019",
      "shortCiteRegEx" : "Wu et al\\.",
      "year" : 2019
    }, {
      "title" : "CLUE: A chinese language understanding evaluation benchmark",
      "author" : [ "Zuoyu Tian", "Yiwen Zhang", "He Zhou", "Shaoweihua Liu", "Zhe Zhao", "Qipeng Zhao", "Cong Yue", "Xinrui Zhang", "Zhengliang Yang", "Kyle Richardson", "Zhenzhong Lan." ],
      "venue" : "Proceed-",
      "citeRegEx" : "Tian et al\\.,? 2020",
      "shortCiteRegEx" : "Tian et al\\.",
      "year" : 2020
    }, {
      "title" : "Artificial intelligence in healthcare",
      "author" : [ "Kun-Hsing Yu", "Andrew L Beam", "Isaac S Kohane." ],
      "venue" : "Nature biomedical engineering, 2(10):719–731.",
      "citeRegEx" : "Yu et al\\.,? 2018",
      "shortCiteRegEx" : "Yu et al\\.",
      "year" : 2018
    }, {
      "title" : "Meddialog: Large-scale medical dialogue datasets",
      "author" : [ "Fang", "Penghui Zhu", "Shu Chen", "Pengtao Xie." ],
      "venue" : "Proceedings of the 2020 Conference on Empirical Methods in Natural Language Processing, EMNLP 2020, Online, November 16-20, 2020,",
      "citeRegEx" : "Fang et al\\.,? 2020",
      "shortCiteRegEx" : "Fang et al\\.",
      "year" : 2020
    }, {
      "title" : "Semantic categorization of chinese eligibility criteria in clinical trials using machine learning methods",
      "author" : [ "Hui Zong", "Jinxuan Yang", "Zeyu Zhang", "Zuofeng Li", "Xiaoyan Zhang." ],
      "venue" : "BMC Medical Informatics Decis. Mak., 21(1):128.",
      "citeRegEx" : "Zong et al\\.,? 2021",
      "shortCiteRegEx" : "Zong et al\\.",
      "year" : 2021
    }, {
      "title" : "candidate) and Jinxuan Yang (Ph.D. candidate) in the biomedical informatics field from Tongji University. The annotation started in July 2019 and took about 1 month",
      "author" : [ "Zeyu Zhang (Ph.D" ],
      "venue" : null,
      "citeRegEx" : ".Ph.D.,? \\Q2019\\E",
      "shortCiteRegEx" : ".Ph.D.",
      "year" : 2019
    } ],
    "referenceMentions" : [ {
      "referenceID" : 33,
      "context" : "Artificial intelligence is gradually changing the landscape of healthcare, and biomedical research (Yu et al., 2018).",
      "startOffset" : 99,
      "endOffset" : 116
    }, {
      "referenceID" : 8,
      "context" : "A key driving force behind such improvements and rapid iterations of models is the use of general evaluation datasets and benchmarks (Gijsbers et al., 2019).",
      "startOffset" : 133,
      "endOffset" : 156
    }, {
      "referenceID" : 9,
      "context" : "Pioneer benchmarks, such as BLURB (Gu et al., 2020), PubMedQA (Jin et al.",
      "startOffset" : 34,
      "endOffset" : 51
    }, {
      "referenceID" : 11,
      "context" : ", 2020), PubMedQA (Jin et al., 2019), and others, have provided us with the opportunity to conduct research on biomedical language understanding and developing real-world applications.",
      "startOffset" : 18,
      "endOffset" : 36
    }, {
      "referenceID" : 27,
      "context" : "GLUE (Wang et al., 2019b) is one of the first frameworks developed as a formal challenge affording straightforward comparison between taskagnostic transfer learning techniques.",
      "startOffset" : 5,
      "endOffset" : 25
    }, {
      "referenceID" : 26,
      "context" : "SuperGLUE (Wang et al., 2019a), styled after GLUE, introduce a new set of more difficult language understanding datasets.",
      "startOffset" : 10,
      "endOffset" : 30
    }, {
      "referenceID" : 20,
      "context" : "Other similarly motivated benchmarks include DecaNLP (McCann et al., 2018), which recast a set of target tasks into a general questionanswering format and prohibit task-specific parameters, and SentEval (Conneau and Kiela, 2018), which evaluate explicitly fixed-size sentence embeddings.",
      "startOffset" : 53,
      "endOffset" : 74
    }, {
      "referenceID" : 1,
      "context" : ", 2018), which recast a set of target tasks into a general questionanswering format and prohibit task-specific parameters, and SentEval (Conneau and Kiela, 2018), which evaluate explicitly fixed-size sentence embeddings.",
      "startOffset" : 136,
      "endOffset" : 161
    }, {
      "referenceID" : 23,
      "context" : "Non-English benchmarks include RussianSuperGLUE (Shavrina et al., 2020) and CLUE (Xu et al.",
      "startOffset" : 48,
      "endOffset" : 71
    }, {
      "referenceID" : 16,
      "context" : "For BioNLP, many datasets and benchmarks have been proposed (Wang et al., 2020; Li et al., 2016; Wu et al., 2019) which promote the biomedical language understanding (Beltagy et al.",
      "startOffset" : 60,
      "endOffset" : 113
    }, {
      "referenceID" : 31,
      "context" : "For BioNLP, many datasets and benchmarks have been proposed (Wang et al., 2020; Li et al., 2016; Wu et al., 2019) which promote the biomedical language understanding (Beltagy et al.",
      "startOffset" : 60,
      "endOffset" : 113
    }, {
      "referenceID" : 0,
      "context" : ", 2019) which promote the biomedical language understanding (Beltagy et al., 2019; Lewis et al., 2020; Lee et al., 2020).",
      "startOffset" : 60,
      "endOffset" : 120
    }, {
      "referenceID" : 15,
      "context" : ", 2019) which promote the biomedical language understanding (Beltagy et al., 2019; Lewis et al., 2020; Lee et al., 2020).",
      "startOffset" : 60,
      "endOffset" : 120
    }, {
      "referenceID" : 14,
      "context" : ", 2019) which promote the biomedical language understanding (Beltagy et al., 2019; Lewis et al., 2020; Lee et al., 2020).",
      "startOffset" : 60,
      "endOffset" : 120
    }, {
      "referenceID" : 10,
      "context" : "CMeIE Chinese Medical Information Extraction, a dataset that is also released in CHIP2020 (Guan et al., 2020), is used for CMeIE task.",
      "startOffset" : 90,
      "endOffset" : 109
    }, {
      "referenceID" : 35,
      "context" : "CHIP-CTC CHIP Clinical Trial Classification, a dataset aimed at classifying clinical trials eligibility criteria, which are fundamental guidelines of clinical trials defined to identify whether a subject meets a clinical trial or not (Zong et al., 2021), is used for the CHIP-CTC task.",
      "startOffset" : 234,
      "endOffset" : 253
    }, {
      "referenceID" : 7,
      "context" : "Since machine learning models are mostly datadriven, data plays a critical role, and it is pretty often in the form of a static dataset (Gebru et al., 2018).",
      "startOffset" : 136,
      "endOffset" : 156
    }, {
      "referenceID" : 29,
      "context" : "To ensure the authority and practicability of the corpus, we also select medical textbooks of Pediatrics (Wang et al., 2018), Clinical Pediatrics (Shen and Gui, 2013) and Clinical Practice3.",
      "startOffset" : 105,
      "endOffset" : 124
    }, {
      "referenceID" : 24,
      "context" : ", 2018), Clinical Pediatrics (Shen and Gui, 2013) and Clinical Practice3.",
      "startOffset" : 29,
      "endOffset" : 49
    }, {
      "referenceID" : 6,
      "context" : "We also calculate the average interrater agreement between annotators using Fleiss’ Kappa scores (Fleiss, 1971), finding that five out of six annotations show almost perfect agreement (κ = 0.",
      "startOffset" : 97,
      "endOffset" : 111
    }, {
      "referenceID" : 13,
      "context" : "Thus, we conduct utilitypreserving anonymization following (Lee et al., 2017) to anonymize the data before releasing the benchmark.",
      "startOffset" : 59,
      "endOffset" : 77
    }, {
      "referenceID" : 22,
      "context" : "To make it easier to use the CBLUE benchmark, we also offer a toolkit implemented in PyTorch (Paszke et al., 2019) for reproducibility.",
      "startOffset" : 93,
      "endOffset" : 114
    }, {
      "referenceID" : 22,
      "context" : "We implement all baselines with PyTorch (Paszke et al., 2019).",
      "startOffset" : 40,
      "endOffset" : 61
    }, {
      "referenceID" : 26,
      "context" : "Similar to SuperGLUE (Wang et al., 2019a), we first need to train the annotators before they work on the testing data.",
      "startOffset" : 21,
      "endOffset" : 41
    }, {
      "referenceID" : 18,
      "context" : "Although our CBLUE offers diverse settings, there are still some tasks not covered by the benchmark, such as medical dialogue generation (Liu et al., 2020; Lin et al., 2020; Zeng et al., 2020) or medical diagnosis (Wei et al.",
      "startOffset" : 137,
      "endOffset" : 192
    }, {
      "referenceID" : 17,
      "context" : "Although our CBLUE offers diverse settings, there are still some tasks not covered by the benchmark, such as medical dialogue generation (Liu et al., 2020; Lin et al., 2020; Zeng et al., 2020) or medical diagnosis (Wei et al.",
      "startOffset" : 137,
      "endOffset" : 192
    } ],
    "year" : 0,
    "abstractText" : "With the development of biomedical language understanding benchmarks, Artificial Intelligence applications are widely used in the medical field. However, most benchmarks are limited to English, which makes it challenging to replicate many of the successes in English for other languages. To facilitate research in this direction, we collect real-world biomedical data and present the first Chinese Biomedical Language Understanding Evaluation (CBLUE) benchmark: a collection of natural language understanding tasks including named entity recognition, information extraction, clinical diagnosis normalization, and an associated online platform for model evaluation, comparison, and analysis. To establish evaluation on these tasks, we report empirical results with the current 11 pre-trained Chinese models, and experimental results show that state-of-the-art neural models perform by far worse than the human ceiling.",
    "creator" : null
  }
}