{
  "name" : "ARR_2022_188_paper.pdf",
  "metadata" : {
    "source" : "CRF",
    "title" : "Letters from the past: modeling historical sound change through diachronic character embeddings",
    "authors" : [ ],
    "emails" : [ ],
    "sections" : [ {
      "heading" : "1 Introduction",
      "text" : "The study of sound change goes back to the beginnings of modern linguistics in early nineteenth century, when scholars such as Rask and Grimm started making hypotheses about the way sound changes over time, which in turn lead to the discovery of regular sound correspondences between ancient languages and the identification of cognates in modern ones (Murray, 2015).\nSince spoken language from the past is not available, however, sound change in ancient languages must be deduced from written records by considering development in spelling through time. In addition, while we may be able to see from the written records that a change did occur, less is known on the specific dynamics of the change. Details of these dynamics include knowledge of when the change started to appear, how long it took for it to be complete, what was the relative chronology of\nindividual sounds in a larger shift, what was the geographical distribution of a change and so forth.\nDue to the sparsity of linguistic evidence, detailed empirical studies of chronological sound change are difficult to conduct. This is especially the case for older stages of languages, where little written text was produced, and much of what did exist has been lost in transmission. However, as we move forward in history to the rise of bureaucracy, for example in medieval Europe, we see that an extensive amount of written records were made. Text from this period of time is interesting in the context of a study of sound change because it shows great variability in spelling patterns. With the digitalization of such archives1, therefore, new opportunities arise to apply computational methods to the study of sound change through written text.\nConsiderable effort has already been devoted to the development of computational approaches aimed at discovering lexical semantic change (LSC) in historical corpora. However, change related to phonology, morphology and syntax has remained out of the spotlight in NLP research. In this study, we seek to bridge this gap as regards phonology: Inspired by the work on LSC, we propose a method whereby sound change is traced via spelling change in historical text and modeled by training diachronic character embeddings over text from different time periods.\nWe start by reviewing previous approaches to the automatic detection of semantic shifts and spelling modification due to sound change. Then we formulate our hypothesis that a sound change can be traced using diachronic distributional embeddings. While sound change is not completely analogous to word meaning change, we argue that similar methods can be used for both. To verify our hypothe-\n1A list of available resources for different languages is provided in the Guide to Medieval Manuscript Research from the University of Chicago Library: https://guides.lib. uchicago.edu/c.php?g=813534&p=5805534.\nsis, we conduct three studies on simulated sound change. First, we test the methods on the phonological environment of a simple artificial language. Then, we apply the same methods to a more complex scenario created by simulating sound change in a corpus of synchronic Danish text. Having established the suitability of the methods on these two datasets, we finally experiment with tracing a well-known sound change in real historical language data, again in Danish."
    }, {
      "heading" : "2 Related work",
      "text" : "The application of NLP methods to automatic LSC detection is already a rather well-developed subfield of NLP research (Tahmasebi et al., 2018; Kutuzov et al., 2018). In particular, the emergence of word embeddings as a viable way to model the distributional hypothesis in semantics (Firth, 1957) has paved the way for an application of word embeddings to LSC modeling (Kim et al., 2014; Hamilton et al., 2016b; Eger and Mehler, 2016; Yao et al., 2018). Synchronically, the meaning of a word is characterized by word embeddings in terms of the contexts it appears in. LSC is captured by training word embeddings at different time points and comparing these distributions typically using cosine distance.\nThe main issues in this comparison is the alignment of temporal embeddings spaces, especially for neural embeddings as these are initialized and trained stochastically, which means that separate runs – on even the same data – will yield different embeddings spaces. Thus, work has focused on the development of methods to perform alignments to make embedding spaces comparable across time (see Kutuzov et al. (2018) for an overview). As an alternative to neural embeddings, scholars have also used purely count-based measures, which are naturally aligned across dimensions. Normalisation techniques are also applied, e.g. based on positive pointwise mutual information (PPMI) (Hamilton et al., 2016b; Yao et al., 2018).\nMost studies of LSC do not rely on a control dataset against which to validate their conclusions. In Dubossarsky et al. (2017), on the contrary, it is argued that any claims about putative laws of semantic change in diachronic corpora must be evaluated against a relevant control condition. The authors propose a methodology in which a control condition is created artificially from the original diachronic text collection by reshuffling the data.\nNo systematic LSC is expected in the artificially developed control dataset.\nThe distributional hypothesis has also been proposed as an explanatory model within the domain of phonology suggesting that phonological classes are acquired through distributional information (Chomsky and Halle, 1968; Mielke, 2008). Driven by this hypothesis, recent work has focused on testing how distributional properties can be learned by phoneme embeddings (see Mayer 2020 for an overview). Silfverberg et al. (2018) investigated to what extent learned vector representations of phonemes align with their respective representations in a feature space in which dimensions are articulatory descriptors (e.g., ±plosive). Recently, Mayer (2020) has shown that phonological classes, such as long and short vowels, can be deduced from phoneme embeddings normalised using PPMI by iteratively performing PCA on candidate classes.\nThus, while the distributional hypothesis for phonology is well-established, one notable issue is the fact that the empirical evidence to study sound change is relatively inaccessible since it requires recorded speech or phonologically transcribed data. Simulation is therefore used as a tool for studying the underlying mechanisms of sound change by creating computational models based on linguistic theory (Wedel, 2015). Through simulation, questions pertaining to e.g., what factors influence the (in)stability of vowel systems across generations (de Boer, 2003) can be modeled by controlling the assumptions made by the model. Work on simulation ranges from implementing theoretical approaches using mathematical models (Pierrehumbert, 2001; Blythe and Croft, 2012) to iterated learning and neural networks (Hare and Elman, 1995; Beguš, 2021).\nWhile the output of such models can be tested empirically on what we observe at a synchronic level, they are primarily theoretically driven. In this paper, we wish to take a data-driven approach and utilize some of the methods reviewed above to track historical sound change in writing. Rather than using word embeddings as done to model lexical change, we will use character embeddings, that are better suited to the task of sound change modeling."
    }, {
      "heading" : "3 Modeling sound change",
      "text" : "Within the field of LSC detection, change in word semantics is traditionally measured by computing pairwise similarity (Hamilton et al., 2016b) over\na time series, (t, ..., t+ δ), in which a shift in the meaning of a word, wi, can be measured by its relative distance to another word, wj . In this way, hypotheses about specific shifts may be tested. Another measure is semantic displacement, in which semantic change for a given word is quantified by measuring its temporal displacement. For both measures, looking at consecutive time steps provides a measure to the rate of change of a word – in relation to another word, or independently.\nWhile LSC is about meaning shifts of unchanged word forms, sound change is a change of form, i.e., a given phoneme changes to another one within certain contexts. We denote such a change a → b / c. While changes of either a or b will be reflected in changes to their individual distributions (displacement), looking at them independently of one another will not tell us whether one of the phonemes is becoming similar to the other. Therefore, we suggest to look at the pairwise similarity between a and b. More specifically, given a time series (t1, ..., tn), in which t1 denotes a time before a sound change was in effect and tn denotes a time where a sound change is completed, we expect bi to move towards a1 as i → n, in other words to become similar to a1, since it will begin to appear in the same contexts.\nAs was noted earlier, sound is not accessible in historical text, to which we would like to be able to apply our methodology. Therefore, we take graphemes as a proxy for sound, and model sound change through changes in the distance between pairs of character distributions. In addition, before assuming that an observed decrease in the distance between two such distributions reflects a real change, we also want to see that the same decrease is not visible in a control corpus in which no such change has indeed taken place."
    }, {
      "heading" : "4 Experimental setup",
      "text" : "In order to verify the hypothesis that sound change can be traced using distributional information with the methodology proposed above, we test whether we are able to trace simulated change in synthetic data. As a first synthetic setting, we restrict ourselves to track change in a synthetic language with simple phonotactics. In this way, we get a sense of whether the proposed hypothesis works under perfect conditions, i.e., one in which characters correspond with phonemes one-to-one . In the second synthetic setting, we seek to imitate the condition\nof tracing change in an orthographic setting by simulating change in a corpus of synchronic text in which character distributions interact with the noise added by spelling and lexicon.\nIn both synthetic settings, we compare the simulated change to a control setting where no change has occurred.\nFinally, we will test the hypothesis on real data. Our goal is to trace the lenition after vowels of voiceless plosives, p t k, to their voiced counterparts, b d g, in historical Danish. While this change is believed to have initiated around the beginning of the 14th century, details about the relative chronology of the series and geographical distribution of the change are difficult to account for (Frederiksen, 2018). Therefore, in an attempt to discover interesting patterns of this change, we train character embeddings on historical sources from the periods following the time when the change is believed to have started. As we did for the synthetic data, and again following Dubossarsky et al. (2017), we also introduce a control setting to test the significance of the observed changes."
    }, {
      "heading" : "4.1 Data",
      "text" : "Parupa is an artificial language introduced by Mayer (2020). It is characterized by a small phonological inventory2, and simple phonotactic rules for how sounds combine:\n• only CV syllables are allowed\n• /p t k/ occur before high vowels, /i u/\n• /b d g/ occur before non-high vowels, /e o/\n• only /b p/ occur word-initially\n• /r/ occurs before all vowels\n• all consonants can occur before /a/\nWe created five corpora of Parupa using the Hidden Markov Model provided by Mayer (2020)3: While the first corpus, parupa1, preserves the phonotactic rules listed above, the remaining four include a sound change, p → b /_ u, i 4 which happens gradually (linearly) and is fully completed in parupa5. Additionally, we created five control corpora (one for each of the target ones and with the same vocabulary) which do not include any\n2C: /p t k b d g r/ V: /i e u o a/ 3https://github.com/connormayer/\ndistributional_learning 4i.e., p changes into b when preceding u or i.\nsimulated sound change. Each of the corpora consists of 50, 000 words.\nThe Danish UD treebank To collect a corpus of synchronic language, we extracted the training sentences from the Danish UD treebank (Johannsen et al., 2015). From this collection of sentences, we created five sub-corpora (UD-Danish1-5) in which we simulated a sound change, g → k / V_{V # t#}5. As done in the case of Parupa, the sound change was simulated gradually, with linear increase in change probabilities (i.e., 0, 0.25, 0.50, 0.75, 1). To create the control condition, we also kept a version of the sub-corpora where no change was simulated. The five control versions are thus identical to the five target corpora in terms of vocabulary and distributions, except for the simulated change.\nHistorical spellings of geographical names Danmarks Stednavne is a on-going lexicographic book series creating a register of geographical names in Denmark. The register also serves as a philological resource by listing attestations of the names coming from various historical resources. For example, the entry for Copenhagen includes over 700 historical attestations listed by date6. In addition to the printed volumes (Danmarks Stednavne, 1922–2013), geographical names and their connected metadata (e.g., geographical location and historical attestations) have been digitized, and can be found in an online edition7 which comprises over 210, 000 names and 900, 000 historical attestations. To study the lenition of /p t k/, we extracted historical attestations of names ranging from the 12th to the 18th century. Using the attestation before the 14th century as a reference to the time before the change was initiated (t1), we divided the list of names into bins of half a century to track the development of character embeddings through time8, This provides us with eleven sub-corpora with 31, 000 (±15, 000) name tokens on average.\n5i.e., g between vowels, word-final after vowel, or after vowel preceding word-final t. The latter condition was created in order to capture adverbial forms of adjectives ending in -g.\n6e.g., Kopmanahafn (1247), Køpmannehafn (1249), Kiøpnehaffn (1388), Kiøbendehaffn (1429).\n7https://danmarksstednavne. navneforskning.ku.dk\n8The choice of bin size is an important issue (Kutuzov et al., 2018). From a philological perspective, 50 years correspond to two generations of writers (’spellers’), which is considered a realistic bin size to track development in writing.\nIn order to create a control setting, we generated a corresponding number of sub-corpora by stratifying the names with respect to their date of attestation, following the approach by Dubossarsky et al. (2017)."
    }, {
      "heading" : "4.2 Character embedding model",
      "text" : "To represent characters in a distributional space, we use PPMI embeddings. Contrary to dense embeddings, these are easy to interpret and when compared across different initializations, they are naturally aligned, so we do not introduce noise caused by the alignment process.\nFor the synthetic settings, we limit the context windows to the modeling of trigrams, which should be sufficient to model the context of where a sound change occurs. For the tracking of lenition in Danish, we expand to context to 4-grams. Using the implementation by Mayer (2020), the sliding window is directional, and thus we distinguish contexts preceding and following the target character. While this directionality is neglected when creating PPMI word embeddings, the direction matters when using character embeddings to test the intuition behind the distributional hypothesis, in which direction in a context is meaningful."
    }, {
      "heading" : "4.3 Measuring change",
      "text" : "We measure sound change in terms of a decrease in the distance between two character distributions over time. In other words, given two character distributions A and B corresponding to any two phonemes /a/ and /b/, we should see that distance(A(1), B(n)) gets smaller for greater values of n if there is a change A→ B.\nWhile most studies use cosine distance to measure the difference between distribution (Kutuzov et al., 2018), we chose to use Euclidean distance as it directly reflects our hypothesis by taking the sum of differences in each dimension (context).\nFor each of the corpora being investigated, we use the R software (R Core Team, 2021) and the ’effects’ package (Fox and Weisberg, 2019) to build linear regression models that predict the distributional distance between two sounds per temporal interval in the target and the control versions of the corpus. The advantage of employing linear regression in this case is that we can test the effect of multiple factors as well as their interaction9. In\n9See also (Shoemark et al., 2019) on the advantages of using linear regression in semantic change detection.\nour case, distance between the two sounds being investigated is the dependent variable, and we want to predict main effects of temporal interval and corpus as well as the interaction between them. To argue that there has been a sound change across time, there must be a significant effect of temporal interval on distance. In addition, we would like to see an interaction between this effect and the effect of the corpus variable in that the change should be absent, or at least significantly smaller, in the control corpus."
    }, {
      "heading" : "5 Results",
      "text" : "Table 1 shows the results of the linear regression models we developed to test whether any evidence of sound change discovered in the target corpora, where sound change is either simulated or historically present, stands the comparison with the control corpora. The ‘intercept’ estimate corresponds to the distance predicted between the two sounds being investigated in the initial temporal interval. The ‘Bin’ effect shows by how much the distance is expected to change for every temporal interval. A negative effect means that the distance between the two sounds is becoming smaller. The ‘Control’ ef-\nfect shows the predicted change to the initial Intercept in the control corpus, and finally ‘Bin:Control’ shows the interaction between temporal bin and corpus type.\nIn both the corpora where change is simulated, there is a significant effect of temporal interval. This is expected given the fact that gradual change has been induced in the data. The effect of the control corpus on the initial sound distance is significant for Parupa but not for UD Danish. More importantly, the interaction between the effect of the temporal bin and the control corpus is significant in both cases. The interaction supports the hypothesis that we see a pattern of change in the simulated corpora that is significantly different compared to the control data. The interactions are shown in the plots in Figure 1.\nTurning to the results for the Danish Geographical Names corpus, while the models show significant effects of Bin, Control and interaction between the two for the k→ g and the t→ d changes, only the effect of Bin is significant for the p→ b change. When we look at the corresponding interaction plots in Figure 2, we see that the distance between p and b in the corpus seems to increase rather than diminish (as also shown by the positive\nBin effect), and to do so in a rather non-linear way. The changes displayed in the plots in (b) and (c), on the contrary, follow the expected trend. The observed consonant is moving towards its voiced version in the real corpus but not in the control."
    }, {
      "heading" : "6 Discussion",
      "text" : "The results from the two simulation studies suggest that sound change can be traced with our proposed methodology of measuring the distance between pairs of character distributions over time. We showed this both in a simplified setting (Parupa), and in the orthographically noisy environment provided by synchronic Danish data (UD Danish).\nThe main assumption in these simulation studies was that change could be modeled linearly. However, as discussed by scholars, change is most often not linear, but rather follows an s-shaped curve through a community (Denison, 2003). In a similar study on synthetic data, nevertheless, Shoemark et al. (2019) showed for LSC detection that tracing the change under a linear assumption, such as ours, still performs well. The results obtained in our study seem to confirm this finding in the case of sound change.\nMoving on to the results on the tracing of leni-\ntion in historical sources, we were able to identify a change from /t k/→ /d g/. However, this general result does not tell us much about what patterns the model picked up. To get a sense of this, instead of looking at the euclidean distance for the full embedding, we ran linear regression on the target data looking at differences between character distributions for each dimension. We then extracted the patterns corresponding to the dimensions showing significant differences and considered those with the highest Pearson’s r coefficient (Tables 2-4).\nStarting with the resulting patterns for Parupa and UD Danish, in both cases we are able to identify the exact contexts where the change was simulated: In Parupa before i/u and in the UD Danish corpus, between vowels and in the frequent suffix -ig(t) (although the end-of-word is not captured due to n-gram size restrictions).\nMoving on to the tracing of sound change in real data, we focus our analysis on k→ g, which showed the greatest change. Considering first the word-final patterns, wi_# and vi_#, to spellings of the word vig ‘inlet’, commonly used as a suffix in the formation of geographical names in Danish. Descending from a Proto-Germanic word with final -k (wı̄kwan ‘to give way; to turn (away)’, compare German weichen ‘id.’ and Dutch wijken ‘id.’ (Kroonen, 2013)), the suffix is in early sources attested with a -k: For example, out of the six written sources of the geographical name Rørvig before the 14th century (corresponding to bin 1-3 in our study), four were written with a -k, while in later sources forms with -g became predominant, with the latest attestation of -k appearing in 1465. All of the patterns can be attributed to spellings related to similar changes10,11 with the exception of oli_ and ri_#, which do not have comparable ancestors with -k: These will have to be explained by later innovations, the first by the emergence of the word bolig ‘home;dwelling’ in geographical name formation, and the latter possibly indicating later spellings of names ending -rg.\nThis latter example is related to an important issue in language evolution: When language language changes through generations, we also observe shifts in culture. Different types of ‘data drift’ are in fact discussed by Hamilton et al. (2016a) in\n10Danish sig ‘bog; mire’ from Old Danish sik, compare Norwegian and Swedish (dialectal) sik (Danmarks Stednavne, 1922–2013)\n11Danish ager ‘field’ from Proto-Germanic akra, compare English acre and Swedish åker (Kroonen, 2013).\nthe context of LSC. The authors suggest that they may be modeled independently of each other by means of different measures of change. The effect of cultural change has yet to be discussed for sound change. However, it is an important discussion, since phonology, when looking at it from a corpus-based perspective, is not only governed by phonotactic constraints, but also a by-product of word usage, which is in turn dependent on cultural patterns.\nIn this respect, another important point to note about the retrieved patterns – both from the simulation of UD Danish and the tracing of k → g – is that many of them reflect derivational or inflectional suffixes, and are thus characterized by high frequency of occurrence across word forms. While the observation that frequent patterns are more easily captured may seem trivial, it cannot be ignored that the model may be less sensitive to infrequent patterns.12\nThe same mechanism is reflected in the model’s lack of generalisation, which explains treating forms like vig, wig and viig as separate entries. This is a design consequence, in that we use PPMI weighting on raw n-gram counts. This method enabled us to interpret the exact inner workings of the model and find the contexts in which a change has happened. If we had used neural methods, in which characters are represented by dense embeddings, similar characters would have shared similar representations, thereby perhaps allowing the model to generalise e.g., to sound change occurring after a vowel. In this study, we wanted to privilege explainability, but dense representations should be explored in the future."
    }, {
      "heading" : "7 Conclusion and future work",
      "text" : "In this paper we presented a novel method for the modeling of sound change through the use of diachronic character embeddings. Sound change is modeled in terms of increasing similarity between character distributions across time intervals. The proposed method was tested on synthetic data with promising results, and then applied to a real world scenario with the goal of tracing the lenition of\n12Whether frequency could explain the lack of evidence for observing p → b is to be investigated further. Germanic p descends from Proto-Indo-European (PIE) *b, which has a special place in the PIE phoneme inventory, being the black sheep that some scholars do not believe to have existed due to its few attestations. Thus, the attestations of Germanic p most often come from loan words and are not seen in morphemes. Thus the evidence for p → b is inherently scarcer.\n/p t k/→ /b d g/ in Danish by looking at spelling in historical sources. The method was able to detect the changes for two of the sound pairs, and also to point at specific contexts of occurrence that influenced the changes.\nFor scholars interested in sound change, there are a number of important open questions, such as the relative chronology and geographical distribution of sound shifts. Although we have not addressed these questions here, we believe our methodology can be further developed in ways that would allow to do so, e.g., by adding geographical location as an additional factor in the models. Both issues would constitute interesting avenues for future research.\nIn this paper we have used purely count-based methods. While this approach enables us to directly interpret the results of the models, it also suffers from its inability to generalise across contexts. This drawback motivates experimenting with neural methods that make use of dense character representations, to test whether they can make similar generalisations as done by historical linguists, particularly as regards infrequent patterns that could be captured across word forms."
    } ],
    "references" : [ {
      "title" : "S-curves and the mechanisms of propagation in language change",
      "author" : [ "Richard A Blythe", "William Croft." ],
      "venue" : "Language, pages 269–304.",
      "citeRegEx" : "Blythe and Croft.,? 2012",
      "shortCiteRegEx" : "Blythe and Croft.",
      "year" : 2012
    }, {
      "title" : "The sound pattern of English",
      "author" : [ "Noam Chomsky", "Morris Halle." ],
      "venue" : "Harper & Row, New York.",
      "citeRegEx" : "Chomsky and Halle.,? 1968",
      "shortCiteRegEx" : "Chomsky and Halle.",
      "year" : 1968
    }, {
      "title" : "Conditions for stable vowel systems in a population",
      "author" : [ "Bart de Boer." ],
      "venue" : "Advances in Artificial Life, pages 415–424, Berlin, Heidelberg. Springer Berlin Heidelberg.",
      "citeRegEx" : "Boer.,? 2003",
      "shortCiteRegEx" : "Boer.",
      "year" : 2003
    }, {
      "title" : "Log(ist)ic and simplistic scurves",
      "author" : [ "David Denison." ],
      "venue" : "Raymond Hickey, editor, Motives for Language Change, page 54–70. Cambridge University Press.",
      "citeRegEx" : "Denison.,? 2003",
      "shortCiteRegEx" : "Denison.",
      "year" : 2003
    }, {
      "title" : "Outta control: Laws of semantic change and inherent biases in word representation models",
      "author" : [ "Haim Dubossarsky", "Daphna Weinshall", "Eitan Grossman." ],
      "venue" : "Proceedings of the 2017 Conference on Empirical Methods in Natural Language Processing,",
      "citeRegEx" : "Dubossarsky et al\\.,? 2017",
      "shortCiteRegEx" : "Dubossarsky et al\\.",
      "year" : 2017
    }, {
      "title" : "On the linearity of semantic change: Investigating meaning variation via dynamic graph models",
      "author" : [ "Steffen Eger", "Alexander Mehler." ],
      "venue" : "Proceedings of the 54th Annual Meeting of the Association for Computational Linguistics (Volume 2: Short Pa-",
      "citeRegEx" : "Eger and Mehler.,? 2016",
      "shortCiteRegEx" : "Eger and Mehler.",
      "year" : 2016
    }, {
      "title" : "A synopsis of linguistic theory, 1930-1955",
      "author" : [ "John R Firth." ],
      "venue" : "Studies in linguistic analysis.",
      "citeRegEx" : "Firth.,? 1957",
      "shortCiteRegEx" : "Firth.",
      "year" : 1957
    }, {
      "title" : "An R Companion to Applied Regression, third edition",
      "author" : [ "John Fox", "Sanford Weisberg." ],
      "venue" : "Sage, Thousand Oaks CA.",
      "citeRegEx" : "Fox and Weisberg.,? 2019",
      "shortCiteRegEx" : "Fox and Weisberg.",
      "year" : 2019
    }, {
      "title" : "Gammeldansk",
      "author" : [ "Britta Olrik Frederiksen." ],
      "venue" : "Ebba Hjorth, Henrik Galberg Jakobsen, Bent Jørgensen, Brigitte Jacobsen, Merete Korvenius Jørgensen, and Laurids Kristian Fahl, editors, Ord for ord for ord, volume 2 of Dansk Sproghistorie, pages",
      "citeRegEx" : "Frederiksen.,? 2018",
      "shortCiteRegEx" : "Frederiksen.",
      "year" : 2018
    }, {
      "title" : "Cultural shift or linguistic drift? comparing two computational measures of semantic change",
      "author" : [ "William L. Hamilton", "Jure Leskovec", "Dan Jurafsky." ],
      "venue" : "Proceedings of the 2016 Conference on Empirical Methods in Natural Language Processing, pages",
      "citeRegEx" : "Hamilton et al\\.,? 2016a",
      "shortCiteRegEx" : "Hamilton et al\\.",
      "year" : 2016
    }, {
      "title" : "Diachronic word embeddings reveal statistical laws of semantic change",
      "author" : [ "William L. Hamilton", "Jure Leskovec", "Dan Jurafsky." ],
      "venue" : "Proceedings of the 54th Annual Meeting of the Association for Computational Linguistics (Volume 1: Long Papers), pages",
      "citeRegEx" : "Hamilton et al\\.,? 2016b",
      "shortCiteRegEx" : "Hamilton et al\\.",
      "year" : 2016
    }, {
      "title" : "Learning and morphological change",
      "author" : [ "Mary Hare", "Jeffrey L Elman." ],
      "venue" : "Cognition, 56(1):61–98.",
      "citeRegEx" : "Hare and Elman.,? 1995",
      "shortCiteRegEx" : "Hare and Elman.",
      "year" : 1995
    }, {
      "title" : "Universal dependencies for danish",
      "author" : [ "Anders Johannsen", "Héctor Martínez Alonso", "Barbara Plank." ],
      "venue" : "International Workshop on Treebanks and Linguistic Theories (TLT14), page 157.",
      "citeRegEx" : "Johannsen et al\\.,? 2015",
      "shortCiteRegEx" : "Johannsen et al\\.",
      "year" : 2015
    }, {
      "title" : "Temporal analysis of language through neural language models",
      "author" : [ "Yoon Kim", "Yi-I Chiu", "Kentaro Hanaki", "Darshan Hegde", "Slav Petrov." ],
      "venue" : "Proceedings of the ACL 2014 Workshop on Language Technologies and Computational Social Science, pages",
      "citeRegEx" : "Kim et al\\.,? 2014",
      "shortCiteRegEx" : "Kim et al\\.",
      "year" : 2014
    }, {
      "title" : "Etymological Dictionary of Proto-Germanic",
      "author" : [ "Guus Kroonen." ],
      "venue" : "Brill, Leiden, The Netherlands.",
      "citeRegEx" : "Kroonen.,? 2013",
      "shortCiteRegEx" : "Kroonen.",
      "year" : 2013
    }, {
      "title" : "Diachronic word embeddings and semantic shifts: a survey",
      "author" : [ "Andrey Kutuzov", "Lilja Øvrelid", "Terrence Szymanski", "Erik Velldal." ],
      "venue" : "Proceedings of the 27th International Conference on Computational Linguistics, pages 1384–1397, Santa Fe, New",
      "citeRegEx" : "Kutuzov et al\\.,? 2018",
      "shortCiteRegEx" : "Kutuzov et al\\.",
      "year" : 2018
    }, {
      "title" : "An algorithm for learning phonological classes from distributional similarity",
      "author" : [ "Connor Mayer." ],
      "venue" : "Phonology, 37(1):91–131.",
      "citeRegEx" : "Mayer.,? 2020",
      "shortCiteRegEx" : "Mayer.",
      "year" : 2020
    }, {
      "title" : "The emergence of distinctive features",
      "author" : [ "Jeff Mielke." ],
      "venue" : "Oxford University Press.",
      "citeRegEx" : "Mielke.,? 2008",
      "shortCiteRegEx" : "Mielke.",
      "year" : 2008
    }, {
      "title" : "The early history of historical phonology",
      "author" : [ "Robert W Murray." ],
      "venue" : "Patrick Honeybone and Joseph Salmons, editors, The Oxford Handbook of Historical Phonology, Oxford Handbooks in Linguistics. OUP Oxford.",
      "citeRegEx" : "Murray.,? 2015",
      "shortCiteRegEx" : "Murray.",
      "year" : 2015
    }, {
      "title" : "Exemplar dynamics: Word frequency, lenition and contrast",
      "author" : [ "Janet B. Pierrehumbert" ],
      "venue" : "Typological studies in language,",
      "citeRegEx" : "Pierrehumbert.,? \\Q2001\\E",
      "shortCiteRegEx" : "Pierrehumbert.",
      "year" : 2001
    }, {
      "title" : "R: A Language and Environment for Statistical Computing",
      "author" : [ "R Core Team." ],
      "venue" : "R Foundation for Statistical Computing, Vienna, Austria.",
      "citeRegEx" : "Team.,? 2021",
      "shortCiteRegEx" : "Team.",
      "year" : 2021
    }, {
      "title" : "Room to Glo: A systematic comparison of semantic change detection approaches with word embeddings",
      "author" : [ "Philippa Shoemark", "Farhana Ferdousi Liza", "Dong Nguyen", "Scott Hale", "Barbara McGillivray." ],
      "venue" : "Proceedings of the 2019 Conference on",
      "citeRegEx" : "Shoemark et al\\.,? 2019",
      "shortCiteRegEx" : "Shoemark et al\\.",
      "year" : 2019
    }, {
      "title" : "Sound analogies with phoneme embeddings",
      "author" : [ "Miikka P. Silfverberg", "Lingshuang Mao", "Mans Hulden." ],
      "venue" : "Proceedings of the Society for Computation in Linguistics (SCiL) 2018, pages 136–144.",
      "citeRegEx" : "Silfverberg et al\\.,? 2018",
      "shortCiteRegEx" : "Silfverberg et al\\.",
      "year" : 2018
    }, {
      "title" : "Survey of computational approaches to lexical semantic change",
      "author" : [ "Nina Tahmasebi", "Lars Borin", "Adam Jatowt." ],
      "venue" : "Preprint at ArXiv 2018.",
      "citeRegEx" : "Tahmasebi et al\\.,? 2018",
      "shortCiteRegEx" : "Tahmasebi et al\\.",
      "year" : 2018
    }, {
      "title" : "Simulation as an investigative tool in historical phonology",
      "author" : [ "Andrew Wedel." ],
      "venue" : "Patrick Honeybone and Joseph Salmons, editors, The Oxford Handbook of Historical Phonology, Oxford Handbooks in Linguistics. OUP Oxford.",
      "citeRegEx" : "Wedel.,? 2015",
      "shortCiteRegEx" : "Wedel.",
      "year" : 2015
    }, {
      "title" : "Dynamic word embeddings for evolving semantic discovery",
      "author" : [ "Zijun Yao", "Yifan Sun", "Weicong Ding", "Nikhil Rao", "Hui Xiong." ],
      "venue" : "Proceedings of the Eleventh ACM International Conference on Web Search and Data Mining.",
      "citeRegEx" : "Yao et al\\.,? 2018",
      "shortCiteRegEx" : "Yao et al\\.",
      "year" : 2018
    } ],
    "referenceMentions" : [ {
      "referenceID" : 18,
      "context" : "The study of sound change goes back to the beginnings of modern linguistics in early nineteenth century, when scholars such as Rask and Grimm started making hypotheses about the way sound changes over time, which in turn lead to the discovery of regular sound correspondences between ancient languages and the identification of cognates in modern ones (Murray, 2015).",
      "startOffset" : 352,
      "endOffset" : 366
    }, {
      "referenceID" : 23,
      "context" : "The application of NLP methods to automatic LSC detection is already a rather well-developed subfield of NLP research (Tahmasebi et al., 2018; Kutuzov et al., 2018).",
      "startOffset" : 118,
      "endOffset" : 164
    }, {
      "referenceID" : 15,
      "context" : "The application of NLP methods to automatic LSC detection is already a rather well-developed subfield of NLP research (Tahmasebi et al., 2018; Kutuzov et al., 2018).",
      "startOffset" : 118,
      "endOffset" : 164
    }, {
      "referenceID" : 13,
      "context" : "1957) has paved the way for an application of word embeddings to LSC modeling (Kim et al., 2014; Hamilton et al., 2016b; Eger and Mehler, 2016; Yao et al., 2018).",
      "startOffset" : 78,
      "endOffset" : 161
    }, {
      "referenceID" : 10,
      "context" : "1957) has paved the way for an application of word embeddings to LSC modeling (Kim et al., 2014; Hamilton et al., 2016b; Eger and Mehler, 2016; Yao et al., 2018).",
      "startOffset" : 78,
      "endOffset" : 161
    }, {
      "referenceID" : 5,
      "context" : "1957) has paved the way for an application of word embeddings to LSC modeling (Kim et al., 2014; Hamilton et al., 2016b; Eger and Mehler, 2016; Yao et al., 2018).",
      "startOffset" : 78,
      "endOffset" : 161
    }, {
      "referenceID" : 25,
      "context" : "1957) has paved the way for an application of word embeddings to LSC modeling (Kim et al., 2014; Hamilton et al., 2016b; Eger and Mehler, 2016; Yao et al., 2018).",
      "startOffset" : 78,
      "endOffset" : 161
    }, {
      "referenceID" : 10,
      "context" : "based on positive pointwise mutual information (PPMI) (Hamilton et al., 2016b; Yao et al., 2018).",
      "startOffset" : 54,
      "endOffset" : 96
    }, {
      "referenceID" : 25,
      "context" : "based on positive pointwise mutual information (PPMI) (Hamilton et al., 2016b; Yao et al., 2018).",
      "startOffset" : 54,
      "endOffset" : 96
    }, {
      "referenceID" : 1,
      "context" : "The distributional hypothesis has also been proposed as an explanatory model within the domain of phonology suggesting that phonological classes are acquired through distributional information (Chomsky and Halle, 1968; Mielke, 2008).",
      "startOffset" : 193,
      "endOffset" : 232
    }, {
      "referenceID" : 17,
      "context" : "The distributional hypothesis has also been proposed as an explanatory model within the domain of phonology suggesting that phonological classes are acquired through distributional information (Chomsky and Halle, 1968; Mielke, 2008).",
      "startOffset" : 193,
      "endOffset" : 232
    }, {
      "referenceID" : 19,
      "context" : "Work on simulation ranges from implementing theoretical approaches using mathematical models (Pierrehumbert, 2001; Blythe and Croft, 2012) to iterated learning and neural networks (Hare and Elman, 1995; Beguš, 2021).",
      "startOffset" : 93,
      "endOffset" : 138
    }, {
      "referenceID" : 0,
      "context" : "Work on simulation ranges from implementing theoretical approaches using mathematical models (Pierrehumbert, 2001; Blythe and Croft, 2012) to iterated learning and neural networks (Hare and Elman, 1995; Beguš, 2021).",
      "startOffset" : 93,
      "endOffset" : 138
    }, {
      "referenceID" : 11,
      "context" : "Work on simulation ranges from implementing theoretical approaches using mathematical models (Pierrehumbert, 2001; Blythe and Croft, 2012) to iterated learning and neural networks (Hare and Elman, 1995; Beguš, 2021).",
      "startOffset" : 180,
      "endOffset" : 215
    }, {
      "referenceID" : 10,
      "context" : "Within the field of LSC detection, change in word semantics is traditionally measured by computing pairwise similarity (Hamilton et al., 2016b) over",
      "startOffset" : 119,
      "endOffset" : 143
    }, {
      "referenceID" : 8,
      "context" : "While this change is believed to have initiated around the beginning of the 14th century, details about the relative chronology of the series and geographical distribution of the change are difficult to account for (Frederiksen, 2018).",
      "startOffset" : 215,
      "endOffset" : 234
    }, {
      "referenceID" : 12,
      "context" : "The Danish UD treebank To collect a corpus of synchronic language, we extracted the training sentences from the Danish UD treebank (Johannsen et al., 2015).",
      "startOffset" : 131,
      "endOffset" : 155
    }, {
      "referenceID" : 15,
      "context" : "dk (8)The choice of bin size is an important issue (Kutuzov et al., 2018).",
      "startOffset" : 51,
      "endOffset" : 73
    }, {
      "referenceID" : 15,
      "context" : "While most studies use cosine distance to measure the difference between distribution (Kutuzov et al., 2018), we chose to use Euclidean distance as it directly reflects our hypothesis by taking the sum of differences in each dimension (context).",
      "startOffset" : 86,
      "endOffset" : 108
    }, {
      "referenceID" : 7,
      "context" : "For each of the corpora being investigated, we use the R software (R Core Team, 2021) and the ’effects’ package (Fox and Weisberg, 2019) to build linear regression models that predict the distributional distance between two sounds per temporal interval in the target and the control versions of the corpus.",
      "startOffset" : 112,
      "endOffset" : 136
    }, {
      "referenceID" : 21,
      "context" : "See also (Shoemark et al., 2019) on the advantages of using linear regression in semantic change detection.",
      "startOffset" : 9,
      "endOffset" : 32
    }, {
      "referenceID" : 3,
      "context" : "However, as discussed by scholars, change is most often not linear, but rather follows an s-shaped curve through a community (Denison, 2003).",
      "startOffset" : 125,
      "endOffset" : 140
    }, {
      "referenceID" : 14,
      "context" : "’ (Kroonen, 2013)), the suffix is in early sources attested with a -k: For example, out of the six written sources of the geographical name Rørvig before the 14th century (corresponding to bin 1-3 in our study), four were written with a -k, while in later sources forms with -g became predominant, with the latest attestation of -k appearing in 1465.",
      "startOffset" : 2,
      "endOffset" : 17
    }, {
      "referenceID" : 14,
      "context" : "Danish sig ‘bog; mire’ from Old Danish sik, compare Norwegian and Swedish (dialectal) sik (Danmarks Stednavne, 1922–2013) (11)Danish ager ‘field’ from Proto-Germanic akra, compare English acre and Swedish åker (Kroonen, 2013).",
      "startOffset" : 210,
      "endOffset" : 225
    } ],
    "year" : 0,
    "abstractText" : "While a great deal of work has been done on NLP approaches to Lexical Semantic Change detection, other aspects of language change have received less attention from the NLP community. In this paper, we address the detection of sound change through historical spelling. We propose that a sound change, a→b / c, can be captured by comparing the relative distance through time between the distributions of the corresponding characters, a and b. We model these distributions using PPMI character embeddings. We verify this hypothesis in synthetic data and then test the method’s ability to trace the well-known historical change of lenition of plosives in Danish historical sources. We show that the models are able to identify several of the changes under consideration and to uncover meaningful contexts in which they appeared. The methodology has the potential to contribute to the study of open questions such as the relative chronology of sound shifts and their geographical distribution.",
    "creator" : null
  }
}